{
  "data": [
    {
      "title": "Що таке Youtube Vanced?",
      "description": "YouTube Vanced - це модифікована версія YouTube з додатковими функціями і поліпшеннями для того, щоб зробити використання YouTube трішки краще!\n\nТакі додаткові функції, як:\n\n- Відтворення у фоні\n- Картинка в картинці\n- Призначені для користувача теми (звичайний темний колір або чорний для OLED)\n- Блокування більшості видів реклами\n- Зміна максимальної здатності відео\n- ...І багато іншого!\n\nДля додаткової інформації, відвідайте <https://vancedapp.com>"
    },
    {
      "title": "А де кнопка для завантаження?",
      "description": "Компанія Google не дозволяє публікацію свого модифікованого додатка в магазині, тому не шукайте його в Play Market, всі ці додатки є підробками.\n\nВи можете завантажити його з офіційного сайту: <https://vancedapp.com>, а також з репозиторію на GitHub: <https://github.com/YTVanced/VancedManager/releases/latest>"
    },
    {
      "title": "Чи буде додаток автоматично оновлюватися?",
      "description": "Ні не буде.\n\nVanced Manager надішле вам повідомлення, коли оновлення вийде.\n\nВи також можете приєднатися до нашого [сервера Discord](https://discord. g/wYrRPgv) або до [каналу в Telegram](https://t.me/Vanced) для отримання останніх новин і сповіщення про оновлення."
    },
    {
      "title": "Чи може Vanced завантажувати відео?",
      "description": "Vanced не має функції завантаження відео і вона ніколи не буде додана.\n\nБагато відео доступні для завантаження безкоштовно в [деяких країнах] (https://support. oogle.com/youtube/answer/6141269). Для решти світу, будь ласка, завантажте YouTube Premium або використовуйте сторонній завантажувач.\n\nЗнову ж таки, команда Vanced НІКОЛИ не додасть завантаження відео в додаток або щось подібне.\n\nЦе причина закриття багатьох модів YouTube в минулому, оскільки Google не любить коли люди завантажують контент, захищений авторським правом, тому не питайте про це!!!"
    },
    {
      "title": "Чому не працюють свайп-жести?",
      "description": "Якщо ви включили \"старі коментарі\" з налаштувань YouTube> Налаштування Vanced> Налаштування зовнішнього вигляду, вимкніть його і запустіть додаток. Якщо це не працює, спробуйте очистити дані додатка і кеш."
    },
    {
      "title": "Чому субтитри недоступні?",
      "description": "Це не проблема. Не всі відео мають субтитри."
    },
    {
      "title": "Ви приймаєте пожертви?",
      "description": "Ми НЕ приймаємо ніяких пожертвувань ні за яких обставин і будь-який сайт або посилання або повідомлення, які говорять про \"пожертвування для Vanced\" - фальшиві.\n\nАле якщо ви хочете підтримати розробників Vanced, ви можете завантажити Brave за [цим посиланням](https://brave.com/kev231) і AdGuard за [цим посиланням](https://adguard.com/en/welcome.html?aid=31141)."
    },
    {
      "title": "Як автоматично приховувати управління плеєром?",
      "description": "Використовуйте вбудовані налаштування спеціальних можливостей для зміни і управління функціями. Відкрийте налаштування в додатку \"Youtube Vanced\" і натисніть на кнопку спеціальних можливостей. Це відкриє параметр, який показаний на малюнку вище.\nЯкщо опції все ще не знайдені, перейдіть до налаштувань пристрою> спеціальними функціями і знайдіть \"Меню спеціальних можливостей\" і відключіть її.\nТакож, якщо це не працює, вимкніть підсилювач звуку, Switch Access, автоматичні субтитри, якщо вони включені."
    },
    {
      "title": "Чому додаток розбито на кілька частин?",
      "description": "Тому що:\n1. Звичайне додаток YouTube теж розбитий на кілька частин.\n2. Такий спосіб встановлення дозволяє завантажувати тільки потрібну вам мову для економії місця.\n3. Додаток містить тільки потрібні бібліотеки для вашого пристрою.\n\nЗвичайно, Vanced Manager або розробники могли б конвертувати все це в звичайний APK, але нам лінь цим займатися. Вам просто потрібно звикнути до того, що ви пропонуємо.\n\nНе хвилюйтеся, Vanced Manager все зробить за вас при натисканні на кнопку \"Встановити\"."
    },
    {
      "title": "Чому колір на екрані запуску відрізняється від теми?",
      "description": "Колір фону на заставці тепер узято з кольору фреймворку Android (система Android), щоб переконатися, що Vanced/Youtube змінює свій колір відповідно до системної теми. Незалежно від кольору в фреймворку Android, такий же колір буде використовуватися і в Vanced.\n\nВи можете використовувати теми Substratum/Swift для зміни кольору теми."
    },
    {
      "title": "Навіщо завантажувати файли встановлення заново?",
      "description": "Причина досить проста: іноді завантажені файли можуть бути пошкоджені і спроба їх встановлення призведе до множинних помилок. Щоб уникнути цього, менеджер перезавантажує файли кожен раз при натисканні кнопки.\n\nОднак, Non-Root інсталятор тепер може використовувати завантажені файли для перевстановлення Vanced."
    },
    {
      "title": "Чому рут-версія не має дозволу на мікрофон?",
      "description": "Все є, якщо ваш Vanced актуальний."
    },
    {
      "title": "Що таке ExoPlayer v1?",
      "description": "Це стара версія медіаплеєра використовуваного YouTube. Продуктивність і стабільність може бути краще при його використанні."
    },
    {
      "title": "Опції для розробників",
      "description": "В розширених налаштуваннях натисніть на розділ \"Про програму\" 6-7 разів, щоб розблокувати секретне меню. Це меню дозволяє використовувати додаткові налаштування відеокодека."
    },
    {
      "title": "How to make YouTube Vanced as default app?",
      "description": "As the title says, a lot of users have been asking many times how they can make YouTube Vanced as default for opening YouTube links from other apps(like browsers, messaging apps and any other app).\n\nFor root, you don't need to worry about because it is already set by default since YouTube Vanced gets replaced with Stock YouTube.\n\nFor non-root, solutions has been divided between as OneUI, MIUI and the rest.  We can't provide solutions for every OS out there, and you may need to Google it by yourself.",
      "fields": [
        {
          "title": "OneUI users:",
          "content": "1. Tap and hold down on YouTube or YouTube Vanced app icon to open the app info.\n2. Scroll down to the `App settings` section\n3. Hit the **Set as default** option\n4. Set the \"**Go to supported URLs setting**\" as \"**In this app**\" option."
        },
        {
          "title": "MIUI users:",
          "content": "Open Settings and search for \"Default apps\" or navigate to Apps > Manage apps > [hit the three dots in the right corner] > Default apps > Opening links. After apps get listed, scroll down until you find YouTube or YouTube Vanced and tap it. Then, set the \"**Open supported links**\" setting as \"**Open**\" instead of \"Ask every time\" or \"Don't open\"."
        },
        {
          "title": "AOSP & other custom UIs (OOS, ColorOS, EMUI, etc.):",
          "content": "1. Choose \"ask every time\" for both the Stock YouTube app and vanced.\n\n2. Open Google Chrome.\n\n3. Search for some YouTube videos on Google.\n\n4. Open links with YouTube vanced app and set as always.\n\n5. Come back to settings where you set \"ask every time\" to YouTube, change that to \"don't open in this app\"."
        }
      ]
    },
    {
      "title": "Why the root variant doesn't work with microG Core?",
      "description": "1. You need to have at least the [pico](https://github.com/opengapps/opengapps/wiki/Pico-Package) variant of GApps to run Vanced.\n\n2. You can’t run Vanced with microG Core without Google Play Services Framework which is available in all GApps packages and it's a required library.\n\n3. If you are worried about your privacy & don’t want to use GApps but still want to use watch YouTube without ads, then the [web version](https://youtube.com) is always available."
    },
    {
      "title": "Why casting doesn't work?",
      "description": "For users with latest v16.16.38 non-root variant, there's a bug in upstream microG. Until that resolves, please wait for updates or roll back to v15 versions. Root users will no issues with casting if they are using Google Play Services."
    },
    {
      "title": "What is APK Signing?",
      "description": "You are reading this because you are not using Vanced Manager or you may have installed Vanced from an unofficial source.\nJust use Vanced Manager!\n\nYou can safely download Vanced Manager from:\n- [Official site](https://vancedapp.com)\n- [GitHub repository](https://github.com/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Is YouTube Vanced on Play Store?",
      "description": "NO!\nAgain, DO NOT install or even try to search for any fake apps named \"YouTube Vanced\" or similar on the Play Store or any app stores to install Vanced.\n\nWe only have [Vanced Guide](https://play.google.com/store/apps/details?id=com.vanced.faq), and it's the only official app published on Play Store.\n\nIf you find any other app with our icon and name, report it as impersonation and give it a bad review.\n\nOur apps can only be found at [official site](https://vancedapp.com)."
    },
    {
      "title": "Why is Vanced not showing up in home screen or app drawer?",
      "description": "You are reading this because you are not using Vanced Manager or you may have installed Vanced from an unofficial source.\nJust use Vanced Manager!\n\nYou can safely download Vanced Manager from:\n- Official site <https://vancedapp.com>\n- [GitHub repository](https://github.com/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Why aren't videos playing?",
      "description": "Try restarting the app. It might also because of your internet connection or your device."
    },
    {
      "title": "Why am I having the 480p limit?",
      "description": "Due to the COVID-19, Google is restricting data usage of several countries. This happens on the server and affects both Vanced and stock YouTube users.",
      "fields": [
        {
          "title": "Workarounds:",
          "content": "1. Connect to a VPN of a different region.\n2. Use the [web version](https://youtube.com)\n3. Since the 480p restriction is only for phones and not tablets, you can change the device model in YouTube Vanced to overcome the restriction.\n\n#### How to change the device model?\n1. Open YouTube Vanced.\n2. Go to Settings\n3. Tap the `Vanced Settings`\n4. Enable hidden settings:\n  - Scroll down and tap on the `About` section till you get a message saying `Hidden settings enabled`.\n5. Go to `Codec override`\n6. Set manufacturer to `Samsung` and model to `SM-T865`.\n7. Restart the app.\n\nAfter restarting, the 480p limit should be gone."
        }
      ]
    },
    {
      "title": "How to hide the microG notification?",
      "description": "To hide microG the notification,\n\n1. You can disable battery optimization for Vanced microG and reboot your device.\n\n2. If the above method doesn't work, disable microG notifications by holding on to the notification, toggle it off and tap Save.\n\n>Disabling app notifications can be done in different ways depending on the Android user interface. If you don't know how to disable it, try using Google for learning how to disable it."
    },
    {
      "title": "Does 1440p look better on my 1080p screen?",
      "description": "Yes, but only if the video ratio is something like 18:9, 21:9, ... You can enable `Stats for nerds` in Settings > General to confirm it.\n\nTo enable higher resolutions, go to Vanced settings > Video settings and turn on `Max resolution` then restart the app."
    }
  ]
}
