{
  "data": [
    {
      "title": "Що таке Youtube Vanced?",
      "description": "YouTube Vanced - це модифікована версія YouTube з додатковими функціями і покращеннями для того, щоб зробити використання YouTube ще краще!\n\nТакі додаткові функції, як:\n\n- Відтворення у фоні\n- Картинка в картинці\n- Призначені для користувача теми (звичайний темний колір або чорний для OLED)\n- Блокування більшості видів реклами\n- Зміна максимальної здатності відео (дозволяє відтворення відео з роздільною здатністю, вищою, ніж ваш екран)\n- ...І багато іншого!\n\nДля додаткової інформації, відвідайте <https://vancedapp.com>"
    },
    {
      "title": "Де кнопка Завантаження?",
      "description": "Звичайно, Google не дозволить модифіковану версію власної програми бути в магазині, тому не шукайте її в Google Play Маркеті, там тільки фальшиві програми.\n\nПрограми Vanced можна завантажити і встановити за допомогою Vanced Manager, який можна знайти на нашому офіційному сайті: <https://vancedapp.com>, але ви також можете взяти його з [репозиторія GitHub](https://github.com/YTVancedManager/releases/latest)"
    },
    {
      "title": "Чи буде YouTube Vanced автоматично оновлюватись?",
      "description": "Ні не буде.\n\nVanced Manager надішле вам сповіщення, коли оновлення буде доступне.\n\nВи також можете приєднатися до нашого [Discord Сервера](https://discord.gg/wYrRPgv) або до [каналу в Telegram](https://t.me/Vanced) для отримання останніх новин і інформації про оновлення."
    },
    {
      "title": "Чи може Vanced завантажувати відео?",
      "description": "Vanced не має функції завантаження відео і ніколи не матиме.\n\nБагато відео доступні для завантаження безкоштовно в [деяких країнах] (https://support.google.com/youtube/answer/6141269). Для решти світу, будь ласка, отримайте YouTube Premium або використовуйте сторонній завантажувач.\n\nЗнову ж таки, команда Vanced НІКОЛИ не додасть функцію завантаження відео або щось подібне в додаток.\n\nЦе причина закриття багатьох модифікацій YouTube в минулому, оскільки Google не любить, коли люди завантажують контент, захищений авторським правом, тому не просіть про це!!!"
    },
    {
      "title": "Чому свайп-жести не працюють?",
      "description": "Якщо ви включили \"старі коментарі\" з налаштувань YouTube> Налаштування Vanced> Налаштування зовнішнього вигляду, вимкніть його і запустіть додаток. Якщо це не працює, спробуйте очистити дані додатка і кеш."
    },
    {
      "title": "Чому субтитри недоступні?",
      "description": "Це не проблема. Не всі відео мають субтитри."
    },
    {
      "title": "Ви приймаєте пожертви?",
      "description": "Ми НЕ приймаємо ніяких пожертвувань ні за яких обставин і будь-який сайт або посилання або повідомлення, які говорять про \"пожертвування для Vanced\" - фальшиві.\n\nАле якщо ви хочете підтримати розробників Vanced, ви можете завантажити Brave за [цим посиланням](https://brave.com/kev231) і AdGuard за [цим посиланням](https://adguard.com/en/welcome.html?aid=31141)."
    },
    {
      "title": "Як автоматично приховувати управління плеєром?",
      "description": "Використовуйте вбудовані налаштування спеціальних можливостей для зміни і управління функціями. Відкрийте налаштування в додатку \"Youtube Vanced\" і натисніть на кнопку спеціальних можливостей. Це відкриє параметр, який показаний на малюнку вище.\nЯкщо опції все ще не знайдені, перейдіть до налаштувань пристрою> спеціальними функціями і знайдіть \"Меню спеціальних можливостей\" і відключіть її.\nТакож, якщо це не працює, вимкніть підсилювач звуку, Switch Access, автоматичні субтитри, якщо вони включені."
    },
    {
      "title": "Чому додаток розбито на кілька частин?",
      "description": "Тому що:\n1. Звичайне додаток YouTube теж розбитий на кілька частин.\n2. Такий спосіб встановлення дозволяє завантажувати тільки потрібну вам мову для економії місця.\n3. Додаток містить тільки потрібні бібліотеки для вашого пристрою.\n\nЗвичайно, Vanced Manager або розробники могли б конвертувати все це в звичайний APK, але нам лінь цим займатися. Вам просто потрібно звикнути до того, що ви пропонуємо.\n\nНе хвилюйтеся, Vanced Manager все зробить за вас при натисканні на кнопку \"Встановити\"."
    },
    {
      "title": "Чому колір на екрані запуску відрізняється від теми?",
      "description": "Колір фону на заставці тепер узято з кольору фреймворку Android (система Android), щоб переконатися, що Vanced/Youtube змінює свій колір відповідно до системної теми. Незалежно від кольору в фреймворку Android, такий же колір буде використовуватися і в Vanced.\n\nВи можете використовувати теми Substratum/Swift для зміни кольору теми."
    },
    {
      "title": "Навіщо завантажувати файли встановлення заново?",
      "description": "Причина досить проста: іноді завантажені файли можуть бути пошкоджені і спроба їх встановлення призведе до множинних помилок. Щоб уникнути цього, менеджер перезавантажує файли кожен раз при натисканні кнопки.\n\nОднак, Non-Root інсталятор тепер може використовувати завантажені файли для перевстановлення Vanced."
    },
    {
      "title": "Чому рут-версія не має дозволу на мікрофон?",
      "description": "Все є, якщо ваш Vanced актуальний."
    },
    {
      "title": "Що таке ExoPlayer v1?",
      "description": "Це стара версія медіаплеєра використовуваного YouTube. Продуктивність і стабільність може бути краще при його використанні."
    },
    {
      "title": "Опції для розробників",
      "description": "В розширених налаштуваннях натисніть на розділ \"Про програму\" 6-7 разів, щоб розблокувати секретне меню. Це меню дозволяє використовувати додаткові налаштування відеокодека."
    },
    {
      "title": "Як зробити YouTube Vanced в якості стандартного застосунку?",
      "description": "Як говорить назва, багато користувачів запитували про те, як зробити YouTube Vanced за замовчуванням, для відкриття посилань YouTube з інших додатків (браузери, месенджери та інші програми).\n\nДля користувачів з root-правами, вам не потрібно хвилюватися, тому що значення за замовчуванням встановлено одразу, оскільки YouTube Vanced замінює звичайний YouTube.\n\nДля користувачів без root-прав, рішення розділені на OneUI, MIUI та інші. Ми не можемо надати рішення для кожної ОС яка існує, вам, можливо, знадобиться Google для пошуку вирішення цієї проблеми.",
      "fields": [
        {
          "title": "Користувачам OneUI:",
          "content": "1. Tap and hold down on YouTube or YouTube Vanced app icon\n2. Tap on **App info**.\n3. Find \"**Set as default**\" and tap it\n4. Tap \"**Open supported links**\" and choose \"**Open in this app**\"\n\nIn older versions of OneUI, the name of the options in the 4th step might be slightly difference. You may need to tap \"**Go to supported URLs**\" and choose \"**In this app**\" option.\nIn the very older version of OneUI 💩, you may need to go to **Settings** > **Apps** > *[tap three dots at the right corner]* > **Default apps** > **Set as default**. After apps loaded Find YouTube Vanced or YouTube and follow the 4th step..."
        },
        {
          "title": "Користувачам MIUI:",
          "content": "1. Open Settings\n2. Go to **Apps**,\n3. **Manage apps**,\n4. Then, tap the three dots at the right corner,\n5. **Default apps**,\n6. **Opening links**.\n7. Wait until all your apps gets listed…\n8. Find YouTube or YouTube Vanced and tap it.\n9. Tap \"**Open supported links**\" and choose \"**Open**\""
        },
        {
          "title": "AOSP & інші користувацькі системи (OOS, ColorOS, EMUI та ін.):",
          "content": "1. Відкрийте **Налаштування**\n2. Перейдіть до **Додатки**\n3. Натисніть **Програми за замовчуванням**\n4. Знайдіть **YouTube** або **YouTube Vanced**\n5. Торкніться опції \"**Перейти до підтримуваних посилань**\" та оберіть \"**Відкривати в цьому додатку**\"\n\nЯкщо ви все ще маєте проблеми з цим, вам потрібно виконати пошук статтей/відео на [Google](https://www.google.com/search?q=%22android%22+how+open+youtube+links+with+youtube), або ви можете встановити сторонню програму з [Play Маркет](https://play. google.com/store/search?q=open%20with), щоб зберегти себе від цього клопоту…"
        }
      ]
    },
    {
      "title": "Чому root версія не працює з ядром microG?",
      "description": "1. Вам потрібно мати хоча б [pico](https://github.com/opengapps/opengapps/wiki/Pico-Package) варіант GApps для запуску Vanced.\n\n2. Ви не зможете запустити Vanced з ядром microG, бо він вимагає Google Play Services Framework, який доступний у всіх пакетах GApps і це необхідна бібліотека.\n\n3. Якщо ви стурбовані конфіденційністю & не хочете використовувати GApps, але все ще хочете використовувати YouTube без реклами, тоді ви можете використовувати [веб-версію] (https://youtube.com)."
    },
    {
      "title": "Чому трансляція не працює?",
      "description": "Для користувачів без root-прав, що мають останню версії v16.16.38, є помилка у microG. Поки це не вирішено, будь ласка, зачекайте оновлень або поверніться до 15 версії. Користувачі з root-правами не мають проблем з трансляцією, якщо вони користуються сервісами Google Play."
    },
    {
      "title": "Що таке підпис APK?",
      "description": "Ви читаєте це, тому що ви не використовуєте Vanced Manager, або ви, можливо, встановили Vanced з неофіційного джерела. \nПросто використайте Vanced Manager!\n\nВи можете безпечно завантажити Vanced Manager з:\n- [Офіційного сайту](https://vancedapp.com)\n- [Репозиторія GitHub](https://github.com/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Чи є YouTube Vanced на Play Маркет?",
      "description": "НІ!\nЗнову, НЕ встановлюйте або навіть не намагайтеся знайти підроблені додатки під назвою \"YouTube Vanced\" або подібною до неї на Play Маркет, або будь-яким іншим магазином додатків для встановлення Vanced.\n\nУ нас є тільки [Гід Vanced](https://play.google.com/store/apps/details?id=com. anced.faq), і це єдиний офіційний додаток опублікований в Play Маркет.\n\nЯкщо ви знайдете будь-який інший додаток з нашим логотипом і ім'ям, повідомте про це як шахрайство і напишіть поганий відгук.\n\nНаші додатки можна знайти тільки на [офіційному сайті] (https://vancedapp.com)."
    },
    {
      "title": "Чому Vanced не відображається на домашньому екрані чи в меню додатків?",
      "description": "Ви читаєте це, тому що ви не використовуєте Vanced Manager, або ви, можливо, встановили Vanced з неофіційного джерела. \nПросто використайте Vanced Manager!\n\nВи можете безпечно завантажити Vanced Manager з:\n- [Офіційного сайту](https://vancedapp.com)\n- [Репозиторія GitHub](https://github.com/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Чому відеоролики не відтворюються?",
      "description": "Спробуйте перезапустити додаток. Це також може бути пов'язано з вашим інтернет-з'єднанням або пристроєм."
    },
    {
      "title": "Чому я маю обмеження в 480p?",
      "description": "Через COVID-19, Google обмежує використання даних для декількох країн. Це відбувається на сервері і зачіпає як користувачів Vanced, так і користувач звичайного YouTube.",
      "fields": [
        {
          "title": "Обхідні рішення:",
          "content": "1. Connect to a VPN of a different region.\n2. Use the [web version](https://youtube.com)\n3. Since the 480p restriction is only for phones and not tablets, you can change the device model in YouTube Vanced to overcome the restriction.\n\n#### How to change the device model?\n1. Open YouTube Vanced.\n2. Go to Settings\n3. Tap the `Vanced Settings`\n4. Enable hidden settings:\n  - Scroll down and tap on the `About` section till you get a message saying `Hidden settings enabled`.\n5. Go to `Codec override`\n6. Set manufacturer to `Samsung` and model to `SM-T865`.\n7. Restart the app.\n\nAfter restarting, the 480p limit should be gone."
        }
      ]
    },
    {
      "title": "Як приховати сповіщення від microG?",
      "description": "Щоб приховати сповіщення microG,\n\n1. Ви можете відключити оптимізацію батареї для microG і перезавантажити ваш пристрій.\n\n2. Якщо це не спрацювало, вимкніть сповіщення microG, утримуючи сповіщення, вимкніть їх і натисніть \"Зберегти\".\n\n>Відключення сповіщення додатка може здійснюватися різними способами в залежності від інтерфейсу системи Android. Якщо ви не знаєте, як його відключити, спробуйте використати Google для пошуку того, як їх відключити."
    },
    {
      "title": "Чи виглядає 1440p краще на моєму 1080p екрані?",
      "description": "Так, але тільки якщо співвідношення сторін екрану 18:9 або 21:9, ... Ви можете ввімкнути `Статистика для сісадмінів` в \"Налаштування > Основні\" щоб переконатися.\n\nЩоб ввімкнути більш високу роздільну здатність відео, перейдіть в \"Налаштування Vanced > Налаштування відео\" і ввімкніть \"Максимальна роздільна здатність\" та перезавантажте додаток."
    }
  ]
}
