{
  "data": [
    {
      "title": "Що таке Youtube Vanced?",
      "description": "YouTube Vanced - це модифікована версія YouTube з додатковими функціями і покращеннями для того, щоб зробити використання YouTube ще краще!\n\nТакі додаткові функції, як:\n\n- Відтворення у фоні\n- Картинка в картинці\n- Призначені для користувача теми (звичайний темний колір або чорний для OLED)\n- Блокування більшості видів реклами\n- Зміна максимальної здатності відео (дозволяє відтворення відео з роздільною здатністю, вищою, ніж ваш екран)\n- ...І багато іншого!\n\nДля додаткової інформації, відвідайте <https://vancedapp.com>"
    },
    {
      "title": "Де кнопка Завантаження?",
      "description": "Звичайно, Google не дозволить модифікованої версії власного додатка перебувати в своєму магазині, тому не шукайте його в Google Play Store, це просто підроблені додатки.\n\nДодатки Vanced можна завантажити і встановити за допомогою Vanced Manager, який можна знайти на нашому офіційному сайті: <https://vancedapp.com>, але ви також можете взяти його з [GitHub репозитория](https://github.com/YTVanced/VancedManager/releases/latest)."
    },
    {
      "title": "Чи буде YouTube Vanced автоматично оновлюватись?",
      "description": "Ні не буде.\n\nVanced Manager надішле вам сповіщення, коли оновлення буде доступне.\n\nВи також можете приєднатися до нашого [Discord Сервера](https://discord.gg/wYrRPgv) або до [каналу в Telegram](https://t.me/Vanced) для отримання останніх новин і інформації про оновлення."
    },
    {
      "title": "Чи може Vanced завантажувати відео?",
      "description": "Vanced не має функції завантаження відео і ніколи не матиме.\n\nБагато відео доступні для завантаження безкоштовно в [деяких країнах] (https://support.google.com/youtube/answer/6141269). Для решти світу, будь ласка, отримайте YouTube Premium або використовуйте сторонній завантажувач.\n\nЗнову ж таки, команда Vanced НІКОЛИ не додасть функцію завантаження відео або щось подібне в додаток.\n\nЦе причина закриття багатьох модифікацій YouTube в минулому, оскільки Google не любить, коли люди завантажують контент, захищений авторським правом, тому не просіть про це!!!"
    },
    {
      "title": "Why don't the swipe gestures work?",
      "description": "Якщо ви включили \"старі коментарі\" з налаштувань YouTube> Налаштування Vanced> Налаштування зовнішнього вигляду, вимкніть його і запустіть додаток. Якщо це не працює, спробуйте очистити дані додатка і кеш."
    },
    {
      "title": "Чому субтитри недоступні?",
      "description": "Це не проблема. Не всі відео мають субтитри."
    },
    {
      "title": "Ви приймаєте пожертви?",
      "description": "Ми НЕ приймаємо ніяких пожертвувань ні за яких обставин і будь-який сайт або посилання або повідомлення, які говорять про \"пожертвування для Vanced\" - фальшиві.\n\nАле якщо ви хочете підтримати розробників Vanced, ви можете завантажити Brave за [цим посиланням](https://brave.com/kev231) і AdGuard за [цим посиланням](https://adguard.com/en/welcome.html?aid=31141)."
    },
    {
      "title": "Як автоматично приховувати управління плеєром?",
      "description": "Використовуйте вбудовані налаштування спеціальних можливостей для зміни і управління функціями. Відкрийте налаштування в додатку \"Youtube Vanced\" і натисніть на кнопку спеціальних можливостей. Це відкриє параметр, який показаний на малюнку вище.\nЯкщо опції все ще не знайдені, перейдіть до налаштувань пристрою> спеціальними функціями і знайдіть \"Меню спеціальних можливостей\" і відключіть її.\nТакож, якщо це не працює, вимкніть підсилювач звуку, Switch Access, автоматичні субтитри, якщо вони включені."
    },
    {
      "title": "Чому додаток розбито на кілька частин?",
      "description": "Тому що:\n1. Звичайне додаток YouTube теж розбитий на кілька частин.\n2. Такий спосіб встановлення дозволяє завантажувати тільки потрібну вам мову для економії місця.\n3. Додаток містить тільки потрібні бібліотеки для вашого пристрою.\n\nЗвичайно, Vanced Manager або розробники могли б конвертувати все це в звичайний APK, але нам лінь цим займатися. Вам просто потрібно звикнути до того, що ви пропонуємо.\n\nНе хвилюйтеся, Vanced Manager все зробить за вас при натисканні на кнопку \"Встановити\"."
    },
    {
      "title": "Why does the color in the startup screen not match the theme? ",
      "description": "Колір фону на заставці тепер узято з кольору фреймворку Android (система Android), щоб переконатися, що Vanced/Youtube змінює свій колір відповідно до системної теми. Незалежно від кольору в фреймворку Android, такий же колір буде використовуватися і в Vanced.\n\nВи можете використовувати теми Substratum/Swift для зміни кольору теми."
    },
    {
      "title": "Навіщо завантажувати файли встановлення заново?",
      "description": "Причина досить проста: іноді завантажені файли можуть бути пошкоджені і спроба їх встановлення призведе до множинних помилок. Щоб уникнути цього, менеджер перезавантажує файли кожен раз при натисканні кнопки.\n\nОднак, Non-Root інсталятор тепер може використовувати завантажені файли для перевстановлення Vanced."
    },
    {
      "title": "Why doesn't the root version have Microphone permissions? ",
      "description": "Все є, якщо ваш Vanced актуальний."
    },
    {
      "title": "Що таке ExoPlayer v1?",
      "description": "Це стара версія медіаплеєра використовуваного YouTube. Продуктивність і стабільність може бути краще при його використанні."
    },
    {
      "title": "Опції для розробників",
      "description": "В розширених налаштуваннях натисніть на розділ \"Про програму\" 6-7 разів, щоб розблокувати секретне меню. Це меню дозволяє використовувати додаткові налаштування відеокодека."
    },
    {
      "title": "Як зробити YouTube Vanced в якості стандартного застосунку?",
      "description": "As the title says, a lot of users have been asking many times how they can make YouTube Vanced as default for opening YouTube links from other apps(like browsers, messaging apps and any other app).\n\nFor root, you don't need to worry about because it is already set by default since official YouTube gets replaced with YouTube vanced.\n\nFor non-root, solutions has been divided between as OneUI, MIUI and the rest.  We can't provide solutions for every OS out there, and you may need to Google it by yourself.",
      "fields": [
        {
          "title": "Користувачам OneUI:",
          "content": "1. Натисніть і утримуйте значок додатка YouTube або YouTube Vanced в ящику додатків.\n2. Натисніть ** Інформація про додаток **.\n3. Знайдіть пункт \"** Встановити за замовчуванням **\" і натисніть його.\n4. Натисніть \"** Відкривати підтримувані посилання **\" і виберіть \"** Відкривати в цьому додатку **\".\n\nУ старих версіях OneUI назву опцій на 4-му кроці може бути трохи іншою. Вам може знадобитися натиснути \"** Перейти до підтримуваним URL **\" і вибрати опцію \"** У цьому додатку **\".\nУ дуже старої версії OneUI 💩 вам може знадобитися перейти в **Налаштування**> **Додатки**> *[натиснути на три точки в правому куті]*> **Додатки за замовчуванням**> **Встановити за замовчуванням**. Після завантаження програм знайдіть YouTube Vanced або YouTube і виконайте 4-й крок..."
        },
        {
          "title": "Користувачам MIUI:",
          "content": "1. Open Settings\n2. Go to **Apps**,\n3. **Manage apps**,\n4. Then, tap the three dots at the right corner,\n5. **Default apps**,\n6. **Opening links**.\n7. Wait until all your apps gets listed…\n8. Find YouTube or YouTube Vanced and tap it.\n9. Tap \"**Open supported links**\" and choose \"**Open**\""
        },
        {
          "title": "AOSP & інші користувацькі системи (OOS, ColorOS, EMUI та ін.):",
          "content": "1. Відкрийте **Налаштування**\n2. Перейдіть до **Додатки**\n3. Натисніть **Програми за замовчуванням**\n4. Знайдіть **YouTube** або **YouTube Vanced**\n5. Торкніться опції \"**Перейти до підтримуваних посилань**\" та оберіть \"**Відкривати в цьому додатку**\"\n\nЯкщо ви все ще маєте проблеми з цим, вам потрібно виконати пошук статтей/відео на [Google](https://www.google.com/search?q=%22android%22+how+open+youtube+links+with+youtube), або ви можете встановити сторонню програму з [Play Маркет](https://play. google.com/store/search?q=open%20with), щоб зберегти себе від цього клопоту…"
        }
      ]
    },
    {
      "title": "Why doesn't the root variant work with the microG core? ",
      "description": "1. Вам потрібно мати хоча б [pico](https://github.com/opengapps/opengapps/wiki/Pico-Package) варіант GApps для запуску Vanced.\n\n2. Ви не зможете запустити Vanced з ядром microG, бо він вимагає Google Play Services Framework, який доступний у всіх пакетах GApps і це необхідна бібліотека.\n\n3. Якщо ви стурбовані конфіденційністю & не хочете використовувати GApps, але все ще хочете використовувати YouTube без реклами, тоді ви можете використовувати [веб-версію] (https://youtube.com)."
    },
    {
      "title": "Why doesn't casting work?",
      "description": "For users with v16.16.38 and all above non-root variants and root variants who are using microG based ROMs, there's a bug in upstream microG. Until that resolves, please wait for updates or roll back to v15 versions. If you use Google Play Services with root variants, you won't have any problems with casting."
    },
    {
      "title": "Що таке підпис APK?",
      "description": "Ви читаєте це, тому що ви не використовуєте Vanced Manager, або ви, можливо, встановили Vanced з неофіційного джерела. \nПросто використайте Vanced Manager!\n\nВи можете безпечно завантажити Vanced Manager з:\n- [Офіційного сайту](https://vancedapp.com)\n- [Репозиторія GitHub](https://github.com/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Чи є YouTube Vanced на Play Маркет?",
      "description": "НІ!\nЗнову, НЕ встановлюйте або навіть не намагайтеся знайти підроблені додатки під назвою \"YouTube Vanced\" або подібною до неї на Play Маркет, або будь-яким іншим магазином додатків для встановлення Vanced.\n\nУ нас є тільки [Гід Vanced](https://play.google.com/store/apps/details?id=com. anced.faq), і це єдиний офіційний додаток опублікований в Play Маркет.\n\nЯкщо ви знайдете будь-який інший додаток з нашим логотипом і ім'ям, повідомте про це як шахрайство і напишіть поганий відгук.\n\nНаші додатки можна знайти тільки на [офіційному сайті] (https://vancedapp.com)."
    },
    {
      "title": "Чому Vanced не відображається на домашньому екрані чи в меню додатків?",
      "description": "Ви читаєте це, тому що ви не використовуєте Vanced Manager, або ви, можливо, встановили Vanced з неофіційного джерела. \nПросто використайте Vanced Manager!\n\nВи можете безпечно завантажити Vanced Manager з:\n- [Офіційного сайту](https://vancedapp.com)\n- [Репозиторія GitHub](https://github.com/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Чому відеоролики не відтворюються?",
      "description": "Спробуйте перезапустити додаток. Це також може бути пов'язано з вашим інтернет-з'єднанням або пристроєм."
    },
    {
      "title": "Чому я маю обмеження в 480p?",
      "description": "Через COVID-19, Google обмежує використання даних для декількох країн. Це відбувається на сервері і зачіпає як користувачів Vanced, так і користувач звичайного YouTube.",
      "fields": [
        {
          "title": "Обхідні рішення:",
          "content": "1. Connect to a VPN of a different region.\n2. Use the [web version](https://youtube.com)\n3. Since the 480p restriction is only for phones and not tablets, you can change the device model in YouTube Vanced to overcome the restriction.\n\n#### How to change the device model?\n1. Open YouTube Vanced.\n2. Go to Settings\n3. Tap the `Vanced Settings`\n4. Enable hidden settings:\n  - Scroll down and tap on the `About` section till you get a message saying `Hidden settings enabled`.\n5. Go to `Codec override`\n6. Set manufacturer to `Samsung` and model to `SM-T865`.\n7. Restart the app.\n\nAfter restarting, the 480p limit should be gone."
        }
      ]
    },
    {
      "title": "Як приховати сповіщення від microG?",
      "description": "To hide microG the notification,\n\n1. You can disable battery optimization for Vanced microG and reboot your device.\n\n2. If the above method doesn't work, disable microG notifications by holding on to the notification, toggle it off and tap Save.\n\n> Disabling app notifications can be done in different ways depending on the Android user interface. If you don't know how to disable it, try using Google for learning how to disable it."
    },
    {
      "title": "Чи виглядає 1440p краще на моєму 1080p екрані?",
      "description": "Так, але тільки якщо співвідношення сторін екрану 18:9 або 21:9, ... Ви можете ввімкнути `Статистика для сісадмінів` в \"Налаштування > Основні\" щоб переконатися.\n\nЩоб ввімкнути більш високу роздільну здатність відео, перейдіть в \"Налаштування Vanced > Налаштування відео\" і ввімкніть \"Максимальна роздільна здатність\" та перезавантажте додаток."
    }
  ]
}
