{
  "data": [
    {
      "title": "Що таке Youtube Vanced?",
      "description": "YouTube Vanced - це модифікована версія YouTube з додатковими функціями і поліпшеннями для того, щоб зробити використання YouTube трішки краще!\n\nТакі додаткові функції, як:\n\n- Відтворення у фоні\n- Картинка в картинці\n- Призначені для користувача теми (звичайний темний колір або чорний для OLED)\n- Блокування більшості видів реклами\n- Зміна максимальної здатності відео\n- ...І багато іншого!\n\nДля додаткової інформації, відвідайте <https://vancedapp.com>"
    },
    {
      "title": "Де кнопка Завантаження?",
      "description": "Компанія Google не дозволяє публікацію свого модифікованого додатка в магазині, тому не шукайте його в Play Market, всі ці додатки є підробками.\n\nВи можете завантажити його з офіційного сайту: <https://vancedapp.com>, а також з репозиторію на GitHub: <https://github.com/YTVanced/VancedManager/releases/latest>"
    },
    {
      "title": "Чи буде YouTube Vanced автоматично оновлюватись?",
      "description": "Ні не буде.\n\nVanced Manager надішле вам повідомлення, коли оновлення вийде.\n\nВи також можете приєднатися до нашого [сервера Discord](https://discord. g/wYrRPgv) або до [каналу в Telegram](https://t.me/Vanced) для отримання останніх новин і сповіщення про оновлення."
    },
    {
      "title": "Чи може Vanced завантажувати відео?",
      "description": "Vanced не має функції завантаження відео і вона ніколи не буде додана.\n\nБагато відео доступні для завантаження безкоштовно в [деяких країнах] (https://support. oogle.com/youtube/answer/6141269). Для решти світу, будь ласка, завантажте YouTube Premium або використовуйте сторонній завантажувач.\n\nЗнову ж таки, команда Vanced НІКОЛИ не додасть завантаження відео в додаток або щось подібне.\n\nЦе причина закриття багатьох модів YouTube в минулому, оскільки Google не любить коли люди завантажують контент, захищений авторським правом, тому не питайте про це!!!"
    },
    {
      "title": "Чому свайп-жести не працюють?",
      "description": "Якщо ви включили \"старі коментарі\" з налаштувань YouTube> Налаштування Vanced> Налаштування зовнішнього вигляду, вимкніть його і запустіть додаток. Якщо це не працює, спробуйте очистити дані додатка і кеш."
    },
    {
      "title": "Чому субтитри недоступні?",
      "description": "Це не проблема. Не всі відео мають субтитри."
    },
    {
      "title": "Ви приймаєте пожертви?",
      "description": "Ми НЕ приймаємо ніяких пожертвувань ні за яких обставин і будь-який сайт або посилання або повідомлення, які говорять про \"пожертвування для Vanced\" - фальшиві.\n\nАле якщо ви хочете підтримати розробників Vanced, ви можете завантажити Brave за [цим посиланням](https://brave.com/kev231) і AdGuard за [цим посиланням](https://adguard.com/en/welcome.html?aid=31141)."
    },
    {
      "title": "Як автоматично приховувати управління плеєром?",
      "description": "Використовуйте вбудовані налаштування спеціальних можливостей для зміни і управління функціями. Відкрийте налаштування в додатку \"Youtube Vanced\" і натисніть на кнопку спеціальних можливостей. Це відкриє параметр, який показаний на малюнку вище.\nЯкщо опції все ще не знайдені, перейдіть до налаштувань пристрою> спеціальними функціями і знайдіть \"Меню спеціальних можливостей\" і відключіть її.\nТакож, якщо це не працює, вимкніть підсилювач звуку, Switch Access, автоматичні субтитри, якщо вони включені."
    },
    {
      "title": "Чому додаток розбито на кілька частин?",
      "description": "Тому що:\n1. Звичайне додаток YouTube теж розбитий на кілька частин.\n2. Такий спосіб встановлення дозволяє завантажувати тільки потрібну вам мову для економії місця.\n3. Додаток містить тільки потрібні бібліотеки для вашого пристрою.\n\nЗвичайно, Vanced Manager або розробники могли б конвертувати все це в звичайний APK, але нам лінь цим займатися. Вам просто потрібно звикнути до того, що ви пропонуємо.\n\nНе хвилюйтеся, Vanced Manager все зробить за вас при натисканні на кнопку \"Встановити\"."
    },
    {
      "title": "Чому колір на екрані запуску відрізняється від теми?",
      "description": "Колір фону на заставці тепер узято з кольору фреймворку Android (система Android), щоб переконатися, що Vanced/Youtube змінює свій колір відповідно до системної теми. Незалежно від кольору в фреймворку Android, такий же колір буде використовуватися і в Vanced.\n\nВи можете використовувати теми Substratum/Swift для зміни кольору теми."
    },
    {
      "title": "Навіщо завантажувати файли встановлення заново?",
      "description": "Причина досить проста: іноді завантажені файли можуть бути пошкоджені і спроба їх встановлення призведе до множинних помилок. Щоб уникнути цього, менеджер перезавантажує файли кожен раз при натисканні кнопки.\n\nОднак, Non-Root інсталятор тепер може використовувати завантажені файли для перевстановлення Vanced."
    },
    {
      "title": "Чому рут-версія не має дозволу на мікрофон?",
      "description": "Все є, якщо ваш Vanced актуальний."
    },
    {
      "title": "Що таке ExoPlayer v1?",
      "description": "Це стара версія медіаплеєра використовуваного YouTube. Продуктивність і стабільність може бути краще при його використанні."
    },
    {
      "title": "Опції для розробників",
      "description": "В розширених налаштуваннях натисніть на розділ \"Про програму\" 6-7 разів, щоб розблокувати секретне меню. Це меню дозволяє використовувати додаткові налаштування відеокодека."
    },
    {
      "title": "Як зробити YouTube Vanced в якості стандартного застосунку?",
      "description": "Як говорить назва, багато користувачів запитували про те, як зробити YouTube Vanced за замовчуванням, для відкриття посилань YouTube з інших додатків (браузери, месенджери та інші програми).\n\nДля користувачів з root-правами, вам не потрібно хвилюватися, тому що значення за замовчуванням встановлено одразу, оскільки YouTube Vanced замінює звичайний YouTube.\n\nДля користувачів без root-прав, рішення розділені на OneUI, MIUI та інші. Ми не можемо надати рішення для кожної ОС яка існує, вам, можливо, знадобиться Google для пошуку вирішення цієї проблеми.",
      "fields": [
        {
          "title": "Користувачам OneUI:",
          "content": "1. Натисніть і утримуйте значок додатка на YouTube або YouTube Vanced\n2. Натисніть на **Інформація про додаток**\n3. Знайдіть \"**Встановити за замовчуванням**\" і натисніть на неї\n4. Натисніть \"**Відкрити підтримуване посилання**\" і оберіть \"**Відкрити в цьому додатку**\"\n\nУ старих версіях OneUI, назва опцій на 4-му кроці може трохи відрізнятися. Можливо, вам доведеться натиснути \"**Перейти до URL-адрес **\" і вибрати опцію \"**В цьому додатку**\"."
        },
        {
          "title": "Користувачам MIUI:",
          "content": "1. Open Settings\n2. Got to **Apps**,\n3. **Manage apps**,\n4. Then, tap the three dots at the right corner,\n5. **Default apps**,\n6. **Opening links**.\n7. Wait until all your apps gets listed…\n8. Find YouTube or YouTube Vanced and tap it.\n9. Tap \"**Open supported links**\" and choose \"**Open**\""
        },
        {
          "title": "AOSP & інші користувацькі системи (OOS, ColorOS, EMUI та ін.):",
          "content": "1. Open **Settings**\n2. Go to **Apps**\n3. Tap **Default apps**\n4. Find **YouTube** or **YouTube Vanced**\n5. Tap \"**Go to Supported URLs**\" and choose \"**Open in this app**\" option\n\nIf you're still troubling with this, you may need to search some \"how to\" articles/videos on [Google](https://www.google.com/search?q=%22android%22+how+to+open+youtube+links+with+youtube) or you can install a 3rd party app from [Play Store](https://play.google.com/store/search?q=open%20with) to save you from this hassle…"
        }
      ]
    },
    {
      "title": "Чому root версія не працює з ядром microG?",
      "description": "1. You need to have at least the [pico](https://github.com/opengapps/opengapps/wiki/Pico-Package) variant of GApps to run Vanced.\n\n2. You can’t run Vanced with microG Core without Google Play Services Framework which is available in all GApps packages and it's a required library.\n\n3. If you are worried about your privacy & don’t want to use GApps but still want to use watch YouTube without ads, then the [web version](https://youtube.com) is always available."
    },
    {
      "title": "Why casting doesn't work?",
      "description": "For users with latest v16.16.38 non-root variant, there's a bug in upstream microG. Until that resolves, please wait for updates or roll back to v15 versions. Root users will no issues with casting if they are using Google Play Services."
    },
    {
      "title": "Що таке підпис APK?",
      "description": "You are reading this because you are not using Vanced Manager or you may have installed Vanced from an unofficial source.\nJust use Vanced Manager!\n\nYou can safely download Vanced Manager from:\n- [Official site](https://vancedapp.com)\n- [GitHub repository](https://github.com/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Чи є YouTube Vanced на Play Маркет?",
      "description": "НІ!\nЗнову, НЕ встановлюйте або навіть не намагайтеся знайти підроблені додатки під назвою \"YouTube Vanced\" або подібною до неї на Play Маркет, або будь-яким іншим магазином додатків для встановлення Vanced.\n\nУ нас є тільки [Гід Vanced](https://play.google.com/store/apps/details?id=com. anced.faq), і це єдиний офіційний додаток опублікований в Play Маркет.\n\nЯкщо ви знайдете будь-який інший додаток з нашим логотипом і ім'ям, повідомте про це як шахрайство і напишіть поганий відгук.\n\nНаші додатки можна знайти тільки на [офіційному сайті] (https://vancedapp.com)."
    },
    {
      "title": "Чому Vanced не відображається на домашньому екрані чи в меню додатків?",
      "description": "You are reading this because you are not using Vanced Manager or you may have installed Vanced from an unofficial source.\nJust use Vanced Manager!\n\nYou can safely download Vanced Manager from:\n- Official site <https://vancedapp.com>\n- [GitHub repository](https://github.com/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Чому відеоролики не відтворюються?",
      "description": "Спробуйте перезапустити додаток. Це також може бути пов'язано з вашим інтернет-з'єднанням або пристроєм."
    },
    {
      "title": "Чому я маю обмеження в 480p?",
      "description": "Через COVID-19, Google обмежує використання даних для декількох країн. Це відбувається на сервері і зачіпає як користувачів Vanced, так і користувач звичайного YouTube.",
      "fields": [
        {
          "title": "Обхідні рішення:",
          "content": "1. Connect to a VPN of a different region.\n2. Use the [web version](https://youtube.com)\n3. Since the 480p restriction is only for phones and not tablets, you can change the device model in YouTube Vanced to overcome the restriction.\n\n#### How to change the device model?\n1. Open YouTube Vanced.\n2. Go to Settings\n3. Tap the `Vanced Settings`\n4. Enable hidden settings:\n  - Scroll down and tap on the `About` section till you get a message saying `Hidden settings enabled`.\n5. Go to `Codec override`\n6. Set manufacturer to `Samsung` and model to `SM-T865`.\n7. Restart the app.\n\nAfter restarting, the 480p limit should be gone."
        }
      ]
    },
    {
      "title": "Як приховати сповіщення від microG?",
      "description": "To hide microG the notification,\n\n1. You can disable battery optimization for Vanced microG and reboot your device.\n\n2. If the above method doesn't work, disable microG notifications by holding on to the notification, toggle it off and tap Save.\n\n>Disabling app notifications can be done in different ways depending on the Android user interface. If you don't know how to disable it, try using Google for learning how to disable it."
    },
    {
      "title": "Чи виглядає 1440p краще на моєму 1080p екрані?",
      "description": "Yes, but only if the video ratio is something like 18:9, 21:9, ... You can enable `Stats for nerds` in Settings > General to confirm it.\n\nTo enable higher resolutions, go to Vanced settings > Video settings and turn on `Max resolution` then restart the app."
    }
  ]
}
