{
  "features": [
    {
      "title": "Vanced",
      "description": "YouTube Vanced призваний стати кращою версією Youtube. Воно включає блокування реклами, повноекранний режим і багато іншого. Використовуйте Vanced Manager, щоб встановити YouTube Vanced з відносною легкістю."
    },
    {
      "title": "Vanced Music",
      "description": "Vanced Music має ту ж мету, що і YouTube Vanced, але фокусується на YouTube Music. Там відносно менше можливостей у порівнянні з Vanced але все одно воно включає багато речей, які ви очікуєте, наприклад, блокування реклами і фонове відтворення, все в Youtube Music!"
    },
    {
      "title": "Основні функції YouTube Vanced",
      "description": "Темна тема Amoled.\n- Блокує всю відеорекламу і дозволяє відтворювати відео у фоновому режимі або в режимі Фотографія (тільки на Android 8 і вище)\n- Свайпа елементи управління дозволяють управляти яскравістю і гучністю за допомогою жестів вгору і вниз (з налаштованим відступом).\n- Функція автоповтора, що дозволяє вам повторювати момент в відео.\n- Нові макети коментарів/міні-плеєра можуть бути переключені на планшетні версії, які дуже схожі на стару версію (трохи забагано)."
    },
    {
      "title": "Персоналізація",
      "description": "- Дозволяє вам перевизначити параметри кодека, такі як примусовий H264 для старих пристроїв або VP9, ​​це також дозволяє вам примусово відтворення HDR або вимкнути 60 кадрів в секунду, якщо ви віддаєте перевагу кінотеатр. (Конфігурації пристроїв для цих функцій можна знайти на нашому Discord або XDA)\n- Встановіть максимальний або низький дозвіл відео за замовчуванням і навіть перевизначите дозвіл екрана для чіткого відтворення 4K на будь-якому пристрої. Він також дозволяє змінювати швидкість відтворення за замовчуванням в будь-якому місці між 0. від 5х до 2х (припускаючи, що ваш пристрій досить потужний)\n- дозволяє вам перемикатися на домашню рекламу, більшість реклами в інтерфейсі, рекламу в магазині, повідомлення в співтоваристві, Купівля фільмів, компактна інформація про банери (така як інформація про фільми), повністю видалити коментарі, компактний фільм, зняття фільмів полки і багато іншого!"
    },
    {
      "title": "Пропуск спонсорів",
      "description": "- Можливість пропускати спонсоруючі сегменти (коли ютубер рекламує сервіс або продукт в відео)\n- Це також підтримує пропуск інших категорій, таких як заставки, кінцівки і самопросування.\n- використовує знайдений API. Ви можете знайти додаткову інформацію про те, як вона працює\n- Це також дозволяє надсилати свої власні сегменти в API і робити внесок в більш широке співтовариство\n- Повний контроль над тим, щоб автоматично пропустити категорію сегмента або показувати кнопку для пропуску, або просто не пропускати його взагалі.\n- Виділяє сегмент певного кольору, виходячи з його категорії на часовій шкалі відтворення."
    },
    {
      "title": "Платформи",
      "description": "В даний час додаток існує тільки в Android, поки планів підтримувати інші платформи немає"
    },
    {
      "title": "Відмінності між Root і Non-Root",
      "description": "Root-версія:\nRoot-версія Vanced легко замінює офіційний додаток YouTube. В результаті ви можете безпосередньо відкрити посилання на YouTube або відкрити їх через Google асистент використовуючи модифікований додаток.\n- Ні-Root версія:\n- Якщо у вас є пристрій, на який складно отримати root-доступ або ви не хочете рутувати ваш телефон на кожен день, ви повинні вибрати не-Root версію.\n- Ця версія також може бути встановлена ​​на пристрої з рут-доступом. Так як ім'я пакета у цій версії відрізняється від стандартного додатка YouTube, вони можуть співіснувати. Зверніть увагу, що для входу в систему з обліковим записом YouTube/Google необхідно встановити додатковий додаток (Vanced microG).\n- Крім того, ви повинні вручну встановити Vanced як додаток за замовчуванням для відкриття YouTube посилання.\n- Тим не менш, з цією версією простіше жити, тому ми рекомендуємо дотримуватися версії не-Root, якщо вам не потрібно стандартний додаток YouTube на вашому телефоні."
    }
  ]
}
