{
	"troubleshooting": [
		{
			"title": "Basis probleemoplossing",
			"description": "A) Wis gegevens en cache van \n\n(I) Vanced/Vanced Music en microG voor de non-root versie\n(II) Vanced/Vanced Music en Google Play Services voor de root versie\n\nB) Herinstalleer YouTube Vanced\n\nBELANGRIJKE OPMERKING: Opnieuw opstarten tussen stap A en B"
		},
		{
			"title": "Problemen met aanmelden",
			"description": "Hieronder staan enkele veel voorkomende fouten en problemen met screenshots zodat je weet welke oplossing je moet volgen.",
			"fields": [
				{
					"title": "Als je de fout \"Controleer je internetverbinding\" krijgt",
					"content": "Volg deze video gids: https://youtu.be/S5sTXRTrD5Y. Wis ook de microG app gegevens."
				},
				{
					"title": "Als je het probleem \"Je bent offline, downloads verkennen\" hebt bij het aanmelden",
					"content": "1. Wis in je apps de gegevens van zowel Vanced microG als Google Play services\n2. Verwijder zowel Vanced microG als Vanced.\n\n3. Herstart je apparaat.\n\n4. Herinstalleer beide APKs[microG en Vanced) maar zorg ervoor dat je microG eerst installeert, voordat je Vanced installeert. Installeer via Vanced Manager of met SAI met behulp van de bestanden op onze site\n\n5. Meld je aan.\n\nOPMERKING: Als je nog steeds verbindingsproblemen hebt met Vanced (zelfs na het eerst installeren van microG), ontvangen van meldingen, enz, zorg er dan voor dat je batterij optimalisatie voor de apps Vanced en microG uitschakelt. \n\nInstructies hieromtrent zijn afhankelijk van je apparaat/fabrikant. Je kunt gidsen zoals https://dontkillmyapp.com raadplegen of online zoeken op het internet."
				},
				{
					"title": "Als Vanced afmeldt van je Google account",
					"content": "Dit gebeurt omdat de actieve batterij optimalisatie van je apparaat OS de services/activiteiten van microG die verantwoordelijk zijn voor het aanmelden uitschakelt.\n\nSchakel daarom de batterij optimalisatie voor microG uit met behulp van https://dontkillmyapp.com of zoek het online op."
				},
				{
					"title": "Voor gebruikers van de Gsuite account op de non-root versie van Vanced en die dikwijls verbindingsproblemen hebben (fouten zoals \"Je bent offline\", \"Controleer je internet\", enz)",
					"content": "• Meld je aan op jouw Gsuite account admin console (https://admin.google.com/)\n\n• Zoek naar apparaatbeheer\n\n• Ga naar setup en schakel \"Mobiel beheer\" uit\n\n• Zo zou het opgelost moeten zijn."
				},
				{
					"title": "Huawei tussenoplossing 1",
					"content": "Voor degenen die microG hebben bijgewerkt naar de meest recente versie, maar die nu geconfronteerd worden met problemen bij het aanmelden\n\n1. Verwijder de huidig geïnstalleerde Vanced microG.\n\n2. Download versie \"Vanced microG 0.2.12.203315\" van de mediafire v15 link en installeer deze. Link voor mediafire v15 hier - https://del.dog/Mediafireonlyv15\n\n3. Je zou nu moeten kunnen aanmelden."
				},
				{
					"title": "Huawei tussenoplossing 2",
					"content": "1. Verwijder zowel Vanced als microG, als je deze al hebt geïnstalleerd. Herinstalleer enkel microG (laatst beschikbare versie)\n\n2. Open vervolgens de instellingen van microG\n\n3. Schakel \"Google Cloud Messaging\" en \"Google device registration\" uit.\n\n4. Voeg je account toe via microG.\n\n5. Installeer daarna Vanced."
				},
				{
					"title": "Huawei tussenoplossing 3",
					"content": "1. Installeer eerst de oude versie van microG (verwijder de huidige versie, maar behoud de apk, want je hebt die later nodig). \n\nmicrog_YouTube_Vanced_0.2.4-105_16052019_2.apk (ga naar de Old Files-link op de vancedapp.com site)\n\n2. Open daarna YouTube Vanced en probeer opnieuw aan te melden tot je de foutmelding krijgt. Probeer te herladen door op de foutmelding te klikken. \n\n3. Installeer nu de nieuwere versie van microG en herstart Vanced. Nu zou je moeten aangemeld zijn en alles zou opnieuw moeten werken.\n\nOPMERKING: Zorg er voor dat je de batterij optimalisatie voor zowel microG als Vanced uitschakelt met behulp van dontkillmyapp.com, om te voorkomen dat de software van je apparaat microG uitschakelt en je misschien alle bovenstaande stappen opnieuw moet doen om het aanmeldingsprobleem op te lossen."
				}
			]
		},
		{
			"title": "Vanced Manager",
			"fields": [
				{
					"title": "Vanced Manager die vastloopt op logo/crash probleem",
					"content": "Wis de app gegevens van Manager > internet uitschakelen > Manager app openen > internet terug inschakelen."
				},
				{
					"title": "INSTALL_FAILED_INVALID_APK: Geen pakketten aanwezig",
					"content": "Installeer de standaard YouTube uit de Play Store en update deze met Vanced met behulp van Vanced Manager."
				},
				{
					"title": "Als de nieuwste Vanced Manager vastloopt op het scherm \"Even geduld\", doe dan dit",
					"content": "Installeer de standaard YouTube uit de Play Store en update deze met Vanced met behulp van Vanced Manager."
				},
				{
					"title": "Als je geconfronteerd wordt met \"Fout bij downloaden van microG/Vanced\" of de installatie loopt vast tijdens het installeren van de microG/Vanced apps",
					"content": "Verwijder de gegevens van Vanced Manager en ga vervolgens door met installeren en GEBRUIK ONDERTUSSEN GEEN ANDERE APPS TOT DIT PROCES VOLTOOID IS."
				}
			]
		},
		{
			"title": "Installatie mislukt omdat de app conflicten heeft met een reeds geïnstalleerde app. Verwijder de huidige versie van die app en probeer het opnieuw (INSTALL_FAILED_UPDATE_INCOMPATIBLE)",
			"description": "Dit gebeurt bij gebruikers van OneUI en Oxygen OS wanneer ze hun systeem bijwerken van Android 10 naar Android 11, sommige aangepaste ROMs hebben dit probleem ook.\n\nVandaar dat we 3 mogelijke oplossingen voor je hebben",
			"fields": [
				{
					"title": "Als je niet geroot bent, gebruik dan ADB",
					"content": "1). Installeer Android Debug Bridge; Gids - https://www.xda-developers.com/install-adb-windows-macos-linux/amp/. \n\n2) Ontgrendel je apparaat. \n\n3) Schakel de ontwikkelaarsmodus in (tik 10 keer op het Buildnummer via Instellingen - Info tablet/telefoon - Softwaregegevens). \n\n4) Schakel USB foutopsporing in via Instellingen - Ontwikkelaarsopties. \n\n5) Sluit jouw apparaat aan op je PC. \n\n6) Open Command Prompt (CMD) en verander de map: \"cd C:/Windows/adb/\" en druk op Enter. \n\n7) Aangezien jouw toestel is aangesloten en CMD open is, voer je in CMD de opdracht \"adb devices\" uit. Er zal een melding verschijnen op je toestel, iets zoals \"Wil je je apparaat verbinden met je PC?\". Druk op Ja. \n\n8) Voer nu in CMD command \"adb uninstall com.vanced.android.youtube\" uit. \n\n9) Hierna kan je Vanced Manager en de nieuwste versie van YouTube Vanced installeren."
				},
				{
					"title": "Als je geroot bent,",
					"content": "1) Gebruik de root verkenner en navigeer naar de root opslag. \n\n2) Zoek dan deze map wanneer je YouTube Vanced installeert \"data/app/com.vanced.android.youtube-....\" of wanneer je YouTube Music installeert zoek je \"com.vanced.android.apps.youtube.music-....\"  \n\n3) Als je deze mappen vindt, verwijder ze dan gewoon, en ga daarna door met het installeren van YouTube Vanced of YouTube Music via Vanced Manager."
				},
				{
					"title": "Als beide bovenstaande methodes mislukken",
					"content": "Blijkbaar kan een reset naar de fabrieksinstellingen deze fout verhelpen. Doe dit enkel indien nodig én als allerlaatste mogelijke oplossing."
				},
				{
					"title": "Fouten zoals \"Operatie mislukt omdat de apk-bestanden ongeldig/corrupt zijn\"",
					"content": "• Ga naar de instellingen van Vanced Manager en wis de gedownloade bestanden\\n\\n• Wis dan de app gegevens van Vanced Manager en ga vervolgens door met het installeren van Vanced."
				}
			]
		},
		{
			"title": "Oplossing voor meldingen",
			"description": "Voor oplossing voor meldingen, een witte achtergrond of Vanced die niet verschijnt onder \"Google Cloud Messaging\", zie hieronder",
			"fields": [
				{
					"title": "Voor non-root",
					"content": "1. Installeer eerst Vanced microG en daarna YouTube Vanced.\n\n2. Meld je aan met je Google account\n\n3. \na) Schakel batterij optimalisatie uit voor microG (de gids dontkillmyapp.com wordt aangeraden).\n\nb) Open \"Vanced microG\" aanvullende instellingen en ga vervolgens verder met deze gids: https://youtu.be/Q-5YFmFWVok"
				},
				{
					"title": "Als Vanced niet verschijnt onder Google Cloud Messaging of het verschijnt als niet geregistreerd",
					"content": "Probeer EEN van de volgende oplossingen:\n\n1. Verwijder je Google account in de account instellingen. Het account dat wordt gebruikt door Vanced heeft een blauwe/zwarte achtergrondkleur met een G logo.\n\n2. Wis de gegevens van de microG app en meld je aan. \n\nOF\n\nAls bovenstaande oplossing niet werkt, herinstalleer Vanced."
				},
				{
					"title": "Voor root",
					"content": "Schakel \"Geplande Digest\" uit in je YouTube instellingen en zorg dat je meldingen/geluiden correct zijn ingesteld.\n\nJe kan de \"Meldingen manager\" app gebruiken, die al je meldingen op één plaats bijhoudt, zodat je terug toegang hebt tot je meldingen, in het geval je je meldingen verwijderd hebt."
				}
			]
		},
		{
			"title": "Problemen met geforceerd afsluiten",
			"description": "Crashes/Geforceerd afsluiten van Vanced bij opstarten",
			"fields": [
				{
					"title": "Non-root",
					"content": "1) Als de non-root Vanced app geforceerd wordt afgesloten voor het installeren van microG, verwijder dan zowel Vanced als microG. Installeer dan microG eerst en dan pas Vanced. Het probleem zou opgelost moeten zijn.\n\n2) Als de non-root Vanced app geforceerd wordt afgesloten zonder het installeren van microG, installeer dan microG. [Als je niet wil aanmeldan, doe dat dan niet en installeer enkel microG, aangezien Vanced afhankelijk is van microG om te verbinden met Google services]"
				},
				{
					"title": "Root",
					"content": "1) Als de root Vanced app geforceerd wordt afgesloten bij het openen van de app, verwijder dan de standaard YouTube app updates. Als dit niet helpt, verwijder dan je Substratum/Swift thema overlays.\nAls er niets helpt, bezorg dan een logcat aan de community/staff.\n\n2) Als de root Vanced app geforceerd wordt afgesloten tijdens het gebruik van de app wanneer deze op de voorgrond actief is of een video afspeelt, neem dan logcats en vind:\n\n(a)- Unsatisfiedlinkerror: \nOplossing:- Open bestandsbeheerder en ga naar de root opslag.\nOpen vervolgens \"system/app/youtube/lib\" OF \"Data/app/com.google.android.youtube/lib\" en hernoem \n\narm64-v8a naar arm64\n\narmeabi-v7a naar arm\n\nen het zou opgelost moeten zijn.\n\nAls zowel \"arm en arm64\" niet in deze map hierboven aanwezig zijn, probeer ze dan van de officiële YouTube apk te halen of vraag ze aan je vrienden en pak ze uit in die map\n\n(b)- Notewhitelisted \"com.google.android.youtube\":\nOplossing:- Controleer de toestemmingslijst vanaf hier(todo)\n\nAls je niet weet hoe je logboeken kan verkrijgen, check de bugreport note"
				},
				{
					"title": "Crashes van Vanced tijdens het afspelen (tijdens afspelen op achtergrond)",
					"content": "Omdat dit probleem alleen wordt veroorzaakt door agressieve batterij optimalisatie in verschillende OEM-skins zoals MIUI, EMUI, ColorOS, enz..., wordt het aanbevolen om batterij optimalisatie uit te schakelen voor zowel Vanced als MicroG app. \n\nInstructies om dit te doen variëren van apparaat/fabrikant, zodat we je niet echt kunnen helpen om dit uit te schakelen. Je kunt proberen via een site als \"dontkillmyapp.com\", of Google gebruiken en zoeken op \"[apparaat fabrikant] [apparaat model] [Android versie] uitschakelen batterij optimalisatie\".\n\nAls je echter nog steeds dit probleem blijft hebben, stuur dan #bugreport via telegram of discord met de nodige details en logs, zodat Mods een kijkje kunnen nemen wat er daadwerkelijk aan de hand is. Zorg ervoor dat je specifieke logs voor Vanced neemt, NIET die van je gehele SYSTEEM."
				}
			]
		},
		{
			"title": "Verwijderen bij heropstarten",
			"description": "Als de root versie van YouTube Vanced/YouTube Music Vanced verdwijnt/verwijderd wordt/terugkeert naar de standaard YouTube tijdens het heropstarten,\n\ndan hebben we 2 mogelijke oplossingen voor jou",
			"fields": [
				{
					"title": "Oplossing 1",
					"content": "Gebruik de non-root versie tot de ontwikkelaars dit oplossen."
				},
				{
					"title": "Oplossing 2",
					"content": "VEREIST: \n\nVanced Manager 2.2. of nieuwer\nStap 1: Ga naar instellingen voor beheer > Root Script Slaap Tijd (u moet in root-modus staan om deze optie te zien) en stel de waarde in op 2 > klik op opslaan, herstart en kijk of Vanced/Vanced Music nog steeds verdwijnt. Als ze nog steeds verdwijnen probeer dan de waarde aan te passen totdat ze blijven na het herstarten"
				}
			]
		},
		{
			"title": "Advertenties in Vanced",
			"description": "Als je advertenties ziet in YouTube Vanced of Vanced Music, lees dan dit (xfileFIN):\n\n> Ik moet het zelf uitzoeken. Een eenvoudige lay-out om te verbergen zal daarom niet werken.\nNiet zeker hoe ze bepalen wie de advertenties krijgt, het zit allemaal op de server.\nWat ik weet is dat ik de lay-out niet kan verbergen, omdat dezelfde lay-out ook voor de video's wordt gebruikt. De code bepaalt gewoon of deze de advertentie-badge laat zien of niet.\nIk zou de advertentie-badge eenvoudig kunnen verbergen, maar het zou nog steeds de advertentie-video laten zien, zonder deze als advertentie te labelen.\nIk moet de advertentie zelf opsporen in de code, omdat het moeilijk is om hem te traceren.\n\nHet startscherm en de zoekadvertenties (toegevoegd door Google) zijn gebaseerd op de regio en worden niet getoond als je niet in de actieve regio vertoeft. Die advertenties worden op geen enkele manier toegevoegd door het Vanced team zelf, dus wijs niet met jouw vinger naar ons. \n\nOntwikkelaars weten reeds dat je advertenties in jouw regio ontvangt. Wacht geduldig op updates totdat alle advertenties worden geblokkeerd. Geniet ondertussen van Vanced en val ons niet lastig met chats over dit onderwerp.\n\nDe tijdelijke oplossing om dit op te lossen is het wissen van de gegevens en de cache van de app of wachten op toekomstige updates."
		},
		{
			"title": "Geschiedenis",
			"description": "Als je problemen ondervindt waarbij video's die worden bekeken en zoekresultaten niet worden bewaard door Vanced, betekent dit dat jouw geschiedenis niet werkt. Zo kan je dit oplossen:\n\n• Voor gebruikers die geroot zijn, ongeacht welke variant (non-root of root) je gebruikt,\n\n> Zorg ervoor dat je *s.youtube.com toevoegt aan de toestemmingslijst in je Ad-Blocker.\n\n⚠️OPMERKING voor Adaway gebruikers: als de URL op de toestemmingslijst staat, en dit niet werkt voor jou, klik op \"host-bronnen\" en vink \"stevenblack\" uit en klik dan op toepassen en start dan opnieuw op en je geschiedenis zal werken.⚠️\n\n• Voor non-root gebruikers:\n\n> Zorg ervoor dat je app versie 14.10.53 of hoger hebt geinstalleerd om je geschiedenis te bewaren. Als je geschiedenis nog steeds niet wordt bijgewerkt, dan moet je je merk-account samenvoegen in (YouTube Settings-https://www.youtube.com/account_advanced) om je geschiedenis te laten werken. (Samenvoegen zal wel je huidige geschiedenis opschonen)\n\n⚠️OPMERKING voor Adaway gebruikers die VPN Ad-Blocking gebruiken in plaats van root-gebaseerde Ad-Blocking: als je je merk-account niet gebruikt, zorg er dan voor dat je *s.youtube.com url aan de toestemmingslijst toevoegt en pas vervolgens de wijzigingen toe.⚠️"
		},
		{
			"title": "Problemen bij starten van app",
			"fields": [
				{
					"title": "Als Vanced vastloopt op het splash scherm",
					"content": "1. Schakel Vliegtuigmodus in.\n2. Open YouTube Vanced.\n\n3. Tik op sluiten in changelog popup.\n4. Schakel Vliegtuigmodus uit.\n5. Open Vanced opnieuw.\n\nDankzij rocco6victor van XDA"
				},
				{
					"title": "Als Vanced oneindig blijft laden",
					"content": "1. Schakel batterij optimalisatie uit voor zowel YouTube Vanced als microG met behulp van dontkillmyapp.com en herstart je apparaat.\n2. Het zou nu opgelost moeten zijn."
				}
			]
		},
		{
			"title": "Problemen met scherm-in-scherm",
			"description": "⚠️Gelieve geen PIP gerelateerde problemen te melden.⚠️\n• PIP wordt beheerd door het systeem zelf omdat Vanced originele Android PIP gebruikt. Maw. ROM is de oorzaak van eventuele problemen met PIP.\nAndere apps zoals MX Player, VLC, enz. gebruiken hun eigen PIP in plaats van dat van Android, en zullen dus nooit met dergelijke problemen worden geconfronteerd, die wel blijven bestaan in apps die Android PIP gebruiken.\n\n• PIP is alleen beschikbaar voor Android 8 en hoger.\n\n• Om PIP in te schakelen, open YouTube app instellingen > algemeen > scherm-in-scherm inschakelen\n\n> Om PIP in MIUI in te schakelen, moet je ervoor zorgen dat deze instelling is ingeschakeld:\nPrivacy beveiliging->beheren->speciale app toegang->scherm-in-scherm\n\nIn de Vanced versie 15. 3.32, is PIP gekend als een algemene YouTube fout, dus wacht tot dat Google dit probleem volledig heeft opgelost."
		},
		{
			"title": "Problemen met downloaden van app",
			"fields": [
				{
					"title": "Als je problemen ondervindt bij het downloaden van Vanced bestanden via vancedapp.com of je kan onze site niet openen vanwege server/regio beperkingen",
					"content": "Je kunt onze nieuwe Vanced Manager [hier] vinden (https://github.com/YTVanced/VancedManager/releases/)\n\nNOTEER: Hier moet je \"manager.apk\" kiezen bij de nieuwste versie > assets. Kies geen zip-bestanden of iets anders, want dat zijn geen apk's."
				},
				{
					"title": "Als je problemen ondervindt met het downloaden en installeren via Vanced Manager, kan je nog steeds de SAI/handmatige methode gebruiken om Vanced te installeren.",
					"content": "• Gebruik de MediaFire mirror om de vereiste bestanden te downloaden.\n>https://www.mediafire.com/folder/773e97cz2ezx1/AddFree_Youtube_BackgroundPlay_Enabled\n\n• Gebruik de AFH Mirror om de vereiste bestanden te downloaden\n>https://androidfilehost.com/?w=files&flid=170196\n\nNOTEER:\n\nA) Omdat we nu allemaal afzonderlijke apk-bestanden hebben op mediafire/afh, moet je alle \"base, architectuur en taal\" apk's unzippen en installeren via SAI. Alle 3 apk's zijn noodzakelijk voor de installatie.\nB) Handmatige installatie kan alleen worden gedaan via root, omdat toegang tot de root-opslag vereist is."
				}
			]
		},
		{
			"title": "Loskoppelen",
			"description": "Je kan onderstaande tussenoplossingen gebruiken om de YouTube app los te koppelen van de Play Store.",
			"fields": [
				{
					"title": "Tussenoplossing 1",
					"content": "In het geval dat bovenstaande methodes om los te koppelen voor jou niet werken, kan je kan die hieronder proberen:\n\nGebruik de Titanium backup app (pro versie is noodzakelijk)\n\n• Open Titanium backup \n\n• Zoek naar YouTube en klik erop \n\n• Veeg naar links voor toegang tot de speciale functies \n\n• Klik op Koppelen aan de Play Store/Market \n\n• Ga daarna opnieuw naar de speciale functies \n\n• Klik op Loskoppelen van de Play Store/Market \n\n• Klaar"
				},
				{
					"title": "Tussenoplossing 2",
					"content": "OPMERKING: Automatische update moeten worden uitgeschakeld in de Play Store voordat je dit doet.\n\n1. Maak een \"Detach.txt\" op de volgende locatie /sdcard/ (gelijk aan /storage/emulated/0/) en typ \"YouTube\" in dat tekstbestand zonder de aanhalingstekens. Je kan ook de Detach.txt downloaden van de Magisk modulenaam Detach en de # voor YouTube verwijderen.\n\n2. Flash de Detach module in de Magisk manager.\n\n3. Flash de Daily Job Scheduler (djs) in de Magisk manager.\n\n4. Herstart je apparaat\n\n5. Open de terminal en typ \"su -c detach -t\" en stel in om het één keer per uur uit te voeren.\n\n6. Klaar!\n\nPlay Store werkt zijn database bestand bij op een willekeurig ritme, soms meerdere keren per dag. Regelmatig (zoals om de twee weken) zal de Play Store een update voor Youtube tonen, maar het zal verdwijnen als het script opnieuw door djs wordt uitgevoerd."
				}
			]
		},
		{
			"title": "Oplossing voor SAI/Vanced Manager fouten",
			"description": "Hieronder vind je enkele gekende redenen die je kan tegenkomen wanneer je de instructies niet volgt, dus lees de juiste oorzaak met de bijhorende oplossing en los je probleem op.",
			"fields": [
				{
					"title": "INSTALL_FAILED_VERSION_DOWNGRADE",
					"content": "Verwijder standaard YouTube updates. Zorg ervoor dat de standaard YouTube versie lager is dan de Vanced versie die je nu installeert."
				},
				{
					"title": "INSTALL_FAILED_UPDATE_INCOMPATIBE",
					"content": "Verwijder elke Vanced app die je vanuit een andere bron hebt geïnstalleerd en installeer daarna de echte Vanced. Verwijder ook \"Vanced microG\" > herstart je apparaat > installeer daarna eerst Vanced microG en daarna Vanced. Als de fout zich nog steeds voordoet, gebruik dan SAI om de Vanced split apks handmatig te installeren. Deze apk-bestanden bevinden zich in \n\"android / data / com.vanced.manager / files / vanced / nonroot / \""
				},
				{
					"title": "INSTALL_PARSE_FAILED_NOT_APK",
					"content": "Verander de taal van je telefoon van het Indonesisch naar het Engels en installeer dan Vanced. Na de installatie kun je de taal terug veranderen naar het Indonesisch. Als jouw apparaat geen Indonesische taal gebruikt, zorg er dan voor dat je de juiste taal selecteert in Vanced Manager, waarmee je YouTube Vanced wil installeren."
				},
				{
					"title": "INSTALL_FAILED_NO_MATCHING_ABIS",
					"content": "Oudere legacy versie downloaden in plaats van de standaard versie"
				},
				{
					"title": "INSTALL_FAILED_INVALID_APK: Split config.en werd meerdere keren gedefiniëerd",
					"content": "Probeer één split_config.en apk te verwijderen uit het apks-bestand en installaleer daarna\n(Een apks-bestand is slechts een zip-bestand zodat je er makkelijk een apk uit kan verwijderen)"
				},
				{
					"title": "INSTALL_FAILED_DUPLICATE_PERMISSION",
					"content": "Verwijder microG > start opnieuw op > installeer Vanced via SAI > installeer microG\n\nAls microG niet geïnstalleerd raakt, installeer microG dan ook via SAI."
				},
				{
					"title": "Niet in staat om de app te installeren omdat deze conflicteert met een reeds geïnstalleerde app met dezelfde pakketnaam",
					"content": "Verwijder microG > start opnieuw op > installeer Vanced via SAI > installeer microG via apk installatie\nAls microG niet geïnstalleerd raakt, installeer microG dan via SAI."
				},
				{
					"title": "APP IS NIET COMPATIBEL MET DIT APPARAAT",
					"content": "Download de oude legacy architectuurbestanden bij het downloaden van Vanced bestanden van de officiële Vanced mirrors in plaats van de standaard architectuur."
				},
				{
					"title": "INSTALL_PARSE_FAILED_NO_CERTIFICATES",
					"content": "Het lijkt erop dat je de instructies niet goed hebt gelezen en geïnstalleerd hebt zonder de handtekeningverificatie uit te schakelen. of je hebt een methode geprobeerd die geen positief resultaat heeft opgeleverd, dus de oplossing voor beide is het uitschakelen van handtekeningverificatie, met de beste methode/alternatief die je eerder hebt gebruikt."
				},
				{
					"title": "INSTALL_FAILED_INVALID_INSTALL_LOCATION",
					"content": " Ga naar de instellingen van jouw apparaat > opties voor ontwikkelaars en schakel \"geforceerd extern toestaan van apps\" uit en installeer dan Vanced app via SAI."
				},
				{
					"title": "INSTALL_FAILED_USER_RESTRICTED: Installeren geannuleerd door de gebruiker",
					"content": "Installeren van Onbekende bronnen is per service beveiligd in je MIUI apparaten. Ga naar je apparaat instellingen en schakel onbekende bronnen voor SAI in. Dit probleem zal opgelost worden en je kan Vanced installeren."
				},
				{
					"title": "INSTALL_FAILED_INTERNAL_ERROR: Toegang geweigerd",
					"content": "MIUI optimalisatie uitschakelen in de ontwikkelaarsopties van je apparaat."
				}
			]
		},
		{
			"title": "Live-Stream issues",
			"description": "Oplossing: Volg deze gids > https://youtu.be/R9asMVCQkAU. Schakel ook je externe ad-blockers/vpn/proxy/aangepaste instellingen uit in Vanced. Behoud de standaardinstellingen als je geen problemen wil zien."
		},
		{
			"title": "Toestemmingslijst",
			"description": "Als je crashes hebt met YouTube Vanced root varianten owv toestemmingslijst-redenen, dan kun je deze gids proberen via deze link (https://www.xda-developers.com/how-to-fix-device-not-certified-by-google-error) en zie of dat een oplossing biedt voor jou.\n\n Alternatief, als de link niet helpt, flash je ROM om dit probleem op te lossen of probeer met een andere ROM."
		},
		{
			"title": "Oplossing voor video met zwart scherm",
			"description": "Oplossing: gegevens van de Youtube Vanced app wissen en vervolgens opnieuw installeren zou het probleem moeten oplossen. Als dit niet het geval is, probeer dan opnieuw op te starten en\nControleer of dit het zwart scherm probleem oplost. \n\nAls het probleem zich blijft voordoen, reset je apparaat naar de fabrieksinstellingen of wijzig de ROM."
		},
		{
			"title": "Inhoud Beperkingen",
			"description": "In het Engels wordt het \"restricted mode\" genoemd\nIn het arabisch wordt het '\"وضع تقييد المحتوى\" genoemd.'\n\nOm het probleem van de mindere zoekresultaten op te lossen, doe je dit\n\n1. Ga naar instellingen > Algemeen\n\n2. Zoek \"Beperkte modus\" en schakel deze uit.\n\nAls je in een land bent dat Google haat, gebruik dan een VPN."
		},
		{
			"title": "Weergave van aantallen wijzigen",
			"description": "Om de weergave van aantallen te wijzigen van crores/lakhs naar miljoenen, doe dit:\n\n\nOplossing:\n\n1. Ga naar instellingen (van jouw telefoon)\n\n2. Ga naar systeem \n\n3. Ga naar taalvoorkeuren\n\n4. Voeg een taal toe als Engels (VS) \n\n5. Sleep deze taal boven je huidige.\n\n6. Ga naar youtube en geniet van ⚡\n\nMet dank aan @ROG_OK van telegram Vanced group voor deze oplossing."
		},
		{
			"title": "Ondertitels",
			"description": "Als je problemen hebt met ondertitels zoals willekeurige ondertitels van verschillende talen in een Engelse video, dan moet je dit doen;\nZet de taal van ondertitels naar jouw regio taal in je instellingen van ondertitels.\n\nGa naar apparaatinstellingen > toegankelijkheid > ondertitels\n\nof\n\nYouTube instellingen > ondertitels"
		},
		{
			"title": "Tussenoplossing HDR helderheid",
			"description": "Gebruik de veegfuncties om de helderheid op maximum in te stellen"
		},
		{
			"title": "Instellingen crashes",
			"description": "Schakel je vingerafdruk uit en ga naar de instellingen en maak je instelling, schakel daarna weer in. Daarna zal het niet meer opnieuw crashen, tenzij je jouw apparaat opnieuw opstart."
		}
	]
}
