{
  "data": [
    {
      "title": "Vanced",
      "description": "YouTube Vanced旨在成為原生YouTube的更好版本。它包括廣告阻擋，深色主題等等。使用Vanced Manager可以相對輕鬆地安裝YouTube Vanced。"
    },
    {
      "title": "Vanced Music",
      "description": "YouTube Music Vanced與YouTube Vanced的目標相同，但此應用程式專注於YouTube音樂。與Vanced相比，功能相對而言要少一些，但在YouTube Music Vanced內，您仍然可以期待很多功能，例如廣告攔截和背景播放！"
    },
    {
      "title": "YouTube Vanced 主要特色",
      "description": "- 對 OLED 友善的黑色主題和暗色主題_(aka 深灰色)_除了白色主題\n- 阻擋所有廣告\n- 允許您在背景或子母畫面(PiP)模式(只在 Android 8+) 中播放影片\n- 滑動控制允許您透過上下手勢控制亮度和音量(可調整設定)\n- 自動重播功能可讓您重複播放影片\n- 可以將新的 留言/平板迷你播放器 版面切換到與平板舊版非常相似的版本(但是，它有點問題)"
    },
    {
      "title": "個人化",
      "description": "- Allows you to override Codec options such as forcing H264 for old devices or VP9, this also allows you to force HDR playback or turn off 60fps if you prefer a cinematic experience. (Custom device configs for these features can be found on our [Discord server](https://discord.gg/Vanced) or XDA)\n- Force the default video resolution as high or low as you want and even override your screen resolution for that sharp 4k playback on any device. It also allows you to change default playback speed to anywhere between 0.25x to 2x (assuming your device is powerful enough)\n- Allows you to toggle home ads, most UI ads, Merchandise ads, Community posts, Movie upselling, compact banner info (such as the COVID-19 info), remove comments entirely, compact movie, movie shelf removal and many more!"
    },
    {
      "title": "SponsorBlock",
      "description": "- Features the ability to skip sponsor segments (where a [YouTuber](https://en.wikipedia.org/wiki/YouTuber) advertises a service or product in the middle of a video)\n- It also supports skipping other categories, such as intros, outros and self-promotion.\n- Uses the API [found here](https://sponsor.ajay.app). You can find more information on how it works\n- It also allows you to submit your own segments to the API and contribute to the wider community\n- Complete control over whether to automatically skip a segment category or show a button for skipping, or simply just not skipping it at all.\n- Highlights the segment in the specific colour based on its category in the playback timeline."
    },
    {
      "title": "平台",
      "description": "本 APP 目前僅能在 Android 平台上使用，且暫時沒有支援其他平台的計劃。"
    },
    {
      "title": "有無 ROOT 的差別",
      "description": "#### Root:\nThe root variant of Vanced seamlessly replaces the official YouTube app. As a result, you can directly open YouTube links or call them using Google Assistant through the modded Vanced app.\n\n#### Non-Root:\n- If you have a device that is difficult to root, or you don’t want to root your daily device on first hand, you should opt for the non-root variant.\n- Since the package name of the non-root variant is different from the stock YouTube app, they can co-exist. Note that you need to install an additional companion app (Vanced microG) to be able to log in with your YouTube/Google account.\n- Moreover, you have to manually set Vanced as the default app for opening YouTube links.\n- However, the non-root variant is much simpler to install and use, so we recommend you stick with the non-root variant unless you really need to replace the stock YouTube app on your phone."
    }
  ]
}
