{
    "bugreport": [
        {
            "title": "How to report bugs",
            "description": "You can report bugs using our [GitHub issue tracker](https://github.com/YTVanced/Vanced)\n\n**Make sure to read README and check if your bug is already reported before reporting bugs!**",
            "fields": [
                {
                    "title": "When will my bug be reviewed?",
                    "content": "Your feedback will be reviewed as soon as possible."
                }
            ]
        },
        {
            "title": "Report a regular bug",
            "description":"Modifying an app is not an easy job, sometimes applying a modification can cause an unexpected bug and we can't catch all of them.\nThat's where you come in! If you experience a bug and want to help us improve Vanced, you would help a ton by providing a logcat.\nA logcat is a log of all processes on your system. This helps a lot with identifying the problem. This is however a bit inconvenient and requires a pc.\nIf you do have one, please take the time and take one to help us fix this!",
            "fields": [
                {
                    "title": "On your phone",
                    "content": "1. Open your settings app and go to `About Phone/Phone Info` and click your build number 7 times.\n2. Now go back to the settings main menu.\n3. You will now either have a new tab `Developer Options` in this menu or in the system menu.\n4. Open Developer Options and enable `USB-Debugging`."
                },
                {
                    "title": "On your PC/Laptop",
                    "content": "[Visit this website](https://developer.android.com/studio/releases/platform-tools) and download the tools for your operating system.\n2. Extract them.\n3. Open the extracted folder to find many `.exe` files.\n4. `Shift + Rightclick` the background of the extracted folder and select `Run command prompt / powershell here`.\n5. Plug your phone into your PC, unlock it and grant USB-Debugging Permission.\n6. Type `adb devices`. If your phone is shown, proceed. If not, google for `[yourBrandHere] usb drivers` and install them.\n7. Type `adb logcat -c`, then `adb logcat *:W > logcat.txt`.\n8. Open your Vanced, reproduce your bug and then close the command prompt.\n9. Now you will find a new file `logcat.txt` in the folder. Open it, scan it quickly to remove confidential info.\nPress `CTRL + A` => `CTRL + C`, open https://hastebin.com/, paste it and save. Use the output link for your bug report.\n"
                }
            ]
        },
        {
            "title": "Report a theme bug",
            "description": "This guide will show you how to report Theme based bugs.\\nIn order to report bugs, you will need [Developer Assistant](https://play.google.com/store/apps/details?id=com.appsisle.developerassistant)",
            "fields": [
                {
                    "title": "Let's get started",
                    "content": "After you have downloaded `Developer Assistant`, open Vanced and find the bug, then open layoutviewer by holding down your home button until the app launches.\nNow follow these steps:\n1. Make sure the bug you're experiencing is on the screen\n2. Tap on the element that you think is affected by a bug\n3. Go to the `Element` and `Hierarchy` tabs and screenshot the output\n4. Use that screenshot for your bug report"
                }
            ]
        }
    ]
}