{
    "features": [
    	{
			"title": "YouTube",
			"description": "YouTube Vanced is the stock Android YouTube app, but better! Includes adblocking, true amoled dark mode and a lot more. Use the handy Vanced Manager to install YouTube Vanced with ease."
		},

		{
			"title": "Music",
			"description": "Vanced, but for Youtube Music! This is relatively less feature rich compared to vanced but still features many things you come to expect like adblocking and background playback all inside Youtube Music!"
		},

        {
        	"title": "Main Features",
			"description": "Features the option of an amoled black theme to reduce eye and battery strain.\n- Blocks All videos ads and allows you to play videos in the background or in Picture in Picture (only on android 8.0 and up)\n- Swipe controls allow you to control brightness and volume like how it is in other video player apps such as VLC or MX Player (with configurable padding).\n- New auto repeat feature allowing you to enjoy videos like tiktoks/vines or simply continue playing a song on loop.\n- Not liking the new comments section or miniplayer? Those also can be toggled to the tablet versions which are very similar to the old version (albeit slightly buggy)."
        },

        {
        	"title": "Customization",
        	"description": "- Allows you to override Codec options such as forcing H264 for old devices or VP9, this also allows you to force HDR playback or turn off 60fps if you prefer a cinematic experience. (Custom device configs for these features can be found on our discord or XDA)\n- Force the default video resolution as high or low as you want and even override your screen resolution for that sharp 4k playback on any device, and also allows you to change default playback speed to anywhere between 0.25x to 2x (assuming your device is powerful enough)\n- Allows you to toggle home ads, most UI ads, Merchandise ads, Community posts, Movie upselling, compact banner info (such as the covid info), remove comments entirely, compact movie, movie shelf removal and many more!"
        },

        {
        	"title": "Sponsor Block",
        	"description": "- Features the ability to skip annoying sponsor segments (where a youtuber advertises a service or product in the middle of a video)\n- It also supports skipping other categories, such as intros, outros and reminders to subscribe.\n- Uses the API found here. You can find more information on how it works\n- Also allows you to submit your own segments to the API and contribute to the wider community\n- Complete control over whether to automatically skip a segment category or show a button for skipping, or simply just not skipping it at all.\n- Highlights the segment in the specific colour based on its category in the playback timeline."
        },

        {
        	"title": "Platforms",
        	"description": "we currently only support android, there are no plans to support any other platforms any time soon"
    	},

        {
        	"title": "Difference between Root and Non-Root",
        	"description": "- Root: \nThe root variant of Vanced seamlessly replaces the official YouTube app. As a result, you can directly open YouTube links or call them using Google assistant through the modded vanced app.\n- Non-Root:\n- However, if you have a device that is difficult to root or you don’t want to root your daily driver on the first hand, you should opt for the non-root variant. \n- It can be installed on a rooted device as well. Since the package name of the non-root variant is different from the stock YouTube app, they can co-exist. Note that you need to install an additional companion app (Vanced microG) to be able to log in with your YouTube/Google account. \n- Moreover, you have to manually set Vanced as the default app for opening YouTube links. \n- However, the non-root variant is simply easier to live with, so our recommendation is to stick with the non-root variant unless you really need to replace the stock YouTube app on your phone."
        }
    ]
}
