{
  "data": [
    {
      "title": "Mikä on YouTube Vanced?",
      "description": "YouTube Vanced on muokattu versio YouTubesta, jossa on lisäominaisuuksia, jotka tekevät YouTube-kokemuksestasi paremman!\n\nTällaisia ominaisuuksia ovat:\n- Taustatoisto,\n- Kuva kuvassa (PiP), \n- Musta teema (OLED ystävällinen),\n- Mainosten poisto (vaatii käyttöönoton),\n- Ohita maksimiresoluutio (sallii videon toiston resoluutiolla, joka on suurempi kuin näyttösi),\n- ...ja paljon muuta!\n\nLisätietoja osoitteessa <https://vancedapp.com>"
    },
    {
      "title": "Missä on latauspainike?",
      "description": "Of course, Google won't allow a modified version of its own app to be on their store so don't look for it on the Google Play Store, those are just fake apps.\n\nVanced apps can be downloaded and installed using Vanced Manager which can be found on our official website: <https://vancedapp.com> but you can also grab it from [GitHub repo](https://github.com/YTVanced/VancedManager/releases/latest)."
    },
    {
      "title": "Päivittyykö YouTube Vanced automaattisesti?",
      "description": "Ei.\n\nVanced Manager ilmoittaa kun päivitys on saatavissa.\n\nVoit myös liittyä [Discord-palvelimellemme](https://discord.gg/wYrRPgv) tai seurata [Telegram-kanavaamme](https://t.me/Vanced) uutisia ja päivitysilmoituksia varten."
    },
    {
      "title": "Voiko Vancedilla ladata videoita?",
      "description": "Vanced ei sisällä, eikä koskaan tule sisältämään minkäänlaista videoiden latausominaisuutta.\n\nMonet videot ovat ladattavissa ilmaiseksi [valituissa maissa](https://support.google.com/youtube/answer/6141269). Muualla maailmassa hanki YouTube Premium tai käytä kolmannen osapuolen lataajia.\n\nVielä kerran, Vanced ei tule KOSKAAN lisäämään videolataajaa tai mitään muuta vastaavaa.\n\nTämä on ollut syynä monien YouTube-modien sulkemiseen aiemmin, koska Google ei halua ihmisisten lataavan tekijänoikeudella suojattua sisältöä palvelustaan, joten älä pyydä sitä!!!"
    },
    {
      "title": "Mikseivät pyyhkäisyeleet toimi?",
      "description": "Jos kommenttisi näkyvät alhaalla (vanhassa paikassa) Vancedin asetuksissa > Asettelun asetukset, poista se käytöstä ja käynnistä sovellus uudelleen. Jos se ei toimi, pakota sovelluksen lopetus ja tyhjennä sen data."
    },
    {
      "title": "Tekstitykset eivät ole saatavilla?",
      "description": "Tämä ei ole virhe. Kaikissa videoissa ei vain ole tekstityksiä."
    },
    {
      "title": "Otatteko vastaan lahjoituksia?",
      "description": "Me EMME hyväksy lahoituksia!\n\nKaikenlaiset lahjoitukset kaikenlaisissa olosuhteissa ja missä tahansa sivustossa, linkeissä tai julkaisuissa jotka pyytävät lahjoituksia ovat yksinkertaisesti väärennettyjä.\n\nMutta jos haluat tukea Vancedin kehittäjiä, voit ladata Braven käyttämällä [tätä linkkiä](https://brave.com/kev231) ja AdGuardin käyttämällä [tätä linkkiä](https://adguard.com/en/welcome.html?aid=31141)."
    },
    {
      "title": "Kuinka saada soitin piiloutumaan automaattisesti?",
      "description": "Voit määrittää sen menemällä kohteeseen YouTube Vanced > Asetukset > Esteettömyys. Jos asetukset eivät aukea tai eivät toimi, mene laitteesi esteettömyysasetuksiin ja poista käytöstä \"sound amplifier, switch access, live caption\"."
    },
    {
      "title": "Miksi käyttää jaettuja APK:ita?",
      "description": "Sillä:\n\n1. Tavallinen YouTube käyttää sitä joten niin Vancedkin.\n2. Se asentaa vain kielet jotka itse määrittelet säästääkseen tallennustilaa.\n3. Siinä on vain versio ydin APK:sta jonka laitteesi vaatii.\n\nToki Vanced Manager tai kehittäjät voivat muuttaa sen normaaliksi, yhdeksi APK-tiedostoksi, mutta olemme liian laiskoja tekemään niin. Sinun pitää vain tottua siihen mitä meillä on...\n\nÄlä kuitenkaan huoli, Vanced Manager tekee kaiken vaikean sinun puolestasi joten sinun on vain painettava \"Asenna\" painiketta."
    },
    {
      "title": "Miksi aloitusnäytön väri on eri kuin teeman?",
      "description": "Aloitusnäytön taustaväri on otettu Androidin frameworkin väristä varmistaakseen että se muuttuu järjestelmän teeman mukaan. Voit käyttää [Substratumia](https://play.google.com/store/apps/details?id=projekt.substratum) tai [Swift Installeria](https://play.google.com/store/apps/details?id=com.brit.swiftinstaller)."
    },
    {
      "title": "Pitäisikö minun ladata asennustiedostot uudelleen?",
      "description": "Tiedostot voivat korruptoitua monista eri syistä ja aiheuttaa ongelmia jälkikäteen. Välttääkseen tämän, voit valinnaisesti ladata sen uudelleen varmistaaksesi että asennus sujuu sulavasti."
    },
    {
      "title": "Miksi root-versiolla ei ole Mikrofonin käyttöoikeutta?",
      "description": "Se tekee jos Vancedisi on ajan tasalla."
    },
    {
      "title": "Mikä on ExoPlayer v1?",
      "description": "Se on vanhempi versio nykyisestä YouTuben käyttämästä mediasoittimesta. Saatat saada paremman suorituskyvyn ja vakauden käyttäessä sitä."
    },
    {
      "title": "Kuinka otan piilotetut asetukset käyttöön?",
      "description": "Vancedin asetuksissa, napauta `Tiedot` kohtaa 6-7 kertaa ottaaksesi sen käyttöön. Tämä ottaa käyttöön vain videon koodekin lisäasetukset."
    },
    {
      "title": "Kuinka asettaa YouTube Vanced oletussovellukseksi?",
      "description": "Niin kuin otsikko sanoo, monet käyttäjät ovat kysyneet monesti kuinka he voisivat asettaa YouTube Vancedin oletussovellukseksi YouTube linkeille muista sovelluksista(kuten selaimet, viestintäsovellukset ja mitkä tahansa muut).\n\nRootilla, sinun ei tarvitse huolehtia sillä se on asetettu jo valmiiksi sillä YouTube Vanced korvaa tavallisen YouTuben.\n\nIlman rootia, ratkaisut ovat jaettu OneUIn, MIUIn ja muitten välillä. Me emme voi antaa ratkaisua jokaiselle käyttöjärjestelmälle ja sinun on ehkä Googletettava se itse.",
      "fields": [
        {
          "title": "OneUI käyttäjät:",
          "content": "1. Tap and hold down on YouTube or YouTube Vanced app icon from your app drawer.\n2. Tap **App info**.\n3. Find \"**Set as default**\" and tap it\n4. Tap \"**Open supported links**\" and choose \"**Open in this app**\"\n\nIn older versions of OneUI, the name of the options in the 4th step might be slightly different. You may need to tap \"**Go to supported URLs**\" and choose \"**In this app**\" option.\nIn the very older version of OneUI 💩, you may need to go to **Settings** > **Apps** > *[tap three dots at the right corner]* > **Default apps** > **Set as default**. After apps loaded Find YouTube Vanced or YouTube and follow the 4th step..."
        },
        {
          "title": "MIUI käyttäjät:",
          "content": "1. Open Settings\n2. Go to **Apps**,\n3. **Manage apps**,\n4. Then, tap the three dots at the right corner,\n5. **Default apps**,\n6. **Opening links**.\n7. Wait until all your apps gets listed…\n8. Find YouTube or YouTube Vanced and tap it.\n9. Tap \"**Open supported links**\" and choose \"**Open**\""
        },
        {
          "title": "AOSP & muut mukautetut käyttöliittymät (OOS, ColorOS, EMUI jne.):",
          "content": "1. Open **Settings**\n2. Go to **Apps**\n3. Tap **Default apps**\n4. Find **YouTube** or **YouTube Vanced**\n5. Tap \"**Go to Supported URLs**\" and choose \"**Open in this app**\" option\n\nIf you're still troubling with this, you may need to search some \"how to\" articles/videos on [Google](https://www.google.com/search?q=%22android%22+how+to+open+youtube+links+with+youtube) or you can install a 3rd party app from [Play Store](https://play.google.com/store/search?q=open%20with) to save you from this hassle…"
        }
      ]
    },
    {
      "title": "Why the root variant doesn't work with microG Core?",
      "description": "1. You need to have at least the [pico](https://github.com/opengapps/opengapps/wiki/Pico-Package) variant of GApps to run Vanced.\n\n2. You can’t run Vanced with microG Core without Google Play Services Framework which is available in all GApps packages and it's a required library.\n\n3. If you are worried about your privacy & don’t want to use GApps but still want to use watch YouTube without ads, then the [web version](https://youtube.com) is always available."
    },
    {
      "title": "Why casting doesn't work?",
      "description": "For users with latest v16.16.38 non-root variant, there's a bug in upstream microG. Until that resolves, please wait for updates or roll back to v15 versions. Root users will no issues with casting if they are using Google Play Services."
    },
    {
      "title": "What is APK Signing?",
      "description": "You are reading this because you are not using Vanced Manager or you may have installed Vanced from an unofficial source.\nJust use Vanced Manager!\n\nYou can safely download Vanced Manager from:\n- [Official site](https://vancedapp.com)\n- [GitHub repository](https://github.com/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Onko YouTube Vanced Play Kaupassa?",
      "description": "NO!\nAgain, DO NOT install or even try to search for any fake apps named \"YouTube Vanced\" or similar on the Play Store or any app stores to install Vanced.\n\nWe only have [Vanced Guide](https://play.google.com/store/apps/details?id=com.vanced.faq), and it's the only official app published on Play Store.\n\nIf you find any other app with our icon and name, report it as impersonation and give it a bad review.\n\nOur apps can only be found at [official site](https://vancedapp.com)."
    },
    {
      "title": "Why is Vanced not showing up in home screen or app drawer?",
      "description": "You are reading this because you are not using Vanced Manager or you may have installed Vanced from an unofficial source.\nJust use Vanced Manager!\n\nYou can safely download Vanced Manager from:\n- Official site <https://vancedapp.com>\n- [GitHub repository](https://github.com/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Mikseivät videot toistu?",
      "description": "Yritä käynnistää sovellus uudelleen. Se voi johtua myös internetyhteydestäsi tai laitteestasi."
    },
    {
      "title": "Miksi video on rajoitettu 480p:hen?",
      "description": "COVID-19:n takia Google rajoittaa datan käyttöä useissa maissa. Tämä tapahtuu palvelimella ja vaikuttaa sekä Vancedin että normaalin YouTuben käyttäjiin.",
      "fields": [
        {
          "title": "Väliaikaiset korjaukset:",
          "content": "1. Yhdistä eri alueen VPN-verkkoon.\n2. Käytä [web-versiota](https://youtube.com)\n3. Koska 480p-rajoitus koskee vain mobiililaitteita eikä tabletteja, voit muuttaa laitteesi mallia Youtube Vancedissa ohittaaksesi sen.\n\n#### Kuinka muutat laitteen mallia?\n1. Avaa YouTube Vanced.\n2. Ota lisäasetukset käyttöön \n  1. Mene asetuksiin\n  2. Napauta Vanced-asetukset\n  3. Napauta Tietoja-osiota kunnes saat piilotettujen asetusten käyttöönotosta ilmoittavan viestin.\n3. Mene Koodekin ohitus -kohtaan ja aseta malliksi \"SM-T865\" ja laitteeksi \"Samsung\".\n4. Käynnistä sovellus uudelleen ja 480p-rajoituksen pitäisi olla poistunut."
        }
      ]
    },
    {
      "title": "Kuinka piilottaa microG ilmoitus?",
      "description": "To hide microG the notification,\n\n1. You can disable battery optimization for Vanced microG and reboot your device.\n\n2. If the above method doesn't work, disable microG notifications by holding on to the notification, toggle it off and tap Save.\n\n> Disabling app notifications can be done in different ways depending on the Android user interface. If you don't know how to disable it, try using Google for learning how to disable it."
    },
    {
      "title": "Does 1440p look better on my 1080p screen?",
      "description": "Yes, but only if the video ratio is something like 18:9, 21:9, ... You can enable `Stats for nerds` in Settings > General to confirm it.\n\nTo enable higher resolutions, go to Vanced settings > Video settings and turn on `Max resolution` then restart the app."
    }
  ]
}
