{
  "data": [
    {
      "title": "Mikä on YouTube Vanced?",
      "description": "YouTube Vanced on muokattu versio YouTubesta, jossa on lisäominaisuuksia, jotka tekevät YouTube-kokemuksestasi paremman!\n\nTällaisia ominaisuuksia ovat:\n- Taustatoisto,\n- Kuva kuvassa (PiP), \n- Musta teema (OLED ystävällinen),\n- Mainosten poisto (vaatii käyttöönoton),\n- Ohita maksimiresoluutio (sallii videon toiston resoluutiolla, joka on suurempi kuin näyttösi),\n- ...ja paljon muuta!\n\nLisätietoja osoitteessa <https://vancedapp.com>"
    },
    {
      "title": "Missä on latauspainike?",
      "description": "Luonnollisesti Google ei salli oman sovelluksensa muokatun version olevan heidän kaupassaan, joten älä etsi sitä Google Play Kaupasta, ne ovat valesovelluksia.\n\nVanced-sovelluksia voidaan ladata ja asentaa Vanced Managerilla, joka löytyy viralliselta sivustoltamme: <https://vancedapp.com> ja voit myös napata sen GitHubista: <https://github.com/YTVanced/VancedManager/releases/latest>"
    },
    {
      "title": "Päivittyykö YouTube Vanced automaattisesti?",
      "description": "Ei.\n\nVanced Manager ilmoittaa kun päivitys on saatavissa.\n\nVoit myös liittyä [Discord-palvelimellemme](https://discord.gg/wYrRPgv) tai seurata [Telegram-kanavaamme](https://t.me/Vanced) uutisia ja päivitysilmoituksia varten."
    },
    {
      "title": "Voiko Vancedilla ladata videoita?",
      "description": "Vanced ei sisällä, eikä koskaan tule sisältämään minkäänlaista videoiden latausominaisuutta.\n\nMonet videot ovat ladattavissa ilmaiseksi [valituissa maissa](https://support.google.com/youtube/answer/6141269). Muualla maailmassa hanki YouTube Premium tai käytä kolmannen osapuolen lataajia.\n\nVielä kerran, Vanced ei tule KOSKAAN lisäämään videolataajaa tai mitään muuta vastaavaa.\n\nTämä on ollut syynä monien YouTube-modien sulkemiseen aiemmin, koska Google ei halua ihmisisten lataavan tekijänoikeudella suojattua sisältöä palvelustaan, joten älä pyydä sitä!!!"
    },
    {
      "title": "Mikseivät pyyhkäisyeleet toimi?",
      "description": "Jos kommenttisi näkyvät alhaalla (vanhassa paikassa) Vancedin asetuksissa > Asettelun asetukset, poista se käytöstä ja käynnistä sovellus uudelleen. Jos se ei toimi, pakota sovelluksen lopetus ja tyhjennä sen data."
    },
    {
      "title": "Tekstitykset eivät ole saatavilla?",
      "description": "Tämä ei ole virhe. Kaikissa videoissa ei vain ole tekstityksiä."
    },
    {
      "title": "Otatteko vastaan lahjoituksia?",
      "description": "Me EMME hyväksy lahoituksia!\n\nKaikenlaiset lahjoitukset kaikenlaisissa olosuhteissa ja missä tahansa sivustossa, linkeissä tai julkaisuissa jotka pyytävät lahjoituksia ovat yksinkertaisesti väärennettyjä.\n\nMutta jos haluat tukea Vancedin kehittäjiä, voit ladata Braven käyttämällä [tätä linkkiä](https://brave.com/kev231) ja AdGuardin käyttämällä [tätä linkkiä](https://adguard.com/en/welcome.html?aid=31141)."
    },
    {
      "title": "How to make the player layout auto-hide?",
      "description": "You can configure it in YouTube Vanced > Settings > Accessibility. If the settings fail to open or doesn't work, go to your device accessibility settings and disable sound amplifier, switch access, live caption."
    },
    {
      "title": "Why using split APKs?",
      "description": "Because:\n\n1. The stock app uses it so Vanced uses it too.\n2. It only installs the languages you specify to reduce storage consumption.\n3. It has the only version of core APK that your device requires.\n\nOf course, the Vanced Manager or developers can convert it to a normal, single APK file, but we are so lazy to do it. You just need to get along with what we have...\n\nDon't worry though, Vanced Manager does all the hard work for you so just tap on the `Install` button."
    },
    {
      "title": "Why the colour in the startup screen is different from the theme?",
      "description": "The startup screen background color is taken from the Android framework colour to make sure it changes according to the system theme. You can use [Substratum](https://play.google.com/store/apps/details?id=projekt.substratum) or [Swift Installer](https://play.google.com/store/apps/details?id=com.brit.swiftinstaller) or a similar app to change the colour."
    },
    {
      "title": "Should I re-download the installation files?",
      "description": "Files can be corrupted because of various reasons and can cause problems afterward. To avoid this, you can choose to download it again to ensure your installation goes smoothly."
    },
    {
      "title": "Why does the root version don't have Microphone permission?",
      "description": "It does if your Vanced is up-to-date."
    },
    {
      "title": "Mikä on ExoPlayer v1?",
      "description": "It's an older version of the current media player used by YouTube. You might get better performance and stability when using it."
    },
    {
      "title": "Kuinka otan piilotetut asetukset käyttöön?",
      "description": "In Vanced settings, tap on the `About` section 6-7 times to enable it. This only enables the additional video codec settings."
    },
    {
      "title": "Why the root variant doesn't work with microG Core?",
      "description": "1. You need to have at least the [pico](https://github.com/opengapps/opengapps/wiki/Pico-Package) variant of GApps to run Vanced.\n\n2. You can’t run Vanced with microG Core without Google Play Services Framework which is available in all GApps packages and it's a required library.\n\n3. If you are worried about your privacy & don’t want to use GApps but still want to use watch YouTube without ads, then the [web version](https://youtube.com) is always available."
    },
    {
      "title": "Why casting doesn't work?",
      "description": "Se toimii, jos microG on ajan tasalla."
    },
    {
      "title": "What is APK Signing?",
      "description": "You are reading this because you are not using Vanced Manager or you may have installed Vanced from an unofficial source.\nJust use Vanced Manager!\n\nYou can safely download Vanced Manager from:\n- Official site <https://vancedapp.com>\n- [GitHub repository](https://github.com/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Onko YouTube Vanced Play Kaupassa?",
      "description": "NO!\nAgain, DO NOT install or even try to search for any fake apps named \"YouTube Vanced\" or similar on the Play Store or any app stores to install Vanced.\n\nWe only have [Vanced Guide](https://play.google.com/store/apps/details?id=com.vanced.faq), and it's the only official app published on Play Store.\n\nIf you find any other app with our icon and name, report it as impersonation and give it a bad review.\n\nOur apps can only be found at <https://vancedapp.com>."
    },
    {
      "title": "Why is Vanced not showing up in home screen or app drawer?",
      "description": "You are reading this because you are not using Vanced Manager or you may have installed Vanced from an unofficial source.\nJust use Vanced Manager!\n\nYou can safely download Vanced Manager from:\n- Official site <https://vancedapp.com>\n- [GitHub repository](https://github.com/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Mikseivät videot toistu?",
      "description": "Yritä käynnistää sovellus uudelleen. Se voi johtua myös internetyhteydestäsi tai laitteestasi."
    },
    {
      "title": "Miksi video on rajoitettu 480p:hen?",
      "description": "COVID-19:n takia Google rajoittaa datan käyttöä useissa maissa. Tämä tapahtuu palvelimella ja vaikuttaa sekä Vancedin että normaalin YouTuben käyttäjiin.",
      "fields": [
        {
          "title": "Väliaikaiset korjaukset:",
          "content": "1. Yhdistä eri alueen VPN-verkkoon.\n2. Käytä [web-versiota](https://youtube.com)\n3. Koska 480p-rajoitus koskee vain mobiililaitteita eikä tabletteja, voit muuttaa laitteesi mallia Youtube Vancedissa ohittaaksesi sen.\n\n#### Kuinka muutat laitteen mallia?\n1. Avaa YouTube Vanced.\n2. Ota lisäasetukset käyttöön \n  1. Mene asetuksiin\n  2. Napauta Vanced-asetukset\n  3. Napauta Tietoja-osiota kunnes saat piilotettujen asetusten käyttöönotosta ilmoittavan viestin.\n3. Mene Koodekin ohitus -kohtaan ja aseta malliksi \"SM-T865\" ja laitteeksi \"Samsung\".\n4. Käynnistä sovellus uudelleen ja 480p-rajoituksen pitäisi olla poistunut."
        }
      ]
    },
    {
      "title": "How to hide the microG notification?",
      "description": "To hide microG the notification, you can disable battery optimization for microG and reboot your device.\n\nIf the notification is still there after reboot, disable microG notifications by holding on to the notification, toggle it off and tap Save.\n\nDisabling app notifications can be done in different ways depending on the Android user interface. If you don't know how to disable it, try using Google for learning how to disable it."
    },
    {
      "title": "Näyttääkö 1440p paremmalta 1080p-näytölläni?",
      "description": "Yes, but only if the video ratio is something like 18:9, 21:9, ... You can enable `Stats for nerds` in Settings > General to confirm it.\n\nTo enable higher resolutions, go to Vanced settings > Video settings and turn on `Max resolution` then restart the app."
    }
  ]
}