{
  "data": [
    {
      "title": "Co je YouTube Vanced?",
      "description": "YouTube Vanced je upravená verze YouTube s funkcemi a vylepšeními, díky nimž bude váš zážitek z YouTube lepší!\n\nMezi takové funkce patří:\n- Přehrávání na pozadí,\n- Obraz v obraze (PiP), \n- Černý motiv (vhodný pro OLED),\n- Odstranění reklam (vyžaduje zapnutí),\n-Přepsání maximálního rozlišení (povolí přehrávání videa s vyšším rozlišením, než má vaše obrazovka),\n- ...a mnohem více!\n\nPro více informací navštivte <https://vancedapp.com>"
    },
    {
      "title": "Kde je tlačítko Stáhnout?",
      "description": "Google samozřejmě nedovolí, aby v jejich obchodě byla upravená verze jeho vlastní aplikace, takže ji v Obchodě Google Play nehledejte, jedná se o falešné aplikace.\n\nAplikace Vanced lze stáhnout a nainstalovat pomocí aplikace Vanced Manager, kterou najdete na našem oficiálním webu: <https://vancedapp.com>, ale můžete si ji také stáhnout z GitHubu:\n<https://github.com/YTVanced/VancedManager/releases/latest>"
    },
    {
      "title": "Bude se YouTube Vanced automaticky aktualizovat?",
      "description": "Ne, nebude.\n\nVanced Manager vám pošle oznámení, pokud aktualizace existuje.\n\nMůžete se také připojit k našemu [serveru Discord](https://discord.gg/Vanced), nebo sledovat [Telegram kanál](https://t.me/Vanced), kde také najdete nejnovější zprávy a oznámení o aktualizacích."
    },
    {
      "title": "Může Vanced stahovat videa?",
      "description": "Vanced neobsahuje žádnou funkci stahování videa a nikdy obsahovat nebude.\n\nMnoho videí je k dispozici ke stažení zdarma ve [vybraných zemích](https://support.google.com/youtube/answer/6141269). Pro zbytek světa si pořiďte YouTube Premium nebo použijte stahovací program třetích stran.\n\nZnovu, Vanced NIKDY nepřidá do aplikace funkci stahování videa ani nic podobného.\n\nTo byl v minulosti důvod pro ukončení mnoha modifikací YouTube, protože Google nemá rád lidi, kteří si z jejich platformy stahují obsah chráněný autorskými právy, takže o to nežádejte!!!"
    },
    {
      "title": "Proč nefungují gesta přejetím?",
      "description": "Pokud máte v dolní části (staré místo) v Nastavení Vanced > Nastavení rozložení zobrazeny komentáře, vypněte je a restartujte aplikaci. Pokud to nepomůže, vynuceně ukončete aplikaci a vymažte její data."
    },
    {
      "title": "Titulky nejsou dostupné?",
      "description": "Toto není problém týkající se Vanced nebo YouTube. Ne všechna videa obsahují titulky."
    },
    {
      "title": "Přijímáte dary?",
      "description": "NEAKCEPTUJEME žádné dary!\n\nJakékoli druhy darů za jakýchkoli okolností a jakýchkoli stránek, odkazů nebo příspěvků, které o dary žádají, jsou prostě falešné.\n\nPokud ale chcete podporovat vývojáře Vanced, můžete si stáhnout Brave pomocí [tohoto odkazu](https://brave.com/kev231) a AdGuard použitím [tohoto odkazu](https://adguard.com/en/welcome.html?aid=31141)."
    },
    {
      "title": "Jak zajistit, aby se ovládací prvky přehrávače automaticky skrývaly?",
      "description": "Můžete to nakonfigurovat v YouTube Vanced > Nastavení > Usnadnění přístupu. Pokud se nastavení neotevře nebo nefunguje, přejděte do nastavení přístupnosti zařízení a vypněte zesilovač zvuku, přepněte přístup, živé titulek."
    },
    {
      "title": "Proč používat split APKs?",
      "description": "Protože:\n\n1. Výchozí aplikace to používá, takže to používá i Vanced.\n2. Instaluje pouze jazyky, které určíte, abyste šetřili úložiště.\n3. Má jedinou verzi jádra APK, kterou vaše zařízení vyžaduje.\n\nSamozřejmě, že Vanced Manager nebo vývojáři to mohou převést na normální, jediný soubor APK, ale my jsme tak líní a nechce se nám. Musíte vyjít s tím, co máme...\n\nNebojte se, Vanced Manager za vás udělá veškerou tvrdou práci, stačí klepnout na tlačítko `Instalovat`."
    },
    {
      "title": "Proč se barva na úvodní obrazovce liší od motivu?",
      "description": "Barva pozadí úvodní obrazovky je převzata z barvy systému Android, aby se zajistilo, že se změní podle motivu systému. Ke změně barvy můžete použít motivy [Substratum](https://play.google.com/store/apps/details?id=projekt.substratum) nebo [Swift Installer](https://play.google.com/store/apps/details?id=com.brit.swiftinstaller)."
    },
    {
      "title": "Mám znovu stáhnout instalační soubory?",
      "description": "Soubory můžou být poškozeny z různých důvodů a můžou později způsobovat problémy. Chcete-li tomu zabránit, můžete se rozhodnout je znovu stáhnout, abyste zajistili bezproblémový průběh instalace."
    },
    {
      "title": "Proč verze root nemá oprávnění přístupu k mikrofonu?",
      "description": "Funguje, pokud je Vanced aktuální."
    },
    {
      "title": "Co je ExoPlayer v1?",
      "description": "Je to starší verze aktuálního přehrávače médií, který používá YouTube. Při jeho používání můžete získat lepší výkon a stabilitu."
    },
    {
      "title": "Jak povolím skrytá nastavení?",
      "description": "V nastavení Vanced klepněte na sekci „O aplikaci“ 6-7krát a povolte to. Tím se povolí pouze další nastavení video kodeku."
    },
    {
      "title": "Jak nastavit YouTube Vanced jako výchozí aplikaci?",
      "description": "Jak název napovídá, spousta uživatelů se mnohokrát ptá, jak můžou nastavit YouTube Vanced jako výchozí pro otevírání odkazů YouTubez jiných aplikací (jako jsou prohlížeče, aplikace pro zasílání zpráv a jakékoli jiné aplikace).\n \nUživatelé root verze se nemusejí obávat, protože ve výchozím nastavení je aplikace YouTube nahrazena aplikací YouTube Vanced. \n\nPro užívatele non-root verze byla řešení rozdělena mezi OneUI, MIUI a ostatní.  Nemůžeme poskytnout řešení pro každý operační systém, který je k dispozici, a budete si je možná muset vyhledat sami.",
      "fields": [
        {
          "title": "Uživatelé OneUI:",
          "content": "1. Stiskněte a přidržte ikonu YouTube nebo YouTube Vanced a otevřete informace o aplikaci.\n2. Přejděte dolů do sekce „Nastavení aplikace“\n3. Stiskněte možnost **Nastavit jako výchozí**\n4. Nastavte možnost \"**Přejít na nastavení podporovaných URL**\" na \"**V této aplikaci**\"."
        },
        {
          "title": "Uživatelé MIUI:",
          "content": "Otevřete Nastavení a vyhledejte \"Výchozí aplikace\" nebo přejděte do Aplikace > Správa aplikací > [stiskněte tři tečky v pravém rohu] > Výchozí aplikace > Otevírání odkazů. V seznamu aplikací najděte YouTube nebo YouTube Vanced a klepněte na ni. Pak nastavte nastavení \"**Otevírat podporované odkazy**\" jako \"**Otevírat**\" místo \"Vždy se dotázat\" nebo \"Neotevírat\"."
        },
        {
          "title": "Uživatelé AOSP a ostatních UI (OOS, ColorOS, EMUI, atd.):",
          "content": "1. Vyberte \"vždy se dotázat\" pro výchozí aplikaci YouTube i Vanced.\n\n2. Otevřete Google Chrome.\n\n3. Vyhledejte na Google nějaká YouTube videa.\n\n4. Otevřete odkazy pomocí aplikace YouTube Vanced a nastavte možnost \"vždy\".\n\n5. Vraťte se do nastavení, jde jste YouTube nastavili na \"vždy se dotázat\" a změňte to na \"neotevírat v této aplikaci\"."
        }
      ]
    },
    {
      "title": "V čem spočívá problém ohledně microG Core?",
      "description": "1. Abyste mohli spustit Vanced, musíte mít alespoň [pico](https://github.com/opengapps/opengapps/wiki/Pico-Package) variantu GApps\n\n2. Vanced s microG Core nelze spustit, protože potřebuje Google Play Services Framework, který je k dispozici ve všech balíčcích GApps.\n\n3. Pokud se obáváte o své soukromí a nechcete používat GApps, ale přesto chcete sledovat YouTube bez reklam, je vždy k dispozici [webová verze](https://youtube.com)."
    },
    {
      "title": "Proč nefunguje Vysílání?",
      "description": "Uživatelé verze 16.16.38 ve variantě bez root oprávnění se setkali s chybou nacházející se v microG, které je vyvíjeno nezávisle. Dokud nebude tato chyba opravena, vraťte se na některou z verzí v15 a počkejte prosím na aktualizaci. Uživatelé s oprávněním root nebudou mít s Vysíláním problémy, pokud používají Služby Google Play."
    },
    {
      "title": "Co je to podepisování APK?",
      "description": "Toto čtete, protože nepoužíváte Vanced Manager nebo jste nainstalovali Vanced z neoficiálního zdroje. \nStačí použít Vanced Manager!\n\nVanced Manager si můžete bezpečně stáhnout z těchto odkazů:\n- [Oficiální stránka](https://vancedapp.com) \n- [Repozitář GitHub](https://github.com/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Najdu YouTube Vanced v Obchodě Play?",
      "description": "NE!\nZnovu, NEINSTALUJTE ani se nepokoušejte hledat žádné falešné aplikace s názvem „YouTube Vanced“ nebo podobné v Obchodě Play nebo v žádných obchodech s aplikacemi.\n\nMáme pouze [Průvodce Vanced](https://play.google.com/store/apps/details?id=com.vanced.faq) a je to jediná oficiální aplikace publikovaná v Obchodu Play.\n\nPokud najdete jinou aplikaci s naší ikonou a jménem, nahlaste ji jako předstírání identity a zanechte negativní hodnocení.\n\nNaše aplikace najdete pouze na [oficiální stránce](https://vancedapp.com)."
    },
    {
      "title": "Proč se Vanced nezobrazuje na domovské obrazovce nebo v seznamu aplikací?",
      "description": "Toto čtete, protože nepoužíváte Vanced Manager nebo jste nainstalovali Vanced z neoficiálního zdroje. \nStačí použít Vanced Manager!\n\nVanced Manager si můžete bezpečně stáhnout z těchto odkazů:\n- Oficiální stránka <https://vancedapp.com> \n- [Repozitář GitHub](https://github.com/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Proč se videa nepřehrávají?",
      "description": "Zkuste restartovat aplikaci. Může to být také z důvodu Vašeho připojení k internetu nebo zařízení."
    },
    {
      "title": "Proč mám limit jen 480p?",
      "description": "Vzhledem k situaci kolem COVID-19, Google v určitých zemích omezuje využití dat. To se děje na serveru a ovlivňuje to jak uživatele Vanced, tak uživatele výchozí aplikace YouTube.",
      "fields": [
        {
          "title": "Dočasná řešení:",
          "content": "1. Připojte se k VPN jiného regionu.\n2. Použijte [webovou verzi](https://youtube.com)\n3. Vzhledem k tomu, že omezení 480p je pouze pro mobilní zařízení a ne pro tablety, můžete změnit model zařízení v aplikaci YouTube Vanced.\n\n#### Jak změnit model zařízení?\n1. Otevřete YouTube Vanced.\n2. Povolte další možnosti \n  1. Přejděte do Nastavení\n  2. Klepněte na Nastavení Vanced\n  3. Klepněte na sekci O aplikaci, dokud se neobjeví zpráva se zapnutím skrytých nastavení.\n3. Přejděte na Přepsat kodek a nastavte model na \"SM-T865\" a zařízení na \"Samsung\".\n4. Restartujte aplikaci a limit 480p by měl být pryč."
        }
      ]
    },
    {
      "title": "Jak skrýt oznámení microG?",
      "description": "Chcete-li oznámení microG skrýt, \n\n1. Můžete vypnout optimalizaci baterie pro Vanced microG a restartovat zařízení.\n\n2. Pokud výše uvedená metoda nefunguje, vypněte oznámení microG podržením oznámení, vypněte jej a klepněte na Uložit.\n\n>Vypnutí oznámení aplikace lze provést různými způsoby v závislosti na uživatelském rozhraní systému Android. Pokud nevíte, jak to vypnout, zkuste použít vyhledávání Google a řešení najít."
    },
    {
      "title": "Vypadá rozlišení 1440p lépe na mé obrazovce s rozlišením 1080p?",
      "description": "Ano, ale pouze v případě, že je video v poměru stran 18:9, 21:9, ... Můžete zapnout `Statistiky pro šprty` v Nastavení > Obecné a potvrdit to.\n\nChcete-li povolit vyšší rozlišení, přejděte do Nastavení Vanced > Nastavení videa a zapněte „Maximální rozlišení“, poté aplikaci restartujte."
    }
  ]
}
