{
  "data": [
    {
      "title": "Apa itu YouTube Vanced?",
      "description": "Youtube Vanced adalah versi YouTube yang di modifikasi dengan fitur agar pengalaman Youtube anda menjadi lebih baik!\n\nFitur seperti:\n- Pemutaran latar belakang,\n- Picture in Picture (PiP),\n- Tema hitam (OLED friendly),\n- Penghapusan iklan (membutuhkan pengaktifkan),\n- Menimpa maksimal resolusi (mengizinkan pemutaran video yang resolusinya lebih tinggi dari layar anda),\n-...dan banyak lagi!\n\nUntuk informasi lebih lanjut, kunjungi <https://vancedapp.com>"
    },
    {
      "title": "Dimanakah letak tombol Download?",
      "description": "Tentu saja, Google tidak akan membolehkan versi modifikasi yang merupakan aplikasinya sendiri untuk berada pada toko mereka, untuk itu jangan mencari Vanced di Google Play Store, semua itu merupakan aplikasi palsu.\n\nAplikasi Vanced bisa diunduh dan dipasang menggunakan Vanced Manager yang dimana dapat ditemukan pada situs resmi kami: <https://vancedapp.com> tetapi anda juga dapat mengambilnya dari [Github repo](https://github.com/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Apakah YouTube Vanced dapat memperbarui secara otomatis?",
      "description": "Tidak, tidak bisa.\n\nVanced Manager akan mengirimkan anda notifikasi ketika tersedia pembaruan.\n\nAnda juga dapat bergabung [Server Discord] kami(https://discord.gg/wYrRPgv) atau ikuti [channel Telegram](https://t.me/Vanced) untuk berita terbaru dan pemberitahuan pembaruan."
    },
    {
      "title": "Dapatkah Vanced mengunduh video?",
      "description": "Vanced tidak memiliki fitur pengunduhan video apapun dan tidak akan pernah.\n\nKebanyakan video tersedia untuk diunduh secara gratis pada [negara terpilih] (https://support.google.com/youtube/answer/6141269). Untuk selainnya, mohon gunakan YouTube Premium atau gunakan pengunduh pihak ketiga.\n\nSekali lagi, Vanced TIDAK AKAN menambahkan pengunduh video pada aplikasi atau serupa.\n\nHal ini merupakan alasan banyak modifikasi YouTube yang ditutup di masa lalu dikarenakan Google tidak menyukai orang mengunduh konten hak cipta dari platform mereka maka jangan tanyakan hal ini!!!"
    },
    {
      "title": "Mengapa swipe gesture tidak dapat bekerja?",
      "description": "Apabila anda memiliki komentar yang ditampilkan di bawah (tempat lama) di pengaturan Vanced > Pengaturan Tampilan, nonaktifkan hal tersebut dan mulai ulang aplikasinya. Apabila tetap tidak bekerja, paksa berhenti aplikasi dan hapus datanya."
    },
    {
      "title": "Teks tidak tersedia?",
      "description": "Hal ini bukan masalah yang berkaitan dengan Vanced ataupun YouTube. Tidak semua video memiliki teks."
    },
    {
      "title": "Apakah anda menerima donasi?",
      "description": "Kami TIDAK menerima donasi! \n\nBentuk donasi apapun dalam keadaan apapun dan situs, link, atau postingan apapun yang meminta donasi merupakan palsu.\n\nTetapi apabila anda ingin mendukung developer Vanced, anda dapat mengunduh Brave menggunakan [tautan ini](https://brave.com/kev231) dan AdGuard menggunakan [tautan ini](https://adguard.com/en/welcome.html?aid=31141)."
    },
    {
      "title": "Bagaimana cara membuat tampilan pemutar otomatis disembunyikan?",
      "description": "Anda dapat mengatur hal tersebut di Pengaturan Youtube Vanced > Aksesibilitas. Apabila pengaturan gagal untuk terbuka atau tidak bekerja, pergi ke pengaturan aksesibilitas perangkat anda dan nonaktifkan sound amplifier, switch access, live caption."
    },
    {
      "title": "Mengapa menggunakan split APKs?",
      "description": "Dikarenakan:\n\n1. Aplikasi bawaan menggunakan hal yang sama sehingga Vanced menggunakannya juga.\n2. Hanya memasang bahasa yang anda tentukan untuk mengurangi konsumsi penyimpanan.\n3. Memiliki satu-satunya versi core APK yang perangkat anda butuhkan.\n\nTentu saja, Vanced Manager atau para developer bisa mengkonversi split APK ke satu file APK biasa, akan tetapi kami sangat malas melakukannya. Anda hanya perlu untuk beradaptasi dengan apa yang kami miliki...\n\nTetapi jangan khawatir, Vanced Manager melakukan semuanya untuk anda sehingga anda hanya butuh menekan tombol `Pasang`."
    },
    {
      "title": "Mengapa warna yang ada di layar startup berbeda dari tema?",
      "description": "Warna latar belakang layar splash sekarang diambil dari warna Android framework untuk memastikan hal itu berubah sesuai dengan tema sistem. Anda dapat menggunakan tema Substratum/Swift untuk mengubah warnanya."
    },
    {
      "title": "Apakah saya harus mengunduh ulang file pemasangan?",
      "description": "File dapat rusak dikarenakan beberapa alasan dan dapat menyebabkan masalah. Untuk mencegah hal ini, anda bisa memilih untuk mengunduh kembali agar pemasangan anda berjalan lancar."
    },
    {
      "title": "Mengapa versi root tidak memiliki izin mikropon?",
      "description": "Vanced mempunyai izin mikropon apabila Vanced anda merupakan versi terbaru."
    },
    {
      "title": "Apa itu ExoPlayer v1?",
      "description": "ExoPlayer v1 merupakan versi lama pemutar media yang digunakan oleh YouTube. Anda mungkin mendapatkan performa dan stabilitas yang lebih baik ketika menggunakannya."
    },
    {
      "title": "Bagaimana cara mengaktifkan pengaturan tersembunyi?",
      "description": "Pada pengaturan Vanced, tekan pada bagian `Tentang` 6-7 kali untuk mengaktifkannya. Pengaturan ini hanya mengaktifkan pengaturan tambahan kodek video."
    },
    {
      "title": "Bagaimana cara untuk membuat YouTube Vanced menjadi aplikasi default?",
      "description": "Seperti yang terbaca di judul, banyak pengguna yang sudah seringkali menanyakan bagaimana cara mereka untuk membuat YouTube Vanced menjadi aplikasi default untuk membuka tautan YouTube dari aplikasi lain(seperti browser, aplikasi pesan dan aplikasi lain)\n\nUntuk root, anda tidak perlu khawatir tentang masalah ini karena sudah diatur menjadi default sejak YouTube terganti oleh YouTube Vanced.\n\nUntuk non-root, solusinya berbeda antara OneUI, MIUI, dan seterusnya. Kami tidak bisa memberikan semua solusi untuk setiap OS yang tersedia, dan anda mungkin perlu mencari sendiri di Google.",
      "fields": [
        {
          "title": "Pengguna OneUI:",
          "content": "1. Tap and hold down on YouTube or YouTube Vanced app icon\n2. Tap on **App info**.\n3. Find \"**Set as default**\" and tap it\n4. Tap \"**Open supported links**\" and choose \"**Open in this app**\"\n\nIn older versions of OneUI, the name of the options in the 4th step might be slightly difference. You may need to tap \"**Go to supported URLs**\" and choose \"**In this app**\" option."
        },
        {
          "title": "MIUI users:",
          "content": "1. Open Settings\n2. Got to **Apps**,\n3. **Manage apps**,\n4. Then, tap the three dots at the right corner,\n5. **Default apps**,\n6. **Opening links**.\n7. Wait until all your apps gets listed…\n8. Find YouTube or YouTube Vanced and tap it.\n9. Tap \"**Open supported links**\" and choose \"**Open**\""
        },
        {
          "title": "AOSP & other custom UIs (OOS, ColorOS, EMUI, etc.):",
          "content": "1. Open **Settings**\n2. Go to **Apps**\n3. Tap **Default apps**\n4. Find **YouTube** or **YouTube Vanced**\n5. Tap \"**Go to Supported URLs**\" and choose \"**Open in this app**\" option\n\nIf you're still troubling with this, you may need to search some \"how to\" articles/videos on [Google](https://www.google.com/search?q=%22android%22+how+to+open+youtube+links+with+youtube) or you can install a 3rd party app from [Play Store](https://play.google.com/store/search?q=open%20with) to save you from this hassle…"
        }
      ]
    },
    {
      "title": "Why the root variant doesn't work with microG Core?",
      "description": "1. You need to have at least the [pico](https://github.com/opengapps/opengapps/wiki/Pico-Package) variant of GApps to run Vanced.\n\n2. You can’t run Vanced with microG Core without Google Play Services Framework which is available in all GApps packages and it's a required library.\n\n3. If you are worried about your privacy & don’t want to use GApps but still want to use watch YouTube without ads, then the [web version](https://youtube.com) is always available."
    },
    {
      "title": "Why casting doesn't work?",
      "description": "For users with latest v16.16.38 non-root variant, there's a bug in upstream microG. Until that resolves, please wait for updates or roll back to v15 versions. Root users will no issues with casting if they are using Google Play Services."
    },
    {
      "title": "What is APK Signing?",
      "description": "You are reading this because you are not using Vanced Manager or you may have installed Vanced from an unofficial source.\nJust use Vanced Manager!\n\nYou can safely download Vanced Manager from:\n- [Official site](https://vancedapp.com)\n- [GitHub repository](https://github.com/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Is YouTube Vanced on Play Store?",
      "description": "NO!\nAgain, DO NOT install or even try to search for any fake apps named \"YouTube Vanced\" or similar on the Play Store or any app stores to install Vanced.\n\nWe only have [Vanced Guide](https://play.google.com/store/apps/details?id=com.vanced.faq), and it's the only official app published on Play Store.\n\nIf you find any other app with our icon and name, report it as impersonation and give it a bad review.\n\nOur apps can only be found at [official site](https://vancedapp.com)."
    },
    {
      "title": "Why is Vanced not showing up in home screen or app drawer?",
      "description": "You are reading this because you are not using Vanced Manager or you may have installed Vanced from an unofficial source.\nJust use Vanced Manager!\n\nYou can safely download Vanced Manager from:\n- Official site <https://vancedapp.com>\n- [GitHub repository](https://github.com/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Why aren't videos playing?",
      "description": "Try restarting the app. It might also because of your internet connection or your device."
    },
    {
      "title": "Why am I having the 480p limit?",
      "description": "Due to the COVID-19, Google is restricting data usage of several countries. This happens on the server and affects both Vanced and stock YouTube users.",
      "fields": [
        {
          "title": "Workarounds:",
          "content": "1. Connect to a VPN of a different region.\n2. Use the [web version](https://youtube.com)\n3. Since the 480p restriction is only for phones and not tablets, you can change the device model in YouTube Vanced to overcome the restriction.\n\n#### How to change the device model?\n1. Open YouTube Vanced.\n2. Go to Settings\n3. Tap the `Vanced Settings`\n4. Enable hidden settings:\n  - Scroll down and tap on the `About` section till you get a message saying `Hidden settings enabled`.\n5. Go to `Codec override`\n6. Set manufacturer to `Samsung` and model to `SM-T865`.\n7. Restart the app.\n\nAfter restarting, the 480p limit should be gone."
        }
      ]
    },
    {
      "title": "How to hide the microG notification?",
      "description": "To hide microG the notification,\n\n1. You can disable battery optimization for Vanced microG and reboot your device.\n\n2. If the above method doesn't work, disable microG notifications by holding on to the notification, toggle it off and tap Save.\n\n>Disabling app notifications can be done in different ways depending on the Android user interface. If you don't know how to disable it, try using Google for learning how to disable it."
    },
    {
      "title": "Does 1440p look better on my 1080p screen?",
      "description": "Yes, but only if the video ratio is something like 18:9, 21:9, ... You can enable `Stats for nerds` in Settings > General to confirm it.\n\nTo enable higher resolutions, go to Vanced settings > Video settings and turn on `Max resolution` then restart the app."
    }
  ]
}
