{
  "data": [
    {
      "title": "Što je YouTube Vanced?",
      "description": "YouTube Vanced modificirana je YouTube verzija sa značajkama i poboljšanjima kako bi vaše YouTube iskustvo bilo bolje!\n\nTakve značajke uključuju:\n- reprodukciju u pozadini,\n- sliku u slici (PiP),\n- crnu temu (OLED),\n- uklanjanje oglasa (potrebno je omogućiti),\n- nadjačavanje maksimalne rezolucije (omogućite reprodukciju videozapisa s rezolucijom većom od vašeg zaslona),\n- ...i mnogo više!\n\nZa više informacija, posjetite <https://vancedapp.com>"
    },
    {
      "title": "Gdje je tipka za preuzimanje?",
      "description": "Of course, Google won't allow a modified version of its own app to be on their store so don't look for it on the Google Play Store, those are just fake apps.\n\nVanced apps can be downloaded and installed using Vanced Manager which can be found on our official website: <https://vancedapp.com> but you can also grab it from [GitHub repo](https://github.com/YTVanced/VancedManager/releases/latest)."
    },
    {
      "title": "Hoće li se YouTube Vanced automatski ažurirati?",
      "description": "Ne, neće.\n\nVanced Manager će vam poslati obavijest kad bude dostupno ažuriranje.\n\nTakođer se možete pridružiti našem[Discord Server](https://discord.gg/wYrRPgv) ili zapratite [Telegram channel](https://t.me/Vanced) za najnovije vijesti i obavijesti o ažuriranjima."
    },
    {
      "title": "Može li Vanced preuzeti videozapise?",
      "description": "Vanced ne uključuje nijednu značajku za preuzimanje videozapisa i nikada to neće biti dostupno.\n\nMnogi su videozapisi dostupni za besplatno preuzimanje u [selected countries](https://support.google.com/youtube/answer/6141269). Za ostatak svijeta nabavite YouTube Premium ili upotrijebite program za preuzimanje treće strane.\n\nOpet, Vanced NIKADA NEĆE dodati video downloader u aplikaciju ili bilo što slično.\n\nTo je bio razlog gašenja mnogih YouTube modova u prošlosti, jer Google ne voli ljude koji sa svoje platforme preuzimaju zaštićeni autorski sadržaj, pa nemojte to niti vi tražiti!!!"
    },
    {
      "title": "Zašto geste ne rade?",
      "description": "Ako su komentari prikazani na dnu (staro mjesto) u postavkama Vanced > Postavke izgleda, onemogućite ih i ponovo pokrenite aplikaciju. Ako to ne uspije, prisilno zaustavite aplikaciju i izbrišite podatke."
    },
    {
      "title": "Podnaslovi nisu dostupni?",
      "description": "To nije problem. Nemaju svi videozapisi podnaslove."
    },
    {
      "title": "Primate li donacije?",
      "description": "Ne PRIHVAĆAMO donacije!\n\nBilo kakve donacije pod bilo kojim okolnostima i bilo koje web stranice ili podveznice ili postovi koji traže donacije jednostavno su lažni.\n\nAli ako želite podržati Vanced programere, možete preuzeti Brave ovdje [this link](https://brave.com/kev231) i AdGuard pomoću [this link](https://adguard.com/en/welcome.html?aid=31141)."
    },
    {
      "title": "Kako napraviti da se izgled playera automatski sakrije?",
      "description": "Možete ga konfigurirati u YouTube Vanced postavke > Pristupačnost. Ako se postavke ne otvore ili ne rade, idite na postavke pristupačnosti uređaja i onemogućite pojačalo zvuka, prebacite pristup i podnaslove uživo."
    },
    {
      "title": "Zašto koristiti podijeljene APK-ove?",
      "description": "Budući da:\n\n1. Koristi je zadana aplikacija pa je koristi i Vanced.\n2. Instalira samo jezike koje navedete kako bi se smanjila potrošnja pohrane.\n3. Ima jedinu verziju osnovnog APK-a koju vaš uređaj zahtijeva.\n\nNaravno, Vanced Manager ili programeri mogu ga pretvoriti u normalnu, jednu APK datoteku, ali toliko smo lijeni da to učinimo. Samo se trebaš složiti s onim što imamo...\n\nNe brinite se, Vanced Manager za vas obavlja sav naporan posao, pa samo dodirnite tipku `Instaliraj`."
    },
    {
      "title": "Zašto se boja na početnom zaslonu razlikuje od teme?",
      "description": "Boja pozadine početnog zaslona preuzeta je iz Androidove framework boje kako bi se osiguralo da se mijenja u skladu s temom sustava. Za promjenu boje možete koristiti teme Substratum/Swift."
    },
    {
      "title": "Trebam li ponovno preuzeti instalacijske datoteke?",
      "description": "Datoteke mogu biti oštećene iz različitih razloga, a kasnije mogu uzrokovati probleme. Da biste to izbjegli, možete ih ponovno preuzeti kako biste osigurali nesmetanu instalaciju."
    },
    {
      "title": "Zašto root verzija nema dopuštenje za mikrofon?",
      "description": "Ima ako je vaš Vanced ažuran."
    },
    {
      "title": "Što je ExoPlayer v1?",
      "description": "To je starija verzija trenutnog medijskog reproduktora kojeg koristi YouTube. Možda ćete dobiti bolje performanse i stabilnost kada ga koristite."
    },
    {
      "title": "Kako omogućiti skrivene postavke?",
      "description": "U Vanced postavkama, dodirnite odjeljak \"O aplikaciji\" 6-7 puta da biste ih omogućili. To omogućuje samo dodatne postavke video kodeka."
    },
    {
      "title": "Kako učiniti Youtube Vanced zadanom aplikacijom?",
      "description": "As the title says, a lot of users have been asking many times how they can make YouTube Vanced as default for opening YouTube links from other apps(like browsers, messaging apps and any other app).\n\nFor root, you don't need to worry about because it is already set by default since YouTube Vanced gets replaced with Stock YouTube.\n\nFor non-root, solutions has been divided between as OneUI, MIUI and the rest.  We can't provide solutions for every OS out there, and you may need to Google it by yourself.",
      "fields": [
        {
          "title": "OneUI korisnici:",
          "content": "1. Tap and hold down on YouTube or YouTube Vanced app icon from your app drawer.\n2. Tap **App info**.\n3. Find \"**Set as default**\" and tap it\n4. Tap \"**Open supported links**\" and choose \"**Open in this app**\"\n\nIn older versions of OneUI, the name of the options in the 4th step might be slightly different. You may need to tap \"**Go to supported URLs**\" and choose \"**In this app**\" option.\nIn the very older version of OneUI 💩, you may need to go to **Settings** > **Apps** > *[tap three dots at the right corner]* > **Default apps** > **Set as default**. After apps loaded Find YouTube Vanced or YouTube and follow the 4th step..."
        },
        {
          "title": "MIUI korisnici:",
          "content": "1. Open Settings\n2. Go to **Apps**,\n3. **Manage apps**,\n4. Then, tap the three dots at the right corner,\n5. **Default apps**,\n6. **Opening links**.\n7. Wait until all your apps gets listed…\n8. Find YouTube or YouTube Vanced and tap it.\n9. Tap \"**Open supported links**\" and choose \"**Open**\""
        },
        {
          "title": "AOSP & other custom UIs (OOS, ColorOS, EMUI, etc.):",
          "content": "1. Open **Settings**\n2. Go to **Apps**\n3. Tap **Default apps**\n4. Find **YouTube** or **YouTube Vanced**\n5. Tap \"**Go to Supported URLs**\" and choose \"**Open in this app**\" option\n\nIf you're still troubling with this, you may need to search some \"how to\" articles/videos on [Google](https://www.google.com/search?q=%22android%22+how+to+open+youtube+links+with+youtube) or you can install a 3rd party app from [Play Store](https://play.google.com/store/search?q=open%20with) to save you from this hassle…"
        }
      ]
    },
    {
      "title": "Why the root variant doesn't work with microG Core?",
      "description": "1. You need to have at least the [pico](https://github.com/opengapps/opengapps/wiki/Pico-Package) variant of GApps to run Vanced.\n\n2. You can’t run Vanced with microG Core without Google Play Services Framework which is available in all GApps packages and it's a required library.\n\n3. If you are worried about your privacy & don’t want to use GApps but still want to use watch YouTube without ads, then the [web version](https://youtube.com) is always available."
    },
    {
      "title": "Why casting doesn't work?",
      "description": "For users with latest v16.16.38 non-root variant, there's a bug in upstream microG. Until that resolves, please wait for updates or roll back to v15 versions. Root users will no issues with casting if they are using Google Play Services."
    },
    {
      "title": "What is APK Signing?",
      "description": "You are reading this because you are not using Vanced Manager or you may have installed Vanced from an unofficial source.\nJust use Vanced Manager!\n\nYou can safely download Vanced Manager from:\n- [Official site](https://vancedapp.com)\n- [GitHub repository](https://github.com/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Is YouTube Vanced on Play Store?",
      "description": "NO!\nAgain, DO NOT install or even try to search for any fake apps named \"YouTube Vanced\" or similar on the Play Store or any app stores to install Vanced.\n\nWe only have [Vanced Guide](https://play.google.com/store/apps/details?id=com.vanced.faq), and it's the only official app published on Play Store.\n\nIf you find any other app with our icon and name, report it as impersonation and give it a bad review.\n\nOur apps can only be found at [official site](https://vancedapp.com)."
    },
    {
      "title": "Why is Vanced not showing up in home screen or app drawer?",
      "description": "You are reading this because you are not using Vanced Manager or you may have installed Vanced from an unofficial source.\nJust use Vanced Manager!\n\nYou can safely download Vanced Manager from:\n- Official site <https://vancedapp.com>\n- [GitHub repository](https://github.com/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Why aren't videos playing?",
      "description": "Try restarting the app. It might also because of your internet connection or your device."
    },
    {
      "title": "Why am I having the 480p limit?",
      "description": "Due to the COVID-19, Google is restricting data usage of several countries. This happens on the server and affects both Vanced and stock YouTube users.",
      "fields": [
        {
          "title": "Workarounds:",
          "content": "1. Connect to a VPN of a different region.\n2. Use the [web version](https://youtube.com)\n3. Since the 480p restriction is only for phones and not tablets, you can change the device model in YouTube Vanced to overcome the restriction.\n\n#### How to change the device model?\n1. Open YouTube Vanced.\n2. Go to Settings\n3. Tap the `Vanced Settings`\n4. Enable hidden settings:\n  - Scroll down and tap on the `About` section till you get a message saying `Hidden settings enabled`.\n5. Go to `Codec override`\n6. Set manufacturer to `Samsung` and model to `SM-T865`.\n7. Restart the app.\n\nAfter restarting, the 480p limit should be gone."
        }
      ]
    },
    {
      "title": "How to hide the microG notification?",
      "description": "To hide microG the notification,\n\n1. You can disable battery optimization for Vanced microG and reboot your device.\n\n2. If the above method doesn't work, disable microG notifications by holding on to the notification, toggle it off and tap Save.\n\n> Disabling app notifications can be done in different ways depending on the Android user interface. If you don't know how to disable it, try using Google for learning how to disable it."
    },
    {
      "title": "Does 1440p look better on my 1080p screen?",
      "description": "Yes, but only if the video ratio is something like 18:9, 21:9, ... You can enable `Stats for nerds` in Settings > General to confirm it.\n\nTo enable higher resolutions, go to Vanced settings > Video settings and turn on `Max resolution` then restart the app."
    }
  ]
}
