{
  "data": [
    {
      "title": "Vanced",
      "description": "YouTube Vanced želi biti bolje izdanje YouTubea. Uključuje blokranje oglasa, crnu temu i još mnogo toga. Koristite Vanced Upravitelja kako biste relativno lako instalirali YouTube Vanced."
    },
    {
      "title": "Vanced Music",
      "description": "YouTube Vanced Glazba ima isti cilj kao i YouTube Vanced, ali ova je aplikacija fokusirana na YouTube Glazbu. Relativno je manje bogata značajkama u usporedbi s Vancedom, ali svejedno sadrži mnoge stvari koje bi očekivali, poput blokiranja oglasa i reprodukcije u pozadini, sve unutar Youtube Glazbe!"
    },
    {
      "title": "YouTube Vanced glavne značajke",
      "description": "- OLED prijateljska crna tema _(poznata kao i tamno siva)_ dostupna uz bijelu temu.\n- Blokiranje svih oglasa\n- Omogućuje reprodukciju videozapisa u pozadini ili u načinu Slika u Slici (PiP) (samo za Androidu 8+)\n- Upravljanje povlačenjima omogućuju vam upravljanje svjetlinom i glasnoćom zvuka pokretima gore-dolje (s podesivim popunjavanjem).\n- Značajka automatskog ponavljanja koja vam omogućuje ponavljanje videozapisa.\n- Novi izgled mini-reporduktora za komentare/tablete može se prebaciti na izdanja tableta koja su vrlo slična starom izdanju (ipak, s malo problema)."
    },
    {
      "title": "Prilagodba",
      "description": "- Omogućuje vam zaobilaženje mogućnosti kôdeka, poput prisiljavanja H264 za stare uređaje ili VP9, to vam također omogućuje prisilno reproduciranje HDR-a ili isključivanje 60 sličica u sekundi ako više želite kinematografsko iskustvo. (Prilagođena podešavanja uređaja za ove značajke možete pronaći na našem [Discord poslužitelju](https://discord.gg/Vanced) ili XDA forumu)\n- Prisiljavanje zadane razlučivosti videozapisa na visoku ili nisku, pa čak i zaobilaženje razlučivosti zaslona za tu oštru 4K reprodukciju na bilo kojem uređaju. Omogućuje vam još i promjenu zadane brzine reprodukcije na vrijednost između 0,25x i 2x (pod pretpostavkom da je vaš uređaj dovoljno snažan).\n- Omogućuje vam uklj/isklj oglasa početne stranice, većinu oglasa korisničkog sučelja, oglasa proizvoda, objava zajednice, prodaju filmova, informacija zbijenog natpisa (poput COVID-19 informacija), potpuno uklanjanje komentara, zbijenog pregleda filma, uklanjanja polica s filmovima i još mnogo toga!"
    },
    {
      "title": "Sponzorski blok",
      "description": "- Sadrži mogućnost preskakanja ulomka sponzora (gdje [YouTuber](https://en.wikipedia.org/wiki/YouTuber) oglašava uslugu ili proizvod usred videozapisa)\n- Podržava i preskakanje drugih kategorija, poput uvoda, završnog kadra i samopromocija.\n- Koristi API [pronađen ovdje](https://sponsor.ajay.app). Možete pronaći više informacija o tome kako radi\n- Omogućuje vam i slanje vlastitih ulomka u API i vaš doprinos široj zajednici\n- Potpuna kontrola oko automatskog preskakanje kategorija ulomka ili prikazivanja tipke preskakanja, ili jednostavno ne preskočite ništa.\n- Naglašava ulomak u određenoj boji temeljenoj na njegovoj kategoriji na vremenskoj traci reprodukcije."
    },
    {
      "title": "Platforme",
      "description": "Aplikacija su dostupne samo na Android uređajima i trenutno nije u planu podrška bilo koje druge platforme"
    },
    {
      "title": "Razlika između Root i Non-Root",
      "description": "- Root:\nRoot verzija Vanceda neprimjetno zamjenjuje službenu aplikaciju YouTube. Kao rezultat toga, možete izravno otvoriti YouTube poveznice ili ih nazvati pomoću Google asistenta putem modificirane Vanced aplikacije.\n- Non-Root:\n- Ako imate uređaj koji je teško Root-ati ili to ne želite, trebali biste se odlučiti za inačicu koja nije Root.\n- Može se instalirati i na Non-Root uređaj. Budući da se naziv paketa Non-Root verzije razlikuje od standardne YouTube aplikacije, one mogu postojati istovremeno. Imajte na umu da morate instalirati dodatnu popratnu aplikaciju (Vanced microG) da biste se mogli prijaviti sa svojim YouTube Google računom.\n- Štoviše, morate ručno postaviti Vanced kao zadanu aplikaciju za otvaranje YouTube poveznica.\n- Međutim, s Non-Root verzijom jednostavno je lakše živjeti, pa vam preporučujemo da se pridržavate Non-Root verzije, osim ako zaista ne želite zamijeniti osnovnu YouTube aplikaciju na telefonu."
    }
  ]
}
