{
  "data": [
    {
      "title": "Vanced란",
      "description": "YouTube Vanced는 YouTube를 더욱 잘 쓸 수 있도록 기능과 개선점을 추가하여 개조한 버전입니다!\n\n아래와 같은 기능들을 쓸 수 있습니다.\n\n백그라운드 재생\n사용자 지정 테마(기존 어두운 테마 혹은 OLED 검정 테마)\n광고 차단\n동영상 품질 제한 무시 등!\n모든 기능들을 보려면, XDA 게시글의 \"features\" 부분(https://forum.xda-developers.com/android/apps-games/app-youtube-vanced-edition-t3758757)을 읽어 보세요. 모든 기능 목록이나 기타 일반적인 정보를 확인하실 수 있습니다."
    },
    {
      "title": "다운로드 링크",
      "description": "Of course, Google won't allow a modified version of its own app to be on their store so don't look for it on the Google Play Store, those are just fake apps.\n\nVanced apps can be downloaded and installed using Vanced Manager which can be found on our official website: <https://vancedapp.com> but you can also grab it from [GitHub repo](https://github.com/YTVanced/VancedManager/releases/latest)."
    },
    {
      "title": "앱이 자동으로 업데이트되나요?",
      "description": "아니요. 업데이트가 나왔을 때 이를 알려주는 디스코드 및 텔레그램 서버나 Vanced Manager를 이용하세요. 향후에도 앱에 자동 업데이트나 업데이트 자동 확인 기능을 넣을 계획은 없습니다.\n링크\n디스코드: https://discord.gg/wYrRPgv\n텔레그램: https://t.me/Vanced"
    },
    {
      "title": "동영상 내려받기",
      "description": "동영상을 내려받는 기능은 이(https://support.google.com/youtube/answer/6141269) 국가에서만 무료로 제공됩니다. YouTube Premium으로만 볼 수 있는 동영상은 내려받을 수 없으므로 동영상을 내려받고자 할 때 YT Premium 결제 문구가 뜨면 YouTube PREMIUM을 결제하시길 바랍니다.\n\n\"VANCED는 YOUTUBE PREMIUM이 아님\"을 알아두시길 바랍니다.\n\n⚠️⚠️앞으로도 Vanced 앱에 동영상 내려받기 기능을 넣는 일은 절대로 없을 것입니다.⚠️ 개발자가 이를 유지보수하기 힘들 뿐 아니라, Google에서 Vanced 개발을 중단시킬 한 가지 이유가 더 생기기 때문입니다.\n아무도 그런 건 원하지 않으므로, Vanced 앱 내에서 YouTube나 다른 곳의 동영상을 내려받는 기능은 절대 지원하지 않을 겁니다. 개발자에게 다운로드 기능을 추가할 수 있는지 묻지 말아주세요. Vanced 앱에서 동영상을 내려받을 수 없으면 YouTube Premium을 결제하세요.⚠️"
    },
    {
      "title": "스와이프 제스처 문제",
      "description": "만약 YouTube 설정 > Vanced 설정 > 레이아웃 설정에서 댓글 위치 설정을 \"이전 위치\"로 설정했다면 이를 끄고 앱을 재시작하십시오. 그래도 문제가 있다면 앱 데이터와 캐시를 지우고 다시 시도해보세요. 그래도 문제가 여전히 있다면 Github 저장소로 문제를 보고하시기 바랍니다. 새 이슈를 만들기 전, 이전에 보고된 이슈를 우선 확인하십시오."
    },
    {
      "title": "자막 사용 불가",
      "description": "자막을 사용할 수 없거나 정보 버튼이 없는 등의 다양한 문제에 대해서는 아래 사항을 참고하십시오.\n모든 동영상에 자막, 정보 버튼 등이 있는 것은 아니며 이는 Vanced의 버그가 아닙니다. 신고 전 공식 유튜브 앱 및 데스크톱 사이트(www.youtube.com)에서 관련 이슈가 있는지 확인하시기 바랍니다.\n\n이 현상은 동영상 업로더가 자막이나 정보 버튼에 표시할 정보를 제공하지 않는 경우 발생하며 Vanced는 이것과 아무 관련이 없습니다.\n\n요약: YouTube Vanced 문제가 아닙니다. 모든 동영상에 문제가 있는 것은 아니므로 보고하기 전에 공식 YouTube 앱 또는 데스크톱 사이트에서 이 현상이 이슈로 보고될 만한 사안인지 확인하시기 바랍니다."
    },
    {
      "title": "기부",
      "description": "어떤 상황에서도 어떤 종류의 재정적 지원이든 받지 않습니다. 어떤 링크나 사이트에 \"Vanced에 기부하기\"와 같은 식의 문구가 적혀 있다면 절대 사실이 아닙니다.\n\n하지만 만약 Vanced 개발자를 지원하고 싶다면, 아래의 Brave 초대 코드를 이용하시기 바랍니다.\n\nhttps://brave.com/kev231"
    },
    {
      "title": "접근성 숨김 버튼",
      "description": "접근성 플레이어를 바꾸려면 자체 내장된 접근성 설정을 이용하시기 바랍니다. \"YouTube Vanced\" 앱에서 설정을 연 다음 '접근성'을 누릅니다. 그럼 위 사진처럼 설정이 열릴 겁니다.\n여전히 설정을 찾을 수 없으면, 기기 설정 > 접근성에서 \"접근성 메뉴\"를 찾은 다음 설정을 끄십시오.\n그래도 여전히 문제가 있다면, 소리 증폭, 스위치 제어, 실시간 자막이 켜져 있는지 확인하고 켜져 있는 경우 꺼보세요."
    },
    {
      "title": "왜 앱을 분할해서 배포하나요?",
      "description": "시작하기 앞서:\n\n1. 분할 앱이란?\n기본 APK, 기기 아키텍처를 위한 구성 APK, 언어 APK가 들어 있는 ZIP 파일입니다.\n\n예를 들어 보통, 일반 APK에는 32비트 및 64비트 아키텍처 지원 파일, 많은 언어 파일, 기본 APK 파일이 들어 있습니다. 따라서 장치가 32비트로 구동되고 영어 언어 파일만 원하는 경우 저장 공간을 많이 차지하는 불필요한 추가 파일도 받은 셈이 됩니다.\n\n**장점:**\n• 분할 APK 파일의 크기는 일반 APK 파일 크기의 절반 정도임\n• 분할 APK에는 기기와 아키텍처에 관련한 파일만 들어 있음\n\n**단점:**\n익숙하지 않은 사람이나 기술에 친숙하지 않은 사람에게는 어렵게 다가올 수 있음\n\n2. 왜 분할을 하는 건가요?\nGoogle에서는 버전 14.54 이후로 YouTube APK를 분할 APK로만 제공합니다, 이에 따라 Vanced를 설치할 때는, SAI(Split APK Installer)를 사용해야 합니다.\n이전에는 어떤 기기에서든 앱을 깔기 쉽도록 일반 APK를 배포했었습니다.\n\n3. 왜 개발진 측에서 분할 APK를 단일 APK로 합쳐 배포하지 않는 건가요?\n할 수 없지는 않으나 합쳐 배포하는 경우 개인적인 일이나 Vanced 버그 수정 및 업데이트에 쓸 수 있는 시간이 더 소요되게 됩니다. 그러니 단일 APK를 얻을 수 있는 방법을 질문하지 말아 주십시오. 자신이 정말 게으르거나 Play Store에서 YouTube 공식 앱을 사용하고자 하는 경우 이전 버전을 사용하십시오."
    },
    {
      "title": "앱 스플래시 색상",
      "description": "이제 스플래시 화면 배경색은 안드로이드 프레임워크 색상(안드로이드 시스템)에서 가져와서 Vanced/Youtube가 시스템 테마에 따라 스플래시 색상을 변경하도록 구현됩니다. 안드로이드 프레임워크 색상이 무엇이든 이와 동일한 색상이 Vanced에 표시됩니다.\n\n테마 색상을 바꾸려면 Substratum/Swift themes를 쓸 수 있습니다."
    },
    {
      "title": "왜 다운로드를 다시 하나요?",
      "description": "그 이유는 아주 간단합니다. 내려받은 파일이 손상된 채로 해당 파일을 가져와 설치하려고 하면 무수한 실패의 연속이 이어질 겁니다. 이를 방지하기 위해 Manager는 사용자가 버튼을 누를 때마다 파일을 다시 다운로드합니다.\n\n그러나 이제 비루트 설치 프로그램으로는 이미 내려받은 파일을 이용해 Vanced를 재설치할 수 있습니다."
    },
    {
      "title": "마이크",
      "description": "왜 Vanced 루트 버전에는 마이크 권한이 없는지 궁금하시다면, Vanced를 만드는 데 쓰이는 APK(minAPI17)에는 마이크 권한이 누락되어 있기 때문입니다. 다른 APK(minAPI21)에는 마이크 권한이 있지만 번역이 누락되어 있습니다. 왜냐고요? Google한테 물어보세요 🤷‍♂️\n\n차선책: 비루트 버전을 쓰거나, 기본 YouTube 앱을 사용하세요.\n\n참고: 이 문제는 버전 14 이하에서만 나타납니다. 버전 15 이후로부터는 권한 문제가 해결되었습니다."
    },
    {
      "title": "Exoplayer",
      "description": "1. Exoplayer란?\nExoPlayer는 안드로이드용 앱 수준 미디어 재생기입니다. 로컬 및 인터넷을 통해 오디오 및 비디오를 재생하기 위한 안드로이드 MediaPlayer API의 대안이기도 합니다. ExoPlayer는 DASH 및 SmoothStreaming 적응형 재생 등 안드로이드 MediaPlayer API에서 현재 지원하지 않는 기능을 지원합니다. MediaPlayer API와 달리 ExoPlayer는 쉽게 사용자 정의하고 확장할 수 있으며 Play Store 애플리케이션 업데이트를 통해 업데이트할 수 있습니다.\n\n2. V1과 V2의 차이점?\nV1:\n\n  > 저사양 기기에 적합함\n\n  > V2에서 문제가 발생하는 경우 V1으로 바꿀 수 있음\n\nV2: \n\n  > 저사양 기기에 적합하지 않습니다. 강제 종료, 동영상 깨짐, 끊김, 화면 꺼짐 등의 증상을 유발할 수 있음\n\n  > 2019년 이후 출시된 기기에 더욱 최적화되어 있음\n\n참고: 버전 15.33.34에서, Google이 Exoplayer V2를 강제했습니다. V2에서 문제가 발생하면 V1으로 바꾸십시오.\n\n공지: ExoPlayer V2는 실험적 기능입니다, 관련 지식이 전무한 상태에서 사용하지 마십시오. ExoPlayer V2가 켜진 상황에서의 강제 종료는 보고하지 마십시오. 강제 종료/끊김/화면 깨짐 등의 문제를 겪고 있는 경우, Exoplayer V1으로 전환하십시오."
    },
    {
      "title": "개발자 설정",
      "description": "Vanced 설정에서, \"정보\" 섹션을 6-7번 누르면 비밀 메뉴가 열립니다. 추가적인 동영상 코덱에 관한 설정을 활성화하는 것 외의 기능은 없습니다."
    },
    {
      "title": "YouTube Vanced를 기본 앱으로 만드려면 어떻게 해야 하나요?",
      "description": "제목에서 알 수 있듯이, 많은 사용자가 다른 앱(브라우저, 메신저 등의 앱)에서 YouTube 링크를 열 때 기본적으로 YouTube Vanced에서 열도록 설정하는 방법을 자주 묻고 있습니다.\n\n루트 버전 사용자의 경우, 이미 YouTube Vanced가 기본 YouTube 앱을 대체했으므로 이에 대하여 고민하지 않으셔도 됩니다.\n\n비루트 버전 사용자의 경우, 해결 방안이 OneUI, MIUI 및 나머지에 적용되는 방안으로 나뉩니다. 모든 OS에 대한 해결책을 제공해드릴 수 없으며, 이 사안을 직접 Google에 문의해야 할 수도 있습니다.",
      "fields": [
        {
          "title": "OneUI 사용자:",
          "content": "1. Tap and hold down on YouTube or YouTube Vanced app icon from your app drawer.\n2. Tap **App info**.\n3. Find \"**Set as default**\" and tap it\n4. Tap \"**Open supported links**\" and choose \"**Open in this app**\"\n\nIn older versions of OneUI, the name of the options in the 4th step might be slightly different. You may need to tap \"**Go to supported URLs**\" and choose \"**In this app**\" option.\nIn the very older version of OneUI 💩, you may need to go to **Settings** > **Apps** > *[tap three dots at the right corner]* > **Default apps** > **Set as default**. After apps loaded Find YouTube Vanced or YouTube and follow the 4th step..."
        },
        {
          "title": "MIUI 사용자:",
          "content": "1. 설정을 엽니다\n2. **애플리케이션**으로 가서,\n3. **앱 관리**로 가고,\n4. 우측 모서리의 3점 메뉴를 누르고,\n5. **기본 앱**을 누르고,\n6. **링크 열기**를 누릅니다.\n7. 모든 앱이 나열될 때까지 기다립니다...\n8. YouTube나 YouTube Vanced 앱을 찾아 누릅니다.\n9. \"**지원되는 링크 열기**\" 설정을 누르고 \"**열기**\"를 누릅니다"
        },
        {
          "title": "AOSP & 기타 커스텀 UI(OOS, ColorOS, EMUI 등):",
          "content": "1. **설정**을 엽니다\n2. **앱**으로 갑니다\n3. **기본 앱**을 누릅니다\n4. **YouTube**나 **YouTube Vanced**를 찾습니다\n5. \"**지원하는 링크 열기**\"를 누르고 \"**이 앱으로 열기**\"로 설정합니다\n\n그래도 계속 문제가 발생한다면 해결을 위해 [Google] (https://www.google.com/search?q=%EC%9C%A0%ED%8A%9C%EB%B8%8C+%EA%B8%B0%EB%B3%B8+%EC%95%B1+%EC%84%A4%EC%A0%95)에 문제를 검색하거나 [Play 스토어](https://play.google.com/store/search?q=open%20with)에서 서드파티 앱을 내려받을 수 있습니다…"
        }
      ]
    },
    {
      "title": "왜 루트 버전은 microG 코어와 함께 동작하지 않나요?",
      "description": "1. Vanced를 구동하려면 최소한 [pico](https://github.com/opengapps/opengapps/wiki/Pico-Package) 버전의 GApps가 필요합니다.\n\n2. 모든 GApps 패키지에서 쓸 수 있는 Google Play 서비스 프레임워크가 필요하므로 microG 코어만으로는 Vanced를 구동할 수 없습니다.\n\n3. 개인정보에 대한 우려가 있으며 GApps를 사용하고 싶지 않은데 그래도 광고 차단 기능을 이용하고 싶은 경우, [웹 버전](https://youtube.com)을 이용하시면 됩니다."
    },
    {
      "title": "캐스팅 문제",
      "description": "16.16.38 비루트 버전을 사용한다면, 업스트림 microG에 버그가 있습니다. 해당 문제가 해결되기 전까지는 업데이트를 기다리거나 버전을 15로 되돌려주시기 바랍니다. 루트 사용자의 경우 Google Play 서비스를 사용하고 있다면 캐스팅에 문제가 없을 것입니다."
    },
    {
      "title": "APK 서명이란?",
      "description": "아마 Vanced Manager를 사용하고 있지 않거나 비공식적인 출처에서 Vanced를 설치하여서 이 글을 읽고 계신 것 같습니다.\n그냥 Vanced Manager를 쓰십시오!\n\n아래에서 Vanced Manager를 안전하게 내려받으실 수 있습니다:\n- [공식 사이트] (https://vancedapp.com)\n- [GitHub 저장소](https://github.com/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "YouTube Vanced가 Play 스토어에 있나요?",
      "description": "아닙니다!\n다시 말하지만, Play Store나 다른 App Store에서 \"YouTube Vanced\"나 그와 유사한 이름의 가짜 앱을 설치하거나 이를 검색하려고 시도조차도 하지 마십시오.\n\n저희가 Play Store에 출시한 유일한 공식 앱은 [Vanced Guide](https://play.google.com/store/apps/details?id=com.vanced.faq) 말고는 없습니다.\n\n저희의 아이콘과 이름을 사용하는 다른 앱들을 찾으신다면 도용이나 사칭으로 신고하고 낮은 별점을 주십시오.\n\n저희 앱은 [공식 사이트](https://vancedapp.com)에서만 찾을 수 있습니다."
    },
    {
      "title": "왜 Vanced가 홈 화면이나 앱서랍에 표시되지 않나요?",
      "description": "아마 Vanced Manager를 사용하고 있지 않거나 비공식적인 출처에서 Vanced를 설치하여서 이 글을 읽고 계신 것 같습니다.\n그냥 Vanced Manager를 쓰십시오!\n\n아래에서 Vanced Manager를 안전하게 내려받으실 수 있습니다:\n- 공식 사이트 <https://vancedapp.com>\n- [GitHub 저장소](https://github.com/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "동영상 재생이 안 됩니다",
      "description": "앱을 다시 시작해보십시오. 또 기기의 인터넷 연결 문제일 수도 있습니다."
    },
    {
      "title": "왜 화질이 480p로 제한되나요?",
      "description": "COVID-19로 인해, Google은 많은 국가에서 데이터 사용량을 제한하고 있습니다. 이는 서버 측에서 발생하는 일이며 Vanced 및 일반 YouTube 사용자 모두에게 영향을 끼칩니다.",
      "fields": [
        {
          "title": "해결책:",
          "content": "1. 다른 지역의 VPN으로 연결하십시오.\n2. [웹 버전](https://youtube.com)을 이용하십시오.\n3. 480p 제한은 태블릿이 아닌 폰에만 걸려 있으므로, 제한을 우회하기 위해 YouTube Vanced에서 기기 모델을 바꿀 수 있습니다.\n\n#### 기기 모델을 바꾸려면 어떻게 해야 하나요?\n1. YouTube Vanced를 엽니다.\n2. 설정으로 갑니다.\n3. 'Vanced 설정'을 누릅니다.\n4. 숨겨진 설정을 활성화합니다:\n  - 스크롤을 내리고 '숨겨진 메뉴가 활성화되었습니다' 메시지가 뜰 때까지 '정보' 섹션을 계속 두드리십시오.\n5. '코덱 덮어쓰기'로 가십시오.\n6. 기기 제조사를 'samsung'으로, 모델명을 'SM-T865'로 설정하십시오.\n7. 앱을 재시작하십시오.\n\n재시작하면 480p 제한이 사라질 것입니다."
        }
      ]
    },
    {
      "title": "MicroG 알림을 숨기는 방법",
      "description": "To hide microG the notification,\n\n1. You can disable battery optimization for Vanced microG and reboot your device.\n\n2. If the above method doesn't work, disable microG notifications by holding on to the notification, toggle it off and tap Save.\n\n> Disabling app notifications can be done in different ways depending on the Android user interface. If you don't know how to disable it, try using Google for learning how to disable it."
    },
    {
      "title": "1440p가 1080p 화면에서도 더 좋은 화질을 제공해주나요?",
      "description": "그렇습니다. 하지만 동영상 비율이 18:9, 21:9 등일 때만 해당합니다. 이를 확인하려면 설정 > 일반에서 '전문 통계 사용 설정'을 켜면 됩니다.\n\n더 높은 품질을 활성화하려면, Vanced 설정 > 영상 설정에 간 다음 \"영상 화질 제한(해제)\"을 켜고 앱을 재시작하세요."
    }
  ]
}
