{
  "features": [
    {
      "title": "Vanced",
      "description": "YouTube Vanced는 Youtube 앱보다도 더 나은 앱이 되는 것을 지향하며 광고 차단, 검정 테마 등의 수많은 기능들이 내장되어 있습니다. YouTube Vanced를 쉽게 설치하려면 Vanced Manager를 이용하세요."
    },
    {
      "title": "Vanced Music",
      "description": "Vanced Music도 YouTube Vanced와 지향하는 바는 같으나 YouTube Music에 대응하는 앱입니다. Vanced보다 지원하는 기능은 적지만 YouTube Music을 기반으로 광고 차단 기능이나 백그라운드 재생 등의 기능을 갖추고 있습니다!"
    },
    {
      "title": "YouTube Vanced 주요 기능",
      "description": "AMOLED 검정 테마.\n- 동영상 광고 차단 및 백그라운드나 PIP 재생 지원 (안드로이드 8.0 이상 한정)\n- 위아래로 밀어서 밝기와 음량을 조절할 수 있는 스와이프 제스처 기능 (제스처 인식 범위 설정 가능).\n- 동영상을 자동으로 반복 재생하는 기능.\n- 새 댓글/미니플레이어 레이아웃을 구 레이아웃과 비슷한 태블릿 버전의 레이아웃으로 바꾸는 기능 (자잘한 버그가 있음)."
    },
    {
      "title": "사용자 지정",
      "description": "- 구형 기기나 VP9 코덱에 대해 H264 코덱을 강제로 적용하는 등 코덱 설정을 강제 변경할 수 있으며, 이를 통해 HDR 재생을 강제하거나 영화같은 경험을 선호하는 경우 초당 60 프레임 설정을 끌 수도 있습니다. (이런 기능에 대한 사용자 지정 기기 구성은 디스코드 또는 XDA에서 찾을 수 있습니다)\n- 기본 동영상 품질을 원하는대로 높거나 낮게 강제 설정하고 모든 기기에서 4K 재생을 선명하게 하기 위해 화면의 해상도를 강제 변경할 수도 있습니다. 또한 기본 재생 속도를 0.25배에서 2배 사이로 변경할 수 있습니다 (기기가 충분히 사양이 높다고 가정)\n- 홈 화면 광고, 대부분의 UI 광고, 상품 섹션, 커뮤니티 게시물, 영화 광고 배너, 영상 하단 정보 패널 (예: COVID 관련 정보), 전체 댓글창, 소형 영화 배너, 영화 선반 등을 마음대로 표시하거나 숨길 수 있습니다!"
    },
    {
      "title": "스폰서 차단",
      "description": "- 스폰서 파트(유튜버가 동영상 중간에 서비스 또는 제품을 광고하는 부분)를 건너뛸 수 있는 기능입니다\n- 또 인트로, 아웃트로 및 자체 홍보 등의 파트를 건너뛸 수 있는 기능을 지원합니다.\n- 이 API를 사용하고 있습니다. 어떻게 이런 기능을 구현했는지 찾아볼 수 있습니다.\n- 또한 API에 자신의 파트를 제출하면서 커뮤니티 확장에 기여할 수 있습니다.\n- 해당하는 파트를 자동으로 건너뛸지 건너뛰기 버튼을 표시할지 아니면 단순히 건너뛰지 않을지의 여부를 완벽하게 설정할 수 있습니다.\n- 타임라인에 파트 종류를 서로 다른 색으로 강조 표시합니다."
    },
    {
      "title": "플랫폼",
      "description": "현재는 안드로이드에서만 사용할 수 있으며, 당분간 다른 플랫폼을 지원하지 않을 예정입니다"
    },
    {
      "title": "루트와 비루트 버전의 차이",
      "description": "- 루트: \nVanced 루트 버전은 공식 YouTube 앱을 완전히 대체합니다. 따라서 YouTube 링크나 Google 어시스턴트를 개조된 Vanced 앱을 기반으로 이용할 수 있습니다.\n- 비루트:\n- 기기가 루팅하기 어렵거나 기기를 루팅하기 싫다면, 비루트 버전을 선택하여야 합니다.\n- 루팅한 기기에도 비루트 버전을 설치할 수는 있습니다. 비루트 버전의 패키지명은 공식 YouTube 앱과 다르므로 이 두 앱이 기기에 공존할 수 있습니다. YouTube/Google 계정에 로그인하려면 추가 앱(Vanced microG)을 설치해야 함을 기억하십시오.\n- 게다가, YouTube 링크를 열려면 Vanced를 기본 앱으로 수동 설정하여야 합니다.\n- 하지만 비루트 버전이 이용하기 간편하므로, 정말 YouTube 앱을 Vanced로 완전히 대체할 수밖에 없는 상황이 아니라면 그냥 비루트 버전을 이용하는 것을 추천드립니다."
    }
  ]
}
