{
  "features": [
    {
      "title": "Vanced",
      "description": "YouTube Vanced mira ad essere una versione migliorata di Youtube. Essa include un blocco per gli annunci, una modalità scura amoled e molto altro. Utilizza Vanced Manager per installare YouTube Vanced con relativa facilità."
    },
    {
      "title": "Vanced Music",
      "description": "Vanced Music ha lo stesso obiettivo di YouTube Vanced, ma questa app si concentra su YouTube Music. Questa è relativamente meno ricca di funzionalità rispetto Vanced, ma presenta ancora molte cose in comune come il blocco degli annunci e la riproduzione in background, tutto all'interno di Youtube Music!"
    },
    {
      "title": "Caratteristiche principali di YouTube Vanced",
      "description": "Un tema nero amoled.\n- Blocca tutti gli annunci video e ti consente di riprodurre video in background o in modalità Picture in Picture (solo su Android 8.0 e versioni successive)\n- I controlli di scorrimento consentono di modificare la luminosità e il volume con gesti verso l'alto ed il basso (con posizionamento configurabile). \n- Funzionalità di ripetizione automatica che ti consente di riavviare i video in maniera continuativa.\n- I nuovi layout commenti/miniplayer possono essere commutati sulle versioni tablet che sono molto simili alla vecchia versione (anche se leggermente affetta da bug)."
    },
    {
      "title": "Personalizzazione",
      "description": "- Consente di sovrascrivere le opzioni Codec come la forzatura H264 per vecchi dispositivi o VP9, questo consente anche di forzare la riproduzione HDR o di disattivare i 60fps se preferisci un'esperienza cinematografica. (Le configurazioni personalizzate del dispositivo per queste funzionalità di trovano sul nostro server discord o su XDA)\n- Forza la risoluzione video predefinita ad un valore maggiore o minore di quanto desideri e può persino sovrascrivere la risoluzione dello schermo per una riproduzione 4K nitida su qualsiasi dispositivo. Consente inoltre di modificare la velocità di riproduzione predefinita in qualsiasi punto compreso tra 0,25x e 2x (dando per scontato che il dispositivo sia abbastanza potente per supportarla)\n- Consente di attivare/disattivare gli annunci domestici, la maggior parte degli annunci dell'interfaccia utente, gli annunci di vendita degli oggetti, i post della community, i box di vendita dei film in alto, le informazioni su banner compatti (come le informazioni sul covid), il box dei commenti, i box compatti dei film, gli scaffali dei film e molto altro!"
    },
    {
      "title": "SponsorBlock",
      "description": "- Offre la possibilità di saltare i segmenti degli sponsor (dove uno youtuber pubblicizza un servizio o un prodotto nel mezzo di un video).\n- Supporta anche il salto di altre categorie, come introduzioni, conclusioni e auto-promozione.\n- Utilizza l'API che si trova qui. Potrai trovare maggiori informazioni sul suo funzionamento.\n- Ti consente inoltre di inviare i tuoi segmenti all'API e di contribuire con una community più ampia.\n- Controllo completo sull'opportunità di saltare automaticamente una categoria di segmenti o mostrare un pulsante per saltarla o semplicemente non saltarla affatto.\n- Evidenzia il segmento nel colore specifico in base alla sua categoria nella sequenza di riproduzione."
    },
    {
      "title": "Piattaforme",
      "description": "Attualmente l'app esiste solo su Android, e al momento non ci sono piani per supportare altre piattaforme"
    },
    {
      "title": "Differenza tra Root e Non-Root",
      "description": "- Root:\nLa variante root di Vanced sostituisce perfettamente l'app YouTube ufficiale. Di conseguenza, potrai aprire direttamente i link di YouTube o chiamarli utilizzando l'Assistente Google tramite l'app vanced modificata.\n- Non-Root:\n- Se hai un dispositivo su cui è difficile eseguire il root o non vuoi eseguire il root del tuo dispositivo di utilizzo quotidiano, per prima cosa dovresti optare per la variante non root.\n- Può essere installato anche su un dispositivo con accesso root. Poiché il nome del pacchetto della variante non-root è diverso dall'app YouTube ufficiale, dunque possono coesistere. Tieni però presente che dovrai installare un'app complementare aggiuntiva (Vanced microG) per poter accedere al tuo account YouTube/Google.\n- Inoltre, dovrai impostare manualmente Vanced come app predefinita per l'apertura dei link di YouTube.\n- Tuttavia, la variante non-root è semplicemente più facile da gestire, quindi ti consigliamo di restare con la variante non-root a meno che tu non abbia davvero bisogno di sostituire l'app YouTube stock sul tuo telefono."
    }
  ]
}
