{
	"troubleshooting": [
		{
			"title": "Risoluzione dei problemi di base",
			"description": "A) Cancella i dati e la cache di \n\n(I) Vanced/Vanced Music e microG per la variante Non-Root\n(II) Vanced/Vanced Music e Google Play Services per la variante Root\n\nB) Reinstalla YouTube Vanced\n\nNOTA IMPORTANTE: Riavvia tra i processi"
		},
		{
			"title": "Problemi di accesso",
			"description": "Di seguito sono riportati alcuni degli errori più comuni con le relative schermate in modo da poter conoscere la soluzione da seguire.",
			"fields": [
				{
					"title": "Se dovessi ricevere un messaggio di errore con il seguente avviso: \"Per favore verifica la tua connessione Internet\"",
					"content": "Segui questa videoguida: https://youtu.be/S5sTXRTrD5Y. Prova a cancellare anche i dati dell'app microG."
				},
				{
					"title": "In caso di problemi relativi all'accesso che mostrano il seguente messaggio: \"Sei offline, esplora i download\"",
					"content": "1. Cancella i DATI di Vanced microG e Google Play services\n2. DISINSTALLA sia \"Vanced microG\" che Vanced.\n\n3. Riavvia se vuoi.\n\n4. Reinstalla entrambi gli APKs [microG e Vanced), assicurandoti di installare microG prima di Vanced. Installa tramite Vanced Manager o l'app SAI, utilizzando i file forniti nella #nota di installazione del gruppo.\n\n5. Ora accedi.\n\nNOTA: se Vanced dovesse ancora mostrare errori di connessione (anche dopo aver installato prima microG) o di ricezione delle notifiche, ecc., Assicurati di disattivare l'ottimizzazione della batteria per le app Vanced e microG.\n\nLe istruzioni per farlo variano a seconda del produttore del dispositivo. Puoi seguire guide come https://dontkillmyapp.com o cercarne di nuove."
				},
				{
					"title": "Se Vanced si disconnette dal tuo account Google",
					"content": "Succede perché l'ottimizzazione della batteria del sistema operativo del tuo dispositivo uccide i servizi/le attività di microg responsabili degli accessi.\n\nPer risolvere questo problema, disattiva l'ottimizzazione della batteria per microG utilizzando https://dontkillmyapp.com OPPURE cercane di nuove"
				},
				{
					"title": "Per gli utenti che utilizzano un account Gsuite su una versione Non-Root di vanced e riscontrano frequenti problemi di connessione (errori come \"Sei offline\", \"Verifica connessione Internet\" e così via)",
					"content": "•Log into your Gsuite account [admin console](https://admin.google.com/)\n\n• Search for device management\n\n• Go to setup and disable \"Mobile Management\"\n\n• That's it and it will get fixed."
				},
				{
					"title": "Soluzione Huawei 1",
					"content": "For those who updated microG to most recent version but now are facing login issues\n\n1. Uninstall current installed Vanced microG.\n\n2. Download \"Vanced microG 0.2.12.203315 version\" from Mediafire v15 link and install it. [Link for Mediafire v15 here](https://del.dog/Mediafireonlyv15)\n\n3. You should be able to login now."
				},
				{
					"title": "Soluzione Huawei 2",
					"content": "1. Disinstalla sia vanced che microg se già installati. Quindi reinstalla solo microg (l'ultimo disponibile)\n\n2. Poi apri le impostazioni dell'app microg\n\n3. Disattiva \"Messaggistica Cloud\" e \"Registrazione dispositivo Google\".\n\n4. Aggiungi il tuo account tramite microg.\n\n5. Quindi installa Vanced."
				},
				{
					"title": "Soluzione Huawei 3",
					"content": "1. First, install the old Vanced microG version{particularly microg_YouTube_Vanced_0.2.4-105_16052019_2.apk using [this link](https://www.mediafire.com/file/4mw2q6ajq85g2io/microg_YouTube_Vanced_0.2.4-105_16052019_2.apk/file)}. Make sure to uninstall the current version to install the above version and save the latest APK file as you will be needing it later.\n\n2. Then open YouTube Vanced and try logging in again until it shows the error message. Try to reload it by tapping the error message. \n\n3. Now install the newer microG version again and restart vanced. It should be logged in again and everything should work again.\n\nNOTE: Now make sure u disable battery optimization for both microG and vanced using https://dontkillmyapp.com otherwise your device software might kill microG and you might have to repeat all above steps again to fix login."
				}
			]
		},
		{
			"title": "Vanced Manager",
			"fields": [
				{
					"title": "Per Vanced manager bloccato sul logo/problema di crash",
					"content": "Cancella i dati dell'app manager > Disattiva Internet> Apri l'app manager > Attiva Internet."
				},
				{
					"title": "INSTALL_FAILED_INVALID_APK: Nessun pacchetto pronto",
					"content": "Installa YouTube stock dal Play Store, quindi aggiornalo a vanced utilizzando vanced manager."
				},
				{
					"title": "Se l'ultima versione di Vanced manager si blocca nella schermata \"Per favore sii paziente\", fai quanto segue",
					"content": "Installa YouTube stock dal Play Store, quindi aggiornalo a vanced utilizzando vanced manager."
				},
				{
					"title": "Se dovessi riscontrare il seguente messaggio: \"Errore durante il download di Microg/Vanced\", o l'installazione dell'app microg/vanced dovesse bloccarsi",
					"content": "Cancella i dati dell'app manager, quindi continua l'installazione e NON PASSARE AD ALTRE APP FINO A QUANDO IL PROCESSO NON VERRÀ COMPLETATO."
				}
			]
		},
		{
			"title": "Correzione delle notifiche",
			"description": "Per la correzione delle notifiche, dello sfondo bianco o della mancata rilevazione di Vanced in \"Google Cloud Messaging\", vedi in basso",
			"fields": [
				{
					"title": "Per Non-Root",
					"content": "1. Installa prima Vanced microG e poi YouTube Vanced.\n\n2. Accedi con il tuo account Google\n\n3.\na) Disattiva l'ottimizzazione della batteria per microg (suggeriamo la guida dontkillmyapp.com).\n\nb) **Apri le impostazioni aggiuntive \"Vanced microG\", quindi continua con questa guida:\n\ni) https://youtu.be/Q-5YFmFWVok"
				},
				{
					"title": "Se Vanced non fosse rilevato in GCM o risultasse non registrato",
					"content": "Prova ENTRAMBI i seguenti passaggi:\n\n1. Rimuovi il tuo account Google dalle impostazioni dell'account. L'account utilizzato da vanced ha il vecchio colore di sfondo blu con il piccolo logo a forma di g.\n\n2. Cancella i dati di microG quindi accedi.\n\nO\n\nSe la soluzione alternativa sopracitata non dovesse funzionare, reinstalla vanced."
				},
				{
					"title": "Per Root",
					"content": "Assicurati che \"Scheduled Digest\" sia disattivato nelle impostazioni di YouTube e che i suoni delle notifiche siano corretti e impostati.\n\nPuoi provare ad utilizzare l'app \"Gestione notifiche\" che tiene traccia di tutte le notifiche in un unico posto, quindi nel caso in cui tu stia ignorando le notifiche, potrai ugualmente accedere da quell'app."
				},
				{
					"title": "Se riscontri errori come \"Operazione non riuscita perché i file apk sono invalidi/danneggiati\"",
					"content": "• Vai nelle impostazioni di Vanced Manager e cancella i file scaricati\\n\\n • Quindi cancella i dati dell'app Vanced Manager e continua l'installazione di Vanced."
				}
			]
		},
		{
			"title": "Problemi di chiusura forzata",
			"description": "Se l'app Vanced si arresta in modo anomalo/forzato all'avvio",
			"fields": [
				{
					"title": "Nonroot",
					"content": "1) Se l'app Vanced non-root dovesse chiudersi forzatamente prima di installare MicroG, disinstalla sia l'app Vanced che MicroG. Quindi installa prima MicroG, poi Vanced. Dopodichè il problema dovrebbe essere risolto.\n\n2) Se l'app Vanced non-root dovesse chiudersi forzatamente senza installare microg, installa microg. [Se non vuoi accedere, non accedere e installa solo l'apk microg, poiché vanced necessita di microg per la connessione con i servizi Google]"
				},
				{
					"title": "Root",
					"content": "1) Se la tua versione root di Vanced dovesse chiudersi forzatamente all'apertura disinstalla gli aggiornamenti dell'app YouTube. Se ciò non dovesse aiutare, disattiva/disinstalla il tuo tema substratum/swift.\nIn ultima istanza, se nulla di tutto ciò avesse funzionato, fornisci un file di logcat alla community/staff.\n\n2) Se la tua versione root di Vanced si chiude forzatamente durante l'utilizzo, mentre risulta essere in primo piano/attiva o in fase di riproduzione video, cattura un file di logcat e trova:\n\n(a) - Unsatisfiedlinkerror: \nSol: - Apri il file manager e accedi alla memoria di root.\nQuindi apri \"system/app/youtube/lib\" OPPURE \"Data/app/com.google.android.youtube/lib\" e rinomina\n\nda arm64-v8a ad arm64\n\nda armeabi-v7a ad arm\n\ne il problema verrà risolto.\n\nInoltre, se entrambi \"arm e arm64\" non fossero presenti nel percorso sopracitato, prova a scaricarli entrambi dall'apk ufficiale di YouTube o chiedi ai tuoi amici ed effettua l'estrazione in quel percorso\n\n(b) - Notehitelisted \"com.google.android.youtube\":\nSol: - Verifica l'aggiunta alla lista bianca da qui(todo)\n\nSe non sai come ottenere i log, dai un'occhiata alla nota di segnalazione bug"
				},
				{
					"title": "Se Vanced si arresta in modo anomalo durante la riproduzione (durante la riproduzione in secondo piano)",
					"content": "Poiché questo problema è causato solo dall'ottimizzazione della batteria aggressiva presente in varie interfacce OEM come MIUI, Emui, ColorOS, ecc..., si consiglia di disattivare l'ottimizzazione della batteria sia per l'app Vanced che per l'app MicroG.\n\nLe istruzioni per farlo variano a seconda del produttore del dispositivo, quindi non possiamo davvero aiutarti a disattivarlo. Puoi provare a utilizzare un sito come \"dontkillmyapp.com\", OPPURE ad utilizzare Google e cercare \"[produttore del telefono] [modello del telefono] [versione Android] disattiva l'ottimizzazione della batteria\"\n\nTuttavia, se dovessi riscontrare ancora questo problema, fornisci una segnalazione bug (#bugreport) su Telegram o su discord con i dettagli richiesti ed i relativi log in modo che i Moderatori possano dare un'occhiata a cosa sta effettivamente causando il problema. Inoltre, assicurati di prendere i registri specifici per vanced, NON quelli dell'intero SISTEMA."
				}
			]
		},
		{
			"title": "Disinstalla al riavvio",
			"description": "Se la versione root di YouTube Vanced/YouTube Music Vanced dovesse scomparire/disinstallarsi/ripristinarsi alla versione stock dopo un riavvio,\n\nAbbiamo 2 soluzioni disponibili per te",
			"fields": [
				{
					"title": "Soluzione 1",
					"content": "Mantieni la versione non-root finchè non verrà trovata una soluzione."
				},
				{
					"title": "Soluzione 2",
					"content": "REQUISITI:\n\nVanced Manager 2.1.0 o superiore\nUn root manager come Es File Explorer o Root Browser\nPassaggio 1: Dirigiti su /data/adb/service.d/ e modifica lo script Music.sh e/o Vanced.sh\n\nEntrambi dovrebbero contenere qualcosa di simile a questo:\n\nwhile  [ \"`getprop sys.boot_completed | tr -d '\n'`\" != \"1\" ] ; do sleep 1; done \n\nPassaggio 2: Modifica il valore \"do sleep 1; done\"   in   \"do sleep 2; done\"\n\nPassaggio 3: Riavvia o Riaccendi il dispositivo\n\nSe ciò non dovesse funzionare, prova ad aggiungere un periodo di pausa maggiore tra do e done\n\n——————————————————\n\nSe ciò non dovesse nuovamente funziona, forse il tuo dispositivo ha bisogno di più tempo prima di eseguire il montaggio dell'apk root di vanced youtube/music.\nTi basterà dunque modificare vanced.sh e/o music.sh,\ninserendo una nuova linea di sospensione tra la linea 'while' e 'mount' come:\n\n#!/system/bin/sh\nwhile [ \"`getprop sys.boot_completed | tr -d '\n' `\" != \"1\" ]; do sleep 1; done\nsleep 10\nmount -o bind /data/adb/Vanced/base.apk /data/app/com.google.android.youtube-...."
				},
				{
					"title": "Se Vanced si arresta in modo anomalo durante la riproduzione (durante la riproduzione in background)",
					"content": "Since this issue is only caused by aggressive battery optimization present in various OEM skins such as MIUI, EMUI, ColorOS, etc..., it is recommended to disable battery optimization for both Vanced and MicroG app. \n\nInstructions to do so vary on your device manufacturer, so we can’t really assist with helping you disable it. You can try using a site like \"dontkillmyapp.com\", OR using Google and searching “[phone manufacturer] [phone model] [Android version] disable battery optimization”\n\nHowever, if you still have this issue, provide #bugreport on telegram or in discord with the details it requires and logs must be there so that Mods can take a look what's actually causing. Also, make sure to grab logs specific to vanced, NOT your whole SYSTEM."
				}
			]
		},
		{
			"title": "Annunci in Vanced",
			"description": "Se dovessi visualizzare degli annunci su YouTube Vanced o Vanced Music, leggi questo messaggio da parte di xfileFIN:\n\n> Devo poterlo visualizzare personalmente per poterlo rintracciare. Poiché nascondere semplicemente il layout non funzionerà.\nNon sono sicuro di come decidano a quali utenti mostrarli, avviene tutto lato server.\nQuello che so è che non posso nascondere il layout perché lo stesso layout viene utilizzato anche per i video reali. Il codice decide solo se mostrare o meno il badge dell'annuncio.\nBeh, potrei facilmente nascondere il badge dell'annuncio ma mostrerebbe comunque il video dell'annuncio effettivo, senza etichettarlo come annuncio.\nDevo ottenere io stesso l'annuncio per rintracciarlo nel codice poiché l'offuscamento lo rende difficile.\n\nLa schermata iniziale e gli annunci della rete di ricerca (aggiunti da Google) sono basati sulla regione e non verranno mostrati se non ti trovi nella regione in cui risulta attivo. Tali annunci non vengono aggiunti in alcun modo dal team vanced, quindi se credi che la colpa sia da attribuire a noi, sappi che potremmo già aver riso di te.: D\n\nGli sviluppatori sanno già che stai ricevendo annunci nella tua regione. Attendi pazientemente gli aggiornamenti finché tutti gli annunci non verranno bloccati. Fino ad allora, goditi vanced e non segnalare il medesimo problema sulla chat.\n\nLa soluzione temporanea per risolvere questo problema sarebbe cancellare i dati e la cache dell'app o attendere aggiornamenti futuri.",
			"fields": [
				{
					"title": "Soluzione 1",
					"content": "Usare la versione non-root fino a quando gli sviluppatori non risolveranno il problema."
				},
				{
					"title": "Soluzione 2",
					"content": "REQUIREMENTS: \n\nVanced Manager 2.2.0 or newer\nStep 1: Go to manager settings > Root Script Sleep Time (you should be on root mode for this option to appear) and set the value to 2 > hit save, reboot and see if Vanced/Music still disappear. If they still disappear try adjusting the value until they stick after reboot"
				}
			]
		},
		{
			"title": "Cronologia",
			"description": "Se dovessi riscontrare problemi nel salvare i video guardati/ricercati nella cronologia, segui questi passaggi:\n\n• Per gli utenti root, indipendentemente dalla variante (Non-Root o Root) utilizzata,\n\n> Assicurati di aver aggiunto *s.youtube.com alla lista bianca del tuo sistema di Blocco Pubblicitario.\n\n⚠️NOTA per gli utenti Adaway. Se la lista bianca dell'URL non dovesse funzionare, clicca su \"fonti host\", deseleziona il filtro \"stevenblack\" e salva le modifiche, quindi riavvia e la tua cronologia tornerà a funzionare.\n\n• Per gli utenti non root.\n\n> Assicurati di aver installato la versione di YouTube Vanced 14.10.53 o superiore, per assicurarti che la cronologia venga salvata correttamente. Se la cronologia risultasse ancora non aggiornata, allora dovrai collegare il tuo account brand dalle (Impostazioni di YouTube -https://www.youtube.com/account_advanced) affinchè la cronologia possa tornare a funzionare. (Questo processo cancellerà la cronologia esistente).\n\n⚠️NOTA per gli utenti Adaway che utilizzano il Blocco Pubblicitario basato VPN anziché su root: se non stai utilizzando account brand, assicurati di aggiungere *s.youtube.com alla lista bianca e di applicare le modifiche.⚠️"
		},
		{
			"title": "Problemi di caricamento APP",
			"description": "If you are facing issues where videos watched/search results are not getting recorded by Vanced i.e., history being not working, this is how you get the history working:\n\n• For users who are rooted regardless of which variant (Non-Root or Root) you are using,\n\n> Make sure you whitelist *s.youtube.com in your Ad-Blocker.\n\n⚠️NOTE for Adaway users: If whitelisting the URL didn't work for you, tap on \"host sources\" and untick \"stevenblack\" and apply, then reboot and your history will work.⚠️\n\n• For Non-Root users:\n\n> Make sure you're on v14.10.53 or higher for the app to save your watch history. If history still doesn't update, then you need to merge your brand account in [YouTube Settings](https://www.youtube.com/account_advanced) to get history working. (Merging process will clean the current history.)\n\n⚠️NOTE for Adaway users using VPN Ad-Blocking instead of root based Ad-Blocking: If you are not using brand account, make sure to whitelist *s.youtube.com url in allowed list then apply the changes.⚠️"
		},
		{
			"title": "Problemi picture-in-picture",
			"fields": [
				{
					"title": "If Vanced got stuck on splash screen",
					"content": "1. Switch Airplane mode on.\n2. Open Youtube Vanced.\n\n3. Tap on close in changelog popup.\n4. Turn off Airplane mode.\n5. Reopen vanced.\n\nThanks to rocco6victorFrom XDA"
				},
				{
					"title": "If Vanced keeps on loading infinitely",
					"content": "1. Disable battery optimization for both YouTube Vanced and microG app using dontkillmyapp.com then reboot your device.\n2. It should get fixed now."
				}
			]
		},
		{
			"title": "Problemi con il download dell'app",
			"description": "⚠️Please don't report PIP related issues.⚠️\n• Pip is controlled by system as Vanced uses android native pip. Blame ROM for any issues with your PIP.\nOther apps like MX Player, VLC, etc uses its own PIP instead of android native hence they will never face such issues which persist in apps using native.\n\n• PIP is available for android 8 and above only.\n\n• To enable PIP, Open YT app settings > general > enable pip\n\n> To enable pip in MIUI, you have to make sure this setting is on:\nPrivacy protection->manage->special app accesss->picture-in-picture\n\nOn latest V15.43.32, pip is stock yt bug so please wait for Google to fix it fully first."
		},
		{
			"title": "Scollega",
			"fields": [
				{
					"title": "Alternativa 1",
					"content": "Nel caso in cui i metodi sopraelencati per scollegare l'app non avessero funzionato, puoi provare quelli qui in basso:\n\nUtilizza l'app Titanium Backup (in versione pro)\n\n• Apri Titanium Backup.\n\n• Cerca e clicca la voce 'youtube'.\n\n• Scorri a sinistra per accedere alle funzionalità speciali.\n\n• Clicca su Collega allo store.\n\n• Quindi dirigiti nuovamente sulle funzionalità speciali.\n\n• Clicca su 'scollega dallo store'.\n\n• Fatto"
				},
				{
					"title": "Alternativa 2",
					"content": "NOTA: Gli aggiornamenti automatici dovranno essere attivati dal Play Store prima effettuare le seguenti operazioni.\n\n1. Crea il file \"Detach.txt\" nel percorso seguente /sdcard/ (equivalente a /storage/emulated/0/) e modificalo aggiungendo \"YouTube\" (senza virgolette) al suo interno. È anche possibile scaricare tale file dal modulo Magisk \"Detach\", modificandolo con un editor testuale per rimuovere il simbolo \"#\" dopo la scritta \"YouTube\".\n\n2. Esegui il flash del modulo \"Detach\" da Magisk Manager.\n\n3. Esegui il flash di Daily Job Scheduler (djs) da Magisk manager.\n\n4. Riavvia il dispositivo.\n\n5. Apri il terminale, digita \"su -c detach -t\" e imposta l'esecuzione su \"esegui una volta ogni ora\".\n\n6. Fatto!\n\nIl Play Store aggiorna i suoi file di database ad un ritmo casuale, più frequentemente o più raramente nell'arco di una giornata/settimana. Il Play Store mostrerà un aggiornamento di Youtube, che andrà via da sé quando lo script verrà nuovamente eseguito da djs."
				}
			]
		},
		{
			"title": "Correzione per gli errori di SAI/Vanced Manager",
			"description": "You can use any of the workarounds listed below to remove the YouTube app from the market.",
			"fields": [
				{
					"title": "Workaround 1(Recommended)",
					"content": "\n\nUsing [TeMiFi app](https://forum.xda-developers.com/t/app-tool-temefi-comprehensive-system-administration.3806260), Make sure the YouTube Vanced is a user app as this method won't work if Vanced is installed as a system app.\n\nIn TeMeFi select > Give root permissions > Tap on Application info > Detach package from play store > DETACH: Select package then protection level v5 > Select YouTube with package name \"com.google.android.youtube\" > Tap on 3. Invalidate the data, block any attempt.... > Yes, I accept full responsibility"
				},
				{
					"title": "INSTALL_FAILED_UPDATE_INCOMPATIBLE",
					"content": "\n\nUsing Titanium backup app(needs pro version)\n\n• Open titanium backup \n\n• Search for youtube and Click on it \n\n• Swipe left to access special features \n\n• Click on Attach to market \n\n• Then again go to special features \n\n• Click on \"detach from market\" \n\n• Done"
				},
				{
					"title": "Workaround 3",
					"content": "NOTE: Auto-Updates must be disabled in play store before doing this.\n\n1. Create \"Detach.txt\" in the following location /sdcard/ (equivalent to /storage/emulated/0/) write \"YouTube\" in that text file without quotes. You can also download the Detach.txt from Magisk module name Detach and remove the # in front of YouTube.\n\n2. Flash Detach module in Magisk manager.\n\n3. Flash Daily Job Scheduler (djs) in Magisk manager.\n\n4. Reboot\n\n5. Open Terminal and type \"su -c detach -t\" and set it to run once every hour.\n\n6. Done!\n\nPlay Store updates its database file on a random rhythm, sometimes several times a day. Once in a while (like once every two weeks), Play Store will show an update for Youtube, but it will go away when the script has run again by djs."
				},
				{
					"title": "Workaround 4",
					"content": "Switch to Non-Root variant of Vanced. This workaround should only be used as a last resort if all of the other options fail!"
				}
			]
		},
		{
			"title": "Problemi di live streaming",
			"description": "Soluzione: Segui questa guida > https://youtu.be/R9asMVCQkAU. Inoltre, disattiva i tuoi blocchi pubblicitari esterni/vpn/proxy/impostazioni personalizzate in vanced. Mantieni le impostazioni predefinite se non vuoi avere problemi.",
			"fields": [
				{
					"title": "INSTALL_FAILED_VERSION_DOWNGRADE",
					"content": "Uninstall stock yt updates. Make sure Stock YouTube version is lower than vanced version you are installing now."
				},
				{
					"title": "INSTALL_FAILED_UPDATE_INCOMPATIBE",
					"content": "Just uninstall any vanced app that you have installed from any other source then install vanced.  Otherwise uninstall \"vanced microG\" > reboot device > then install vanced microG first then Vanced. If error still comes, use SAI to install the vanced split apks manually. These apk files are located in \n\"android / data / com.vanced.manager / files / vanced / nonroot / \""
				},
				{
					"title": "INSTALL_PARSE_FAILED_NOT_APK",
					"content": "Change the language of your phone from Indonesian to English then install vanced. After installing, you can change language back to Indonesian. If your device isn't using Indonesian language, make sure language is properly selected in Vanced manager which you wanna install with YouTube Vanced."
				},
				{
					"title": "INSTALL_FAILED_NO_MATCHING_ABIS",
					"content": "Download legacy version instead of default"
				},
				{
					"title": "INSTALL_FAILED_INVALID_APK: Split config.en was defined multiple times",
					"content": "Try removing one split_config.en apk from apks file then install\n(Apks file is just a zip file so you can easily remove the apk from it)"
				},
				{
					"title": "INSTALL_FAILED_DUPLICATE_PERMISSION",
					"content": "Uninstall microG > reboot > install vanced via sai > install microG\n\nIf microG doesn't install, install microG too via SAI."
				},
				{
					"title": "Unable to install the app because it conflicts with an already installed app with same package name",
					"content": "Uninstall microG > reboot > install vanced via sai > install microG via apk package installer\nIf microG doesn't install, install microG too via SAI."
				},
				{
					"title": "APP IS INCOMPATIBLE WITH THIS DEVICE",
					"content": "Download the legacy architecture files when downloading vanced files from official vanced mirrors instead of default architecture."
				},
				{
					"title": "INSTALL_PARSE_FAILED_NO_CERTIFICATES",
					"content": "It seems like you didn't read instructions properly and installed vanced without disabling signature verification. or you tried some method which didn't give any positive result, so the solution to both is to disable signature verification using the best method/alternative to what you used before or just use our [vanced manager](https://vancedapp.com which doesn't require you to disable signature verification."
				},
				{
					"title": "INSTALL_FAILED_INVALID_INSTALL_LOCATION",
					"content": " Please head to your device settings > developer options and turn off \"force allow apps on external\" then install the Vanced app in SAI."
				},
				{
					"title": "INSTALL_FAILED_USER_RESTRICTED: Install canceled by user",
					"content": "Unknown sources install is protected per service in your MIUI devices Please go to your device settings and enable unknown sources for SAI and issue will get solved and you will be able go install Vanced."
				},
				{
					"title": "INSTALL_FAILED_INTERNAL_ERROR: Permission Denied",
					"content": "Disable MIUI optimization from your device developer options."
				}
			]
		},
		{
			"title": "Lista bianca",
			"description": "Se dovessi riscontrare arresti anomali sulla variante root di YouTube Vanced a causa della lista bianca, puoi provare a seguire la guida disponibile a questo link (https://www.xda-developers.com/how-to-fix-device-not-certified-by-google- errore) e provare a capire se nel tuo caso è risolutiva.\n\n In alternativa, se la guida non dovesse esserti di aiuto, una reinstallazione pulita o un cambio della ROM potrebbe risolvere questo problema."
		},
		{
			"title": "Black screen video fix",
			"description": "Solution: clearing data of Youtube Vanced and subsequently reinstalling it should fix the issue. If it doesn't, try a Reboot &\nCheck if black screen issue solves. \n\nIf problem persist, factory reset your device or change the ROM."
		},
		{
			"title": "Content Restrictions",
			"description": "In English it is callled \"restricted mode\"\nIn arabic it is called \"وضع تقييد المحتوى\"\n\nTo solve issue of lesser search results, do this\n\n1. Go to settings > General\n\n2. Find \"restricted mode\" and turn it off.\n\nIf you're in a country that Google hates, use a vpn."
		},
		{
			"title": "View count change",
			"description": "To change the view count from crores/lakhs to millions, do this:\n\n\nSolution:\n\n1. Go to settings (of your phone)\n\n2. Go to system \n\n3. Go to language preferences\n\n4. Add a language as English (US) \n\n5. Drag this language above your current one.\n\n6. Go to youtube and enjoy ⚡\n\nThanks to @ROG_OK from telegram Vanced group for finding the fix."
		},
		{
			"title": "Captions",
			"description": "If you face caption issues such as random subtitles of different languages on an english video, here's what you have to do;\nSet the caption language to your region language in your caption settings.\n\nTo access caption settings, head to device settings > accessibility > captions\n\nOr\n\nYouTube settings > captions"
		},
		{
			"title": "HDR brightness Workaround",
			"description": "Use the swiping features to turn the brightness to its maximum"
		},
		{
			"title": "Settings crashes",
			"description": "Turn off your fingerprint and go in the settings and do your setting, after it's done, turn it back on. It won't crash again after that, even if you keep going in it unless you restart your device."
		}
	]
}
