{
  "data": [
    {
      "title": "Vanced",
      "description": "YouTube Vanced pretende ser una mejor versión de YouTube. Incluye bloqueo de publicidad, el tema negro y mucho más. Use Vanced Manager para instalar YouTube Vanced con relativa facilidad."
    },
    {
      "title": "Vanced Music",
      "description": "Vanced Music tiene el mismo objetivo que YouTube Vanced, pero esta aplicación se enfoca en YouTube Music. Cuenta con relativamente menos características en comparación con Vanced pero aún así tiene muchas cosas que esperas como bloqueo de anuncios y reproducción en segundo plano, ¡todo dentro de la música de YouTube!"
    },
    {
      "title": "Características principales de YouTube Vanced",
      "description": "- Tema negro amigable con OLED y tema oscuro _(gris oscuro)_ además del tema blanco.\n- Bloquea todos los anuncios\n- Te permite reproducir vídeos en segundo plano o en el modo Imagen en Imagen (PiP) (solo en Android 8+)\n- Los controles de deslizado le permiten controlar el brillo y el volumen con gestos hacia arriba y hacia abajo (con relleno configurable).\n- Función de auto repetición que te permite hacer bucle de vídeos.\n- El nuevo diseño de la caja de comentarios o el minireproductor de tablet pueden ser cambiados a las versiones de tablet que son muy similares a la versión anterior (sin embargo, tiene algunos errores)."
    },
    {
      "title": "Personalización",
      "description": "- Te permite anular opciones de Códec como forzar H264 para dispositivos antiguos o VP9, esto también le permite forzar la reproducción HDR o apagar 60fps si prefiere una experiencia cinematográfica. (Las configuraciones de dispositivos personalizados para estas características se pueden encontrar en nuestro [servidor de Discord](https://discord. gg/Vanced) o XDA)\n- Forzar la resolución de vídeo por defecto tan alta o baja como desee, e incluso anular la resolución de la pantalla para la reproducción nítida 4k en cualquier dispositivo. También te permite cambiar la velocidad de reproducción predeterminada a cualquier lugar entre 0.25x a 2x (asumiendo que tu dispositivo es lo suficientemente potente)\n- Te permite cambiar los anuncios en el inicio, la mayoría de los anuncios en la interfaz de usuario, anuncios de merch, publicaciones de la comunidad, ventas de películas, información de banner compacto (como la información del COVID-19), quitar comentarios por completo, eliminar la caja de películas y mucho más!"
    },
    {
      "title": "SponsorBlock",
      "description": "- Tiene la característica principal de omitir segmentos patrocinados (donde un [YouTuber](https://en.wikipedia.org/wiki/YouTuber) anuncia un servicio o producto en medio de un vídeo)\n- También soporta saltar otras categorías, como intros, outros y autopromoción.\n- Utiliza la API [encontrada aquí](https://sponsor.ajay.app). Puedes encontrar más información sobre cómo funciona\n- También te permite enviar tus propios segmentos a la API y contribuir a la comunidad más amplia\n- Control completo sobre si omitir automáticamente una categoría de segmento o mostrar un botón para omitir, o simplemente no saltarlo en absoluto.\n- Resalta el segmento con un color específico basado en su categoría en la línea de tiempo de reproducción."
    },
    {
      "title": "Platafomas",
      "description": "Las aplicaciones están disponibles sólo para dispositivos Android y no hay planes de soportar ninguna otra plataforma en este momento"
    },
    {
      "title": "Diferencia entre root y no-root",
      "description": "#### Root:\nLa variante root de Vanced reemplaza sin problemas a la aplicación oficial de YouTube. Como resultado, puedes abrir directamente los enlaces de YouTube o llamarlos a través de Google Assistant a través de la aplicación modificada Vanced.\n\n#### No-Root:\n- Si tienes un dispositivo que es difícil de rootear, o no desea rootear su dispositivo diario de primera mano, debería optar por la variante no root.\n- Dado que el nombre del paquete de la variante no raíz es diferente de la aplicación de YouTube, pueden coexistir. Ten en cuenta que necesitas instalar una aplicación adicional de acompañamiento (Vanced microG) para poder iniciar sesión con tu cuenta de YouTube/Google.\n- Además, tienes que configurar manualmente Vanced como la aplicación predeterminada para abrir enlaces de YouTube.\n- Sin embargo, la variante no root es mucho más sencilla de instalar y usar, así que te recomendamos que te quedes con la variante no raíz a menos que realmente necesites reemplazar la aplicación de YouTube de stock en tu teléfono."
    }
  ]
}
