{
  "data": [
    {
      "title": "ما هو يوتيوب فانسد؟ ",
      "description": "يوتيوب فانسد هو نسخة معدلة من يوتيوب مع ميزات إضافية لجعل تجربتك على يوتيوب أفضل! تشمل هذه الميزات: - تشغيل في الخلفية ، - صورة داخل صورة (PiP) ، - مظهر أسود (متوافق مع شاشة أُوليد) ، - إزالة الإعلانات (يتطلب تفعيل من الإعدادات) ، - تجاوز الدقة القصوى (السماح بتشغيل الفيديو بدقة أعلى من الشاشة) ، - ...وأكثر بكثير! لمزيد من المعلومات ، قم بزيارة <https://vancedapp.com>"
    },
    {
      "title": "أين زر التنزيل؟",
      "description": "بالطبع ، لن تسمح غوغل بوجود نسخة معدلة من التطبيق الخاص بها في متجرها ، لذا لا تبحث عنها في متجر غوغل ، فهذه تطبيقات مزيفة. يمكن تنزيل تطبيقات يوتيوب فانسد وتثبيته بإستخدام مدير فانسد الذي يمكن العثور عليه على موقعنا الرسمي: <https://vancedapp.com> ولكن يمكنك أيضًا الحصول عليه من [GitHub repo] (https://github.com/YTVanced/ VancedManager / جميع الإصدارات/الأحدث)"
    },
    {
      "title": "هل يقوم يوتيوب فانسد بحديث نفسه تلقائياً؟",
      "description": "لا ، لايقوم بذلك. سيرسل لك مدير فانسد إشعاراً عندما يكون هنالك تحديث. يمكنك أيضاً الإنضمام إلى [سيرفر دسكورد] (https://discord.gg/Vanced) أو متابعة [قناة التيليكرام] (https://t.me/Vanced) للحصول على آخر الأخبار وإشعارات التحديث أيضاً."
    },
    {
      "title": "هل يمكن لـ يوتيوب فانسد تنزيل مقاطع الفيديو؟",
      "description": "لا يتضمن يوتيوب فانسدأي ميزة لتنزيل الفيديو ولن يفعل ذلك أبداً.العديد من مقاطع الفيديو متوفرة للتنزيل مجاناً في [بلدان محددة] (https://support.google.com/youtube/answer/6141269). بالنسبة لبقية العالم ، يرجى الحصول على يوتيوب بريميوم. مرة أخرى ، لن يقوم يوتيوب فانسد أبداً بإضافة أداة تنزيل فيديو إلى التطبيق أو أي شيء مشابه. كان هذا هو سبب إغلاق العديد من تعديلات يوتيوب في الماضي لأن غوغل لا تحب الأشخاص الذين يقومون بتنزيل محتوى محمي بحقوق الطبع والنشر من نظامهم الأساسي ، لذا لا تطلب ذلك !!!"
    },
    {
      "title": "لماذا لا تعمل إيماءات التمرير؟",
      "description": "إذا كانت لديك التعليقات معروضة في الجزء السفلي (المكان القديم) في إعدادات فانسد> إعدادات التخطيط (Layout)، فقم بتعطيلها وأعد تشغيل التطبيق. إذا لم يفلح ذلك ، فقم بإيقاف التطبيق ومسح بياناته."
    },
    {
      "title": "الترجمة غير متوفرة؟",
      "description": "هذه ليست مشكلة متعلقة بـ فانسد أو يوتيوب. لا تحتوي كل مقاطع الفيديو على تسميات توضيحية."
    },
    {
      "title": "هل تأخذ تبرعات؟",
      "description": "نحن لا نقبل التبرعات! أي نوع من التبرعات تحت أي ظرف من الظروف وأي مواقع أو روابط أو منشورات تطلب تبرعات هي ببساطة وهمية. ولكن إذا كنت تريد دعم مطوري فانسد ، فيمكنك تنزيل متصفح Brave بإستخدام [هذا الرابط] (https://brave.com/kev231) و AdGuard بإستخدام [هذا الرابط] (https://adguard.com/en/welcome.html?aid=31141)."
    },
    {
      "title": "كيفية جعل تخطيط المشغل يختفي تلقائياً؟",
      "description": "يمكنك تهيئته في يوتيوب فانسد > الإعدادات> إمكانية الوصول. إذا فشلت الإعدادات في الفتح أو لم تعمل ، فإنتقل إلى إعدادات إمكانية الوصول في جهازك وقم بتعطيل مضخم الصوت ، وتبديل الوصول ، والشرح المباشر."
    },
    {
      "title": "لماذا إستخدام ملفات APK المنقسمة؟",
      "description": "لأن:\n1. يستخدمه تطبيق الأسهم لذلك فانسد يستخدمه أيضاً.\n2. يقوم فقط بتثبيت اللغات التي تحددها لتقليل إستهلاك التخزين.\n 3. يحتوي على الإصدار الوحيد من APK الأساسي الذي يتطلبه جهازك. بالطبع، يمكن لمدير فانسد أو المطورين تحويله إلى ملف APK عادي واحد ، لكننا كسولون جداً للقيام بذلك. تحتاج فقط إلى التوافق مع ما لدينا... لا تقلق على الرغم من ذلك ، يقوم مدير فانسد بكل العمل الشاق من أجلك،لذا فقط انقر فوق زر\"تثبيت\"."
    },
    {
      "title": "لماذا يختلف اللون في شاشة بدء التشغيل عن المظهر؟",
      "description": "يتم أخذ لون خلفية شاشة بدء التشغيل من لون إطار عمل أندرويد للتأكد من أنه يتغير وفقاً لموضوع النظام. يمكنك إستخدام [Substratum] (https://play.google.com/store/apps/details؟id=projekt.substratum) أو [Swift Installer] (https://play.google.com/store/apps/details ؟ id = com.brit.swiftinstaller) أو تطبيق مشابه لتغيير اللون."
    },
    {
      "title": "هل يجب علي إعادة تنزيل ملفات التثبيت؟",
      "description": "يمكن أن تتلف الملفات لأسباب مختلفة ويمكن أن تسبب مشاكل بعد ذلك. لتجنب ذلك ، يمكنك إختيار تنزيلها مرة أخرى لضمان سير عملية التثبيت بسلاسة."
    },
    {
      "title": "لماذا لا يحتوي إصدار الروت على إذن الميكروفون؟",
      "description": "يحدث هذا إذا كان يوتيوب فانسد الخاص بك محدثاً."
    },
    {
      "title": "ما هو مشغل ExoPlayer v1؟",
      "description": "إنها نسخة قديمة من مشغل الوسائط الحالي الذي يستخدمه يوتيوب. قد تحصل على أداء واستقرار أفضل عند استخدامه."
    },
    {
      "title": "كيفية تمكين الإعدادات المخفية؟",
      "description": "في إعدادات يوتيوب فانسد، انقر فوق قسم \"حول\" 6-7 مرات لتمكينه. هذا فقط يُمَكّن إعدادات ترميز الفيديو الإضافية."
    },
    {
      "title": "How to make YouTube Vanced as default app?",
      "description": "كما يقول العنوان ، كان الكثير من المستخدمين يسألون عدة مرات كيف يمكنهم جعل YouTube Vanced افتراضيًا لفتح الروابط من تطبيقات أخرى (مثل المتصفحات وتطبيقات المراسلة وأي تطبيق آخر).\n\nبالنسبة إلى الروت، لا داعي للقلق لأنه تم تعيينه افتراضيًا بالفعل حيث يتم استبدال YouTube Vanced بـ يوتيوب الأصلي.\n\nبالنسبة لغير الروت، تم تقسيم الحلول بين OneUI و MIUI والباقي. لا يمكننا توفير حلول لكل نظام تشغيل موجود ، وقد تحتاج إلى استخدام Google بنفسك.",
      "fields": [
        {
          "title": "OneUI users:",
          "content": "You have to make the YouTube app open links with another app. Set the \"Go to supported URLs\" to \"in other app\"."
        },
        {
          "title": "MIUI users:",
          "content": "Open Settings and search for \"Default apps\" or navigate to Apps > Manage apps > [hit the three dots in the right corner] > Default apps > Opening links. After apps get listed, scroll down until you find YouTube or YouTube Vanced and tap it. Then, set the \"**Open supported links**\" setting as \"**Open**\" instead of \"Ask every time\" or \"Don't open\"."
        },
        {
          "title": "AOSP وواجهة مستخدم مخصصة أخرى (OOS و ColorOS و EMUI وما إلى ذلك):",
          "content": "1. اختر \"اسأل في كل مرة\" لكل من تطبيق يوتيوب الأصلي و vanced.\n\n2. افتح Google Chrome.\n\n3. ابحث عن بعض مقاطع فيديو YouTube على Google.\n\n4. افتح الروابط مع تطبيق YouTube vanced وقم بتعيينها كما هو الحال دائمًا.\n\n5. ارجع إلى الإعدادات حيث قمت بتعيين \"السؤال في كل مرة\" على YouTube ، وقم بتغيير ذلك إلى \"عدم الفتح في هذا التطبيق\"."
        }
      ]
    },
    {
      "title": "Why the root variant doesn't work with microG Core?",
      "description": "1. You need to have at least the [pico](https://github.com/opengapps/opengapps/wiki/Pico-Package) variant of GApps to run Vanced.\n\n2. You can’t run Vanced with microG Core without Google Play Services Framework which is available in all GApps packages and it's a required library.\n\n3. If you are worried about your privacy & don’t want to use GApps but still want to use watch YouTube without ads, then the [web version](https://youtube.com) is always available."
    },
    {
      "title": "Why casting doesn't work?",
      "description": "For users with latest v16.16.38 non-root variant, there's a bug in upstream microG. Until that resolves, please wait for updates or roll back to v15 versions. Root users will no issues with casting if they are using Google Play Services."
    },
    {
      "title": "What is APK Signing?",
      "description": "You are reading this because you are not using Vanced Manager or you may have installed Vanced from an unofficial source.\nJust use Vanced Manager!\n\nYou can safely download Vanced Manager from:\n- Official site <https://vancedapp.com>\n- [GitHub repository](https://github.com/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Is YouTube Vanced on Play Store?",
      "description": "NO!\nAgain, DO NOT install or even try to search for any fake apps named \"YouTube Vanced\" or similar on the Play Store or any app stores to install Vanced.\n\nWe only have [Vanced Guide](https://play.google.com/store/apps/details?id=com.vanced.faq), and it's the only official app published on Play Store.\n\nIf you find any other app with our icon and name, report it as impersonation and give it a bad review.\n\nOur apps can only be found at <https://vancedapp.com>."
    },
    {
      "title": "Why is Vanced not showing up in home screen or app drawer?",
      "description": "You are reading this because you are not using Vanced Manager or you may have installed Vanced from an unofficial source.\nJust use Vanced Manager!\n\nYou can safely download Vanced Manager from:\n- Official site <https://vancedapp.com>\n- [GitHub repository](https://github.com/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Why aren't videos playing?",
      "description": "Try restarting the app. It might also because of your internet connection or your device."
    },
    {
      "title": "Why am I having the 480p limit?",
      "description": "Due to the COVID-19, Google is restricting data usage of several countries. This happens on the server and affects both Vanced and stock YouTube users.",
      "fields": [
        {
          "title": "Workarounds:",
          "content": "1. Connect to a VPN of a different region.\n2. Use the [web version](https://youtube.com)\n3. Since the 480p restriction is only for phones and not tablets, you can change the device model in YouTube Vanced to overcome the restriction.\n\n#### How to change the device model?\n1. Open YouTube Vanced.\n2. Go to Settings\n3. Tap the `Vanced Settings`\n4. Enable hidden settings:\n  - Scroll down and tap on the `About` section till you get a message saying `Hidden settings enabled`.\n5. Go to `Codec override`\n6. Set manufacturer to `Samsung` and model to `SM-T865`.\n7. Restart the app.\n\nAfter restarting, the 480p limit should be gone."
        }
      ]
    },
    {
      "title": "How to hide the microG notification?",
      "description": "To hide microG the notification, you can disable battery optimization for microG and reboot your device.\n\nIf the notification is still there after reboot, disable microG notifications by holding on to the notification, toggle it off and tap Save.\n\nDisabling app notifications can be done in different ways depending on the Android user interface. If you don't know how to disable it, try using Google for learning how to disable it."
    },
    {
      "title": "Does 1440p look better on my 1080p screen?",
      "description": "Yes, but only if the video ratio is something like 18:9, 21:9, ... You can enable `Stats for nerds` in Settings > General to confirm it.\n\nTo enable higher resolutions, go to Vanced settings > Video settings and turn on `Max resolution` then restart the app."
    }
  ]
}
