{
  "data": [
    {
      "title": "ڤانسد",
      "description": "يهدف يوتيوب فانسد إلى أن يكون إصداراً أفضل من يوتيوب. يتضمن حظر الإعلانات والنمط الأسود وغير ذلك بكثير. اِستَخدِمْ مُدير فانسد لتثبيت يوتيوب فانسد بسهولة."
    },
    {
      "title": "موسيقى يوتيوب فانسد",
      "description": "موسيقى يوتيوب فانسد له نفس الهدف مثل يوتيوب فانسد، لكن هذا التطبيق يركز على موسيقى يوتيوب. يعد هذا أقل ثراءً بالميزات نسبياً مقارنةً بـ يوتيوب فانسد ولكنه لا يزال يتميز بالعديد من الأشياء التي تتوقعها مثل حظر الإعلانات والتشغيل في الخلفية ، كل ذلك داخل موسيقى يوتيوب فانسد!"
    },
    {
      "title": "ميزات يوتيوب فانسد الرئيسية",
      "description": "- مظهر أسود مناسب لـ لشاشة اوليد وثيم داكن - (ويعرف أيضاً باسم الرمادي الداكن).\n _ بالإضافة إلى المظهر الأبيض. \n- يحجب جميع الإعلانات.\n - يسمح لك بتشغيل مقاطع الفيديو في الخلفية أو في وضع صورة داخل صورة (PiP) (فقط على أندرويد 8 فما فوق).\n - تسمح لك عناصر التحكم في التمرير بالتحكم في السطوع والصوت بإيماءات لأعلى ولأسفل. \n- ميزة التكرار التلقائي التي تسمح لك بتكرار مقاطع الفيديو.\n - يمكن تبديل التخطيط للأجهزة اللوحية وكذلك موضع التعليقات بين الجديد والقديم (قد تكون هنالك بعض المشاكل في هذا الخيار)."
    },
    {
      "title": "التخصيص",
      "description": "- يسمح لك بتجاوز خيارات الترميز مثل فرض H264 للأجهزة القديمة أو VP9 ، وهذا يسمح لك أيضًا بفرض تشغيل HDR أو إيقاف تشغيل 60 إطاراً في الثانية إذا كنت تفضل تجربة سينمائية. (يمكن العثور على تكوينات الجهاز المخصصة لهذه الميزات على [سيرفر دسكورد] (https://discord.gg/Vanced) أو XDA) - فرض دقة الفيديو الافتراضية عالية أو منخفضة كما تريد ، بل وتجاوز دقة الشاشة لتشغيل بدقة 4K على أي جهاز.\nكما يسمح لك بتغيير سرعة التشغيل الافتراضية إلى أي مكان يتراوح بين 0.25x إلى 2x (بافتراض أن جهازك قوي بما يكفي) - يسمح لك بتبديل الإعلانات المنزلية ، ومعظم إعلانات واجهة المستخدم ، وإعلانات البضائع ، ومشاركات المجتمع ، وبيع الأفلام ، ومعلومات البانر المدمجة (مثل معلومات COVID-19)، وإزالة التعليقات بالكامل، والفيلم المضغوط، وإزالة رف الفيلم وغير ذلك الكثير!"
    },
    {
      "title": "حظر المروج",
      "description": "- يتميز بإمكانية تخطي شرائح المروج (حيث يعلن [YouTuber] (https://en.wikipedia.org/wiki/YouTuber) عن خدمة أو منتج في منتصف الفيديو) \n- يدعم أيضاً تخطي الفئات الأخرى ، مثل المقدمات والنهايات والترويج الذاتي. \n- يستخدم API [الموجود هنا] (https://sponsor.ajay.app). يمكنك العثور على مزيد من المعلومات حول كيفية عملها.\n - يسمح لك أيضًا بإرسال شرائحك الخاصة إلى API والمساهمة في المجتمع الأوسع\n - تحكم كامل في تخطي فئة المقطع تلقائياً أو إظهار زر للتخطي ، أو ببساطة عدم تخطيه على الإطلاق. \n- يبرز المقطع باللون المحدد بناءً على فئته في المخطط الزمني للتشغيل."
    },
    {
      "title": "المنصات",
      "description": "التطبيقات متاحة فقط لأجهزة الأندرويد ولا توجد خطط لدعم أي منصات أخرى في الوقت الحالي"
    },
    {
      "title": "الفرق بين الروت وبدون الروت",
      "description": "#### الروت: \nيحل إصدار الروت لـ يوتيوب فانسد محل تطبيق يوتيوب الرسمي بسلاسة. نتيجة لذلك ، يمكنك فتح روابط يوتيوب مباشرة أو الإتصال بها بإستخدام مساعد غوغل من خلال تطبيق يوتيوب فانسد المعدل.\n #### بدون الروت:\n - إذا كان لديك جهاز يصعب إجراء عملية الوصول له ، أو إذا كنت لا تريد إجراء عملية الروت لجهازك اليومي بشكل مباشر ، فيجب عليك اختيار إصدار بدون الروت. \n- نظراً لأن اسم حزمة البدون روت تختلف عن تطبيق يوتيوب الأصلي، فيمكنهما التعايش. لاحظ أنك بحاجة إلى تثبيت تطبيق مصاحب إضافي (Vanced microG) لتتمكن من تسجيل الدخول بحسابك على يوتيوب/غوغل. \n\n - علاوة على ذلك ، يجب عليك تعيين يوتيوب فانسد يدوياً بإعتباره التطبيق الإفتراضي لفتح روابط يوتيوب.\n\n - ومع ذلك ، فإن إصدار بدون الروت أسهل في التثبيت والإستخدام ، لذلك نوصيك بالإلتزام بالإصدار بدون روت إلا إذا كنت بحاجة فعلاً إلى إستبدال تطبيق يوتيوب الأصلي على هاتفك. "
    }
  ]
}
