{
  "data": [
    {
      "title": "Vanced",
      "description": "YouTube Vanced, YouTube uygulamasından daha iyi olmayı hedefleyen; reklam engelleme, siyah tema gibi bir çok ekstra özelliklere sahip olan sürümüdür. Vanced Manager uygulamasını kullanarak YouTube Vanced'ın cihazınla uyumlu olan en son sürümünü indirebilirsin."
    },
    {
      "title": "Vanced Music Vanced",
      "description": "YouTube Music Vanced, YouTube Vanced'da olduğu gibi aynı amaca sahip fakat, YouTube Music için geliştiriliyor. YouTube Vanced'a kıyasen daha az özelliklere sahip olabilir ama yine de genel olarak ihtiyaç duyulan reklam engelleme ve arka planda oynatma gibi ana özelliklere sahip!"
    },
    {
      "title": "YouTube Vanced'ın ana özellikleri",
      "description": "- OLED dostu siyah tema\n- Reklam engelleyici\n- Arka planda ve Resim içinde Resim (PiP) (sadece Android 8+ için) modunda video oynatma özelliği\n- Yukarı-aşağı kaydırma kontrolleri ile anında parlaklık ve ses ayarlarını değiştirebilme\n- Tekrar oynatma özelliği\n- Yeni yorumlar kısmı ve tablet mini oynatıcısı özellikleri. Tablet sürümüne geçiş yapabilme özelliği ile eski sürüme benzer görünüm elde etme (gerçi biraz sorun yaşatabilir)"
    },
    {
      "title": "Kişiselleştirme",
      "description": "- Çözücü ayarlarını değiştirme imkânı ile eski tip cihazlarda H264 veya VP9 çözücüsü kullanarak, sinematik deneyim elde etmek için HDR formatında oynatma ve 60fps özelliğini kapatma imkânı sunar. (Cihaza özel yapılandırmalar, Discord sunucumuzda veya XDA'de bulunabilir)\n- Varsayılan video çözünürlüğünü en yüksek veya en düşük olarak ayarlama ve ayrıca ekran çözünürlüğü kısıtlamasını aşarak, her cihazda keskin 4k video çözünürlüğü ile oynatabilme imkânı sunar. Ayrıca cihazının desteklemesi durumunda oynatma hızını 0.25x ile 2x arasında değiştirebilme imkânı sunuyor.\n- Ana ekranda ve diğer yerlerde çıkan ürün satışı dahil çeşitli reklamları, topluluk iletilerini, film satışlarını, bilgilendirme kutularını (COVID-19 bilgilendirmeleri gibi), yorumlar kısmını, film fragmanlarını, film önerisi kısmı gibi birçok can sıkan yerleri gizleme/kaldırma imkânı sunar."
    },
    {
      "title": "SponsorBlock (reklam engelleme)",
      "description": "- Sponsor kısımlarını atlayabilme özelliği (YouTuber'ların video aralarına sıkıştırdıkları tanıtıcı reklamlar)\n- Ayrıca videoda giriş ve kapanış sahnelerini ve kişisel tanıtım kısımlarını da atlayabilme özelliği\n- Detaylarına bu linkten ulaşabileceğin API yapısını kullanır.\n- Ayrıca kendin için belirlediğin atlama kısımlarını API aracılığı ile paylaşma imkânı sunarak, topluluğa katkıda bulunabilirsin.\n- Atlama özelliği üzerinde tam hakime sahip olursun. Otomatik olarak veya buton göstermesini sağlayarak butona dokunma sonrasında atlayabilme imkânı veya istersen atlama özelliğini kapatma imkânı da sunar.\n- Atlamalık kısımları kategori bazlı renklerle zaman çubuğunda renkli biçimde de gösterebilir."
    },
    {
      "title": "Platformlar",
      "description": "Uygulamalar yalnızca Android cihazlarda kullanılabilir ve diğer işletim sistemleri için bir plan bulunmamaktadır"
    },
    {
      "title": "Root ve root'suz sürüm arasındaki fark",
      "description": "#### Root: \nVanced'in root sürümü sorunsuzca resmî YouTube uygulamasının yerine geçer. Bu sayede YouTube bağlantılarını doğrudan veya Google asistan üzerinden Vanced'te açabilirsiniz.\n\n#### Root Olmayan:\n- Rootlanması zor bir cihazınız varsa veya her gün kullandığınız cihazınızı rootlamak istemiyorsanız root olmayan seçeneği seçmelisiniz. \n- Rootlu bir cihaza da kurulabilir. Root olmayan sürümün paket adı stok YouTube uygulamasından farklı olması nedeniyle root olan ve olmayan sürümlerin ikisini aynı anda kullanabilirsiniz. Rootsuz Vanced ile YouTube'a Google hesabınızla giriş yapabilmek için ek bir uygulama (Vanced microG) yüklemeniz gerektiğini unutmayın. \n- Dahası YouTube bağlantılarını açmak için varsayılan uygulama olarak Vanced'i elle ayarlamanız gerekiyor. \n- Bunlara karşın root olmayan sürümü kurup kullanmak daha kolaydır, bu nedenle telefonunuzdaki stok YouTube uygulamasını gerçekten değiştirmeniz gerekmedikçe root olmayan sürümü kullanmanızı öneririz."
    }
  ]
}
