{
	"troubleshooting": [
		{
			"title": "Temel sorun giderme",
			"description": "A) Aşağıdaki uygulamaların verilerini ve ön belleklerini silin \n\n(I) Root olmayan varyant için Vanced/Vanced Music ve microG\n(II) Root varyant için Vanced/Vanced Music ve Google Play Servisleri\n\nB) YouTube Vanced'i baştan kurun\n\nÖNEMLİ UYARI: İşlemler arasında cihazınızı yeniden başlatın"
		},
		{
			"title": "Oturum açma sorunları",
			"description": "Sık karşılaşılan bazı hataları gösteren birtakım görüntüler aşağıdadır, izleyeceğiniz çözümde size fikir verebilir.",
			"fields": [
				{
					"title": "\"İnternet bağlantınızı kontrol edin\" diyen bir hata alıyorsanız",
					"content": "Şu video kılavuzu izleyin: https://youtu.be/S5sTXRTrD5Y. MicroG'nin uygulama verilerini de silin."
				},
				{
					"title": "Giriş yaparken \"Çevrim dışısınız, indirilenlere göz atın\" uyarısıyla karşılaşıyorsanız",
					"content": "1. Clear DATA of both Vanced microG and Google Play services\n2. UNINSTALL both \"Vanced microG\" and Vanced.\n\n3. Reboot if you want.\n\n4. Reinstall both APKs[microG and Vanced) but make sure you install microG before you install Vanced. Install via Vanced Manager or sai using files provided in #installation note in group\n\n5. Now login.\n\nNOTE: If you're still having issues with Vanced giving connection errors (even after installing microG first), receiving notifications, etc, make sure you disable battery optimization for the Vanced and microG app. \n\nInstructions to do so vary on your device manufacturer. You can folloe guides like https://dontkillmyapp.com or search it up."
				},
				{
					"title": "Vanced uygulaması Google oturumunuzu kapatıyorsa",
					"content": "It happens because your device OS' heavy battery optimization killing microg services/activities which are responsible for logins.\n\nTo fix this, disable battery optimization for microG using https://dontkillmyapp.com OR searching it up"
				},
				{
					"title": "Vanced'in root olmayan sürümünde Gsuite hesabını kullanıp bağlantı üzerine sık sık hata alan (ör. \"Çevrim dışısınız\", \"İnternet bağlantınızı kontrol edin\") kullanıcılar için",
					"content": "•Log into your gsuite account admin console(https://admin.google.com/)\n\n• Search for device management\n\n• Go to setup and disable \"Mobile Management\"\n\n• That's it and it will get fixed."
				},
				{
					"title": "Huawei geçici çözümü - 1",
					"content": "For those who updated microg to most recent version but now are facing login issues\n\n1. Uninstall current installed Vanced microg.\n\n2. Download \"Vanced microg 0.2.12.203315 version\" from mediafire v15 link and install it. Link for mediafire v15 here - https://del.dog/Mediafireonlyv15\n\n3. You should be able to login now."
				},
				{
					"title": "Huawei geçici çözümü - 2",
					"content": "1. Uninstall both vanced and microg if you already installed. Then reinstall only microg(latest available)\n\n2. Then open microg app settings\n\n3. Turn off both \"Google Cloud Messaging\" and \"Google device registration\".\n\n4. Add your account through microg itself.\n\n5. Then install Vanced."
				},
				{
					"title": "Huawei geçici çözümü - 3",
					"content": "1. First install the old microG version (remove the current one installed but keep the apk for it - you need it later). \n\nmicrog_YouTube_Vanced_0.2.4-105_16052019_2.apk (get from the old files link on vancedapp.com site)\n\n2. Then open YouTube Vanced and try logging in again until it shows the error message. Try to reload it by tapping the error message. \n\n3. Now install the newer microG version again and restart vanced. It should be logged in again and everything should work again.\n\nNOTE: Now make sure u disable battery optimization for both microg and vanced using dontkillmyapp.com otherwise your device software might kill microg and you might have to repeat all above steps again to fix login."
				}
			]
		},
		{
			"title": "Vanced Manager",
			"fields": [
				{
					"title": "Vanced Manager logoda takılıp kalması/çökmesi hatası",
					"content": "Manager uygulamasının verilerini silin > İnternet bağlantısını kesin > Manager uygulamasını açın > İnternet'e bağlanın."
				},
				{
					"title": "INSTALL_FAILED_INVALID_APK: No packages staged",
					"content": "Önce Google Play mağazasındaki Youtube uygulamasını yükleyin, sonra Vanced Manager'ı açıp Vanced'i güncelleyin."
				},
				{
					"title": "Vanced Manager \"Lütfen sabırlı olun\" yazan pencerede takılıp kalıyorsa",
					"content": "Önce Google Play mağazasındaki Youtube uygulamasını yükleyin, sonra Vanced Manager'ı açıp Vanced'i güncelleyin."
				},
				{
					"title": "If you face \"Error downloading Microg/Vanced\" or installation got stuck while installing microg/vanced app",
					"content": "Manager uygulamasının verilerini silin ve sonra yüklemeye devam edin, BU SIRADA İŞLEM BİTENE DEK BAŞKA BİR UYGULAMAYA GEÇMEYİN."
				}
			]
		},
		{
			"title": "Notification fix",
			"description": "For notification fix, a white background or Vanced not appearing under \"Google Cloud Messaging\", see below",
			"fields": [
				{
					"title": "For Non-Root",
					"content": "1. Install Vanced microG first then YouTube Vanced.\n\n2. Login with your Google account\n\n3. \na) Disable battery optimization for microg(the guide dontkillmyapp.com is suggested).\n\nb)**Open \"Vanced microG\" additional settings then continue on with this guide:\n\ni) https://youtu.be/Q-5YFmFWVok"
				},
				{
					"title": "If Vanced is not showing up under GCM or it shows up as unregistered",
					"content": "Try EITHER of the following:\n\n1. Remove your google account from account settings. The account used by vanced has old Blue background color with small g logo.\n\n2. Clear data of microG then login. \n\nOR\n\nIf above workaround doesn't work, reinstall vanced."
				},
				{
					"title": "For Root",
					"content": "Make sure \"Scheduled Digest\" is off in youtube settings and your notifications sounds are correct and set.\n\nYou can try using \"notification manager\" app which keeps track of all your notification at one place so in case if you are dismissing your notifications, you can access the same again from that app."
				},
				{
					"title": "\"İşlem başarısız çünkü apk dosyaları geçersiz veya bozulmuş\" gibi hatalar için",
					"content": "• Manager ayarlarını açın ve indirilen dosyaları temizleyin\\n\\n• Ardından Manager uygulamasının verilerini silin ve sonrasında Vanced'i yükleyin."
				}
			]
		},
		{
			"title": "Force closing issues",
			"description": "If Vanced app is crashing/force closing on startup",
			"fields": [
				{
					"title": "Nonroot",
					"content": "1) If the non-root Vanced app is force closing before installing MicroG, uninstall both Vanced app and MicroG. Then install MicroG first, then Vanced. The issue should be fixed.\n\n2) If the non-root Vanced app is force closing without installing microg, install microg. [If you don't want to login, don't login and only install microg apk as vanced has a dependency on microg for connecting with Google services]"
				},
				{
					"title": "Root",
					"content": "1) If your root version of Vanced is force closing upon opening the app, uninstall stock YouTube app updates. If this doesn't help, disable/uninstall your substratum/swift themes overlays.\nAt last resort, if nothing helps, give the community/staff a logcat.\n\n2) If your root version of Vanced is force closing in middle of app when it's in foreground/active or playing a video, grab your logcats and find:\n\n(a)- Unsatisfiedlinkerror: \nSol:- Open file manager and go to root storage.\nThen open \"system/app/youtube/lib\" OR \"Data/app/com.google.android.youtube/lib\" and rename \n\narm64-v8a to arm64\n\narmeabi-v7a to arm\n\nand it will get fixed.\n\nAlso, if both \"arm and arm64\" are not there in that directory above, try getting both from official YT apk or ask your friends and extract it there in that directory\n\n(b)- Notehitelisted \"com.google.android.youtube\":\nSol:- Check whitelisting from here(todo)\n\nIf you don't know how to get logs, check bugreport note"
				},
				{
					"title": "If Vanced crashes in the middle of playback (when playing in background mode)",
					"content": "Since this issue is only caused by aggressive battery optimization present in various OEM skins such as MIUI, Emui, ColorOS, etc..., it is recommended to disable battery optimization for both Vanced and MicroG app. \n\nInstructions to do so vary on your device manufacturer, so we can’t really assist with helping you disable it. You can try using a site like \"dontkillmyapp.com\", OR using Google and searching “[phone manufacturer] [phone model] [Android version] disable battery optimization”\n\nHowever, if you still have this issue, provide #bugreport on telegram or in discord with the details it requires and logs must be there so that Mods can take a look what's actually causing. Also, make sure to grab logs specific to vanced, NOT your whole SYSTEM."
				}
			]
		},
		{
			"title": "Uninstall on reboot",
			"description": "If the root version of YouTube Vanced/ YouTube Music Vanced is disappearing/uninstalling/reverting back to stock on reboot,\n\nWe have 2 solutions available for you",
			"fields": [
				{
					"title": "Solution 1",
					"content": "Stick to the non-root version until the devs fix this."
				},
				{
					"title": "Solution 2",
					"content": "REQUIREMENTS: \n\nVanced Manager 2.1.0 or newer\nA root manager like Es File Explorer or Root Browser\nStep 1: Go into /data/adb/service.d/ and edit the script Music.sh and or Vanced.sh\n\nThey both should look like something similar to this :\n\nwhile  [ \"`getprop sys.boot_completed | tr -d '\n'`\" != \"1\" ] ; do sleep 1; done \n\nStep 2: Change value of  \"do sleep 1; done\"   to   \"do sleep 2; done\"\n\nStep 3: Reboot or Restart Device\n\nIf that doesn't work try to add more sleep time between do & done\n\n——————————————————\n\nif that doesn't work, maybe your device need more time before it mounts root vanced youtube/music apk.\njust modify vanced.sh and or music.sh, \ninsert a new sleep line between 'while' and 'mount' line like:\n\n#!/system/bin/sh\nwhile [ \"`getprop sys.boot_completed | tr -d '\n' `\" != \"1\" ]; do sleep 1; done\nsleep 10\nmount -o bind /data/adb/Vanced/base.apk /data/app/com.google.android.youtube-...."
				},
				{
					"title": "Video arka planda yürütülürken Vanced çöküyorsa",
					"content": "Bu durumun tek sebebi bazı telefon üreticilerinin MIUI, EMUI, ColorOS vb. işletim sistemlerinde uyguladıkları agresif pil optimizasyonlarıdır, bu yüzden Vanced ve MicroG için pil optimizasyonlarının devre dışı bırakılması tavsiye edilir. \n\nBunun için yönergeler cihazın üreticisine göre değişmektedir. dontkillmyapp.com gibi bir siteden yardım alabileceğiniz gibi Google'a \"[cihaz markası] [cihaz modeli] [Android sürümü] pil optimizasyonu (veya \"disable battery optimization\")\" yazarak arayabilirsiniz.\n\nEğer yine de bu sorunla karşılaşıyorsanız Telegram veya Discord'da gerekli ayrıntılarla birlikte #bugreport etiketini kullanarak bildirebilirsiniz. Vanced için hata kaydını eklemeyi unutmayın, tüm sistemin hata kaydını GÖNDERMEYİN."
				}
			]
		},
		{
			"title": "Advertisements in Vanced",
			"description": "If you are seeing ads in YouTube Vanced or Vanced Music, read this by xfileFIN:\n\n> I need to get it myself to track it down. As simple layout hiding won't work for that.\nNot sure how they decide who gets them, it's all server side.\nWhat I do know is that I can't just hide the layout because the same layout is used for the actual videos as well. The code just decides whether or not it shows the ad badge.\nWell I could easily hide the ad badge but it would still show the actual ad video, just without labeling it as ad.\nI need to get the ad myself to track it down in the code since obfuscation makes it hard.\n\nThe home screen and search ads (added by Google) are region based and will not be shown if you’re not in the region it’s active in. Those advertisements are not added by vanced team in any way so if you point your finger at us, we would laugh at you. \n\nDevs already know that you are getting ads in your region. Please wait patiently for updates till all ads gets blocked. Until then, enjoy vanced and don't spam chat with same.\n\nThe temporary solution to fix it would be clearing data and cache of the app or waiting for future updates.",
			"fields": [
				{
					"title": "Çözüm - 1",
					"content": "Geliştiriciler bunu halledene dek root olmayan sürümleri kullanın."
				},
				{
					"title": "Çözüm - 2",
					"content": "GEREKENLER: \n\nVanced Manager 2.2.0 veya daha yenisi\n1. Manager ayarlarını açın > Root Betiği Uyku Süresi (bu ayarın görünmesi için root olmalısınız) değerini 2'ye ayarlayın > Kaydedin, cihazınızı yeniden başlatın. Eğer Vanced/Music yine görünmezse bu değeri değiştirip tekrar deneyin"
				}
			]
		},
		{
			"title": "History",
			"description": "If you are facing issues where videos watched/search results are not getting recorded by Vanced i.e., history being not working, this is how you get the history working:\n\n• For users who are rooted regardless of which variant (Non-Root or Root) you are using,\n\n> Make sure you whitelist *s.youtube.com in your Ad-Blocker.\n\n⚠️NOTE for Adaway users: If whitelisting the URL didn't work for you, tap on \"host sources\" and untick \"stevenblack\" and apply, then reboot and your history will work.⚠️\n\n• For Non-Root users:\n\n> Make sure you're on v14.10.53 or higher for the app to save your watch history. If history still doesn't update, then you need to merge your brand account in (YouTube Settings-https://www.youtube.com/account_advanced) to get history working. (Merging process will clean the current history.)\n\n⚠️NOTE for Adaway users using VPN Ad-Blocking instead of root based Ad-Blocking: If you are not using brand account, make sure to whitelist *s.youtube.com url in allowed list then apply the changes.⚠️"
		},
		{
			"title": "APP loading issues",
			"description": "İzlediğiniz videolar, arama sonuçları vb. Vanced'de görünmüyorsa, geçmiş özelliğini düzeltmek için:\n\n• Root olan kullanıcılar için (Vanced'in root olması ve olmamasıyla ilgisiz olarak)\n\n> Reklam engelleme yazılımınızda *.syoutube.com adresine izin verin (beyaz listeye alın).\n\n⚠️Adaway kullanıcıları: Eğer bu URL'yi beyaz listeye almak işinizi görmediyse \"Host Sources\" (Sunucu Kaynakları) içinden \"stevenblack\" işaretini kaldırın, sonra cihazınızı yeniden başlatın. Böylece geçmiş özelliği çalışır hâle gelecektir.⚠️\n\n• Root olmayan kullanıcılar için:\n\n> İzleme geçmişinizi kaydetmek için v14.10.53 veya daha üstünü kullanın. Eğer izleme geçmişiniz kaydedilmiyor/güncellenmiyor ise marka hesabınızı Youtube ayarları (https://www.youtube.com/account_advanced) içinden hesabınızla birleştirmelisiniz.(Hesapları birleştirmek mevcut geçmişinizi temizleyecektir.)\n\n⚠️Adaway VPN reklam engellemesini kullananlar için: Eğer marka hesabı kullanmıyorsanız *s.youtube.com adresini beyaz listeye ekleyip kaydedin.⚠️"
		},
		{
			"title": "Picture-in-Picture issues",
			"fields": [
				{
					"title": "Vanced açılış ekranında takılıp kalıyorsa",
					"content": "1. Uçak modunu açın.\n2. Youtube Vanced'i açın.\n3. Değişim kaydı penceresinde kapat (close) seçin.\n4. Uçak modunu kapatın.\n5. Vanced'i tekrar açın.\n\nXDA'dan rocco6victor'a teşekkürler"
				},
				{
					"title": "Vanced'in yüklenmesi hiç bitmiyorsa",
					"content": "1. Youtube Vanced ve MicroG için pil optimizasyonunu dontkillmyapp.com yardımıyla devre dışı bırakın ve sonra cihazınızı yeniden başlatın.\n2. Sorun düzelmiş olmalı."
				}
			]
		},
		{
			"title": "App download issues",
			"description": "⚠️PiP (ekran içinde ekran, görüntü içinde görüntü) ile ilgili sorunları bildirmeyin⚠️\n• Vanced, Android'de olan PiP'i kullandığı için PiP sistem tarafından kontrol edilir. PiP ile ilgili bir sorun yaşıyorsanız işletim sisteminizi suçlayın.\nMX Player, VLC gibi başka uygulamalar kendi PiP'lerini kullandıkları için Android PiP'iyle ilgili sorunlar onlarda olmayabilir veya tam tersi.\n\n• PiP, Android 8 ve sonrasında mevcuttur.\n\n• PiP'i etkinleştirmek için Youtube uygulaması ayarlarını açın > Genel > Ekran içinde ekranı etkinleştirin.\n\n> PiP'i MIUI'da etkinleştirmek için:\nGizlilik koruması > Yönet > Özel izinler > Görüntü içinde görüntü\n\nV15.43.32'de resmî Youtube uygulamasından kaynaklanan bir PiP hatası var, Google'ın çözmesi gerekiyor."
		},
		{
			"title": "Detach",
			"fields": [
				{
					"title": "Workaround 1",
					"content": "In case the detach methods listed above doesn't work for you, you can try the ones down below:\n\nUsing Titanium backup app(needs pro version)\n\n• Open titanium backup \n\n• Search for youtube and Click on it \n\n• Swipe left to access special features \n\n• Click on Attach to market \n\n• Then again go to special features \n\n• Click on 'detach from market' \n\n• Done"
				},
				{
					"title": "Workaround 2",
					"content": "NOTE: Auto-Updates must be disabled in play store before doing this.\n\n1. Create \"Detach.txt\" in the following location /sdcard/ (equivalent to /storage/emulated/0/) write \"YouTube\" in that text file without quotes. You can also download the Detach.txt from Magisk module name Detach and remove the # in front of YouTube.\n\n2. Flash Detach module in Magisk manager.\n\n3. Flash Daily Job Scheduler (djs) in Magisk manager.\n\n4. Reboot\n\n5. Open Terminal and type \"su -c detach -t\" and set it to run once every hour.\n\n6. Done!\n\nPlay Store updates its database file on a random rhythm, sometimes several times a day. Once in a while (like once every two weeks), Play Store will show an update for Youtube, but it will go away when the script has run again by djs."
				}
			]
		},
		{
			"title": "Fix For SAI/Vanced Manager errors",
			"description": "Below are some known reasons you might face when you don't follow instructions, so read the appropriate cause with its solution and fix your problem.",
			"fields": [
				{
					"title": "INSTALL_FAILED_VERSION_DOWNGRADE",
					"content": "Uninstall stock yt updates. Make sure Stock YouTube version is lower than vanced version you are installing now."
				},
				{
					"title": "INSTALL_FAILED_UPDATE_INCOMPATIBE",
					"content": "Just uninstall any vanced app that you have installed from any other source then install vanced.  Otherwise uninstall \"vanced microG\" > reboot device > then install vanced microG first then Vanced. If error still comes, use SAI to install the vanced split apks manually. These apk files are located in \n\"android / data / com.vanced.manager / files / vanced / nonroot / \""
				}
			]
		},
		{
			"title": "Live-Stream issues",
			"description": "Solution: Follow this guide > https://youtu.be/R9asMVCQkAU. Also, disable your external ad-blockers/vpn/proxy/custom settings in vanced. Keep stock settings if you don't wanna see any issues.",
			"fields": [
				{
					"title": "INSTALL_FAILED_VERSION_DOWNGRADE",
					"content": "Resmî Youtube uygulamasının güncelleştirmelerini kaldırın. Fabrika sürümü Youtube uygulamasının sürüm sayısının, yüklemek istediğiniz Vanced sürümünden daha küçük olması gerekir."
				},
				{
					"title": "INSTALL_FAILED_UPDATE_INCOMPATIBLE",
					"content": "Başka kaynaktan indirdiğiniz tüm Vanced uygulamalarını kaldırıp Vanced'i öyle yükleyin. Yoksa \"Vanced MicroG\"yi kaldırın > Cihazı yeniden başlatın > Önce Vanced MicroG'yi ardından Vanced'i yükleyin. Eğer hâlâ hata alıyorsanız Vanced'i yüklemek için SAI'yı kullanın. Yüklenecek apk dosyaları aşağıdaki konumdadır \n\"android / data / com.vanced.manager / files / vanced / nonroot / \""
				},
				{
					"title": "INSTALL_PARSE_FAILED_NOT_APK",
					"content": "Cihazınızın dilini İngilizceye çevirin ve Vanced'i öyle kurun. Kurulumdan sonra dili tekrar değiştirebilirsiniz. Youtube Vanced'i kurmak istediğiniz dili Vanced Manager içinden ayarladığınıza emin olun."
				},
				{
					"title": "INSTALL_FAILED_NO_MATCHING_ABIS",
					"content": "\"Default\" yerine \"legacy\" sürümü indirin"
				},
				{
					"title": "INSTALL_FAILED_INVALID_APK: Split config.en was defined multiple times",
					"content": "apks dosyasındaki split_config.en apk dosyasını silin ve bundan sonra kurmayı deneyin (apks dosyası bir arşiv dosyasıdır, içindeki bir apk dosyasını kolayca silebilirsiniz)"
				},
				{
					"title": "INSTALL_FAILED_DUPLICATE_PERMISSION",
					"content": "MicroG'yi kaldırın > yeniden başlatın > SAI kullanarak Vanced'i kurun > MicroG'yi kurun\n\nMicroG kurulmuyorsa onu da SAI ile kurun."
				},
				{
					"title": "Unable to install the app because it conflicts with an already installed app with same package name",
					"content": "MicroG'yi kaldırın > yeniden başlatın > SAI kullanarak Vanced'i kurun > MicroG'yi apk yükleyiciyle kurun\nMicroG kurulmuyorsa onu da SAI ile kurun."
				},
				{
					"title": "APP IS INCOMPATIBLE WITH THIS DEVICE",
					"content": "Resmî Vanced yansılarından indirirken \"default\" yerine \"legacy\" mimarisini seçin."
				},
				{
					"title": "INSTALL_PARSE_FAILED_NO_CERTIFICATES",
					"content": "Kurulum yönergesini okumadığınız için Vanced'i yüklerken imza onayını kaldırmadınız veya olumlu sonuç veren bir yöntem denediniz. Yapmanız gereken, imza onaylamasını devre dışı bırakmak, bunun için farklı bir yöntem deneyin."
				},
				{
					"title": "INSTALL_FAILED_INVALID_INSTALL_LOCATION",
					"content": " Cihazınızın ayarlar menüsünden geliştirici seçeneklerine ulaşın ve \"uygulamaları harici depolamayı kullanmaya zorla\" seçeneğini kapatın. Bundan sonra Vanced'i SAI ile kurabilirsiniz."
				},
				{
					"title": "INSTALL_FAILED_USER_RESTRICTED: Install canceled by user",
					"content": "Bilinmeyen kaynaklardan uygulama yüklenmesi için SAI'ye izin verin. Bundan sonra Vanced'i yükleyebilirsiniz."
				},
				{
					"title": "INSTALL_FAILED_INTERNAL_ERROR: Permission Denied",
					"content": "Cihazınızın ayarlar menüsündeki geliştirici seçeneklerinden MIUI optimizasyonunu kapatın."
				}
			]
		},
		{
			"title": "Whitelisting",
			"description": "If you face crashes on YouTube Vanced root variants for whitelisting causes, you can try this guide from this link(https://www.xda-developers.com/how-to-fix-device-not-certified-by-google-error) and see if it solves for you.\n\n Alternatively, if link didn't helps, clean flash your ROM to fix this issue or check with a different ROM."
		},
		{
			"title": "Black screen video fix",
			"description": "Solution: clearing data of Youtube Vanced and subsequently reinstalling it should fix the issue. If it doesn't, try a Reboot &\nCheck if black screen issue solves. \n\nIf problem persist, factory reset your device or change the ROM."
		},
		{
			"title": "Content Restrictions",
			"description": "In English it is callled \"restricted mode\"\nIn arabic it is called \"وضع تقييد المحتوى\"\n\nTo solve issue of lesser search results, do this\n\n1. Go to settings > General\n\n2. Find \"restricted mode\" and turn it off.\n\nIf you're in a country that Google hates, use a vpn."
		},
		{
			"title": "View count change",
			"description": "To change the view count from crores/lakhs to millions, do this:\n\n\nSolution:\n\n1. Go to settings (of your phone)\n\n2. Go to system \n\n3. Go to language preferences\n\n4. Add a language as English (US) \n\n5. Drag this language above your current one.\n\n6. Go to youtube and enjoy ⚡\n\nThanks to @ROG_OK from telegram Vanced group for finding the fix."
		},
		{
			"title": "Captions",
			"description": "If you face caption issues such as random subtitles of different languages on an english video, here's what you have to do;\nSet the caption language to your region language in your caption settings.\n\nTo access caption settings, head to device settings > accessibility > captions\n\nOr\n\nYouTube settings > captions"
		},
		{
			"title": "HDR brightness Workaround",
			"description": "Use the swiping features to turn the brightness to its maximum"
		},
		{
			"title": "Settings crashes",
			"description": "Turn off your fingerprint and go in the settings and do your setting, after it's done, turn it back on. It won't crash again after that, even if you keep going in it unless you restart your device."
		},
		{
			"title": "Ayarlar çöküyor",
			"description": "Parmak izini kapat, daha sonra uygulama ayarlarına git ve ihtiyacın olan ayarları yap. Uygulama ayarlarıyla işin bittikten sonra parmak izi ayarını tekrar açabilirsin. Cihazını yeniden başlatana dek uygulama ayarları tekrar çökmeyecektir."
		}
	]
}
