{
  "data": [
    {
      "title": "Vanced",
      "description": "Cieľom YouTube Vanced je byť lepšou verziou YouTube. Zahŕňa blokovanie reklám, čiernu tému a oveľa viac. Na relatívnu ľahkú inštaláciu YouTube Vanced použite Vanced Manager."
    },
    {
      "title": "YouTube Music Vanced",
      "description": "YouTube Music Vanced má rovnaký cieľ ako YouTube Vanced, ale sa zameriava na YouTube Music. V porovnaní s Vanced obsahuje relatívne menej funkcií, ale stále zahŕňa veľa tých, ktoré očakávate. Sú nimi napríklad blokovanie reklám a prehrávanie na pozadí, dostupné vo vnútri aplikácie YouTube Music Vanced!"
    },
    {
      "title": "Hlavné funkcie YouTube Vanced",
      "description": "- OLED priateľská pravá čierna téma a tmavá téma (aka tmavošedá), okrem klasickej bielej témy\n- Blokovanie všetkých reklám\n- Možnosť prehrávať videá na pozadí alebo v režime Obraz v obraze (PiP) (iba v Androide 8+)\n- Ovládacie prvky potiahnutia umožňujú ovládať jas a hlasitosť gestami hore a dole (s konfigurovateľným odsadením)\n- Funkcia automatického opakovania, ktorá umožňuje opakovať videá\n- Nové rozloženie komentárov/miniprehrávača je možné prepínať do verzií tabletu, ktoré sú veľmi podobné starej verzii (je to však trochu chybové)"
    },
    {
      "title": "Prispôsobenie",
      "description": "- Umožňuje prepísať možnosti kodeku, ako napríklad vynútenie H264 pre staré zariadenia alebo VP9. Taktiež umožňuje vynútiť prehrávanie HDR alebo vypnúť rýchlosť 60 snímkov za sekundu, v prípade, že uprednostňujete filmový zážitok. (Vlastné konfigurácie zariadení pre tieto funkcie nájdete na našom [Discord serveri](https://discord.gg/Vanced) alebo XDA)\n- Vynútenie predvoleného rozlíšenia videa je možné na vysoké alebo nízke, podľa vašich preferencií, dokonca s prepínaním rozlíšenia obrazovky pre prehrávanie vo formáte 4k na ľubovoľnom zariadení. Umožňuje tiež zmeniť predvolenú rýchlosť prehrávania na ľubovoľnú hodnotu medzi 0,25x až 2x (za predpokladu, že je vaše zariadenie dostatočne výkonné)\n- Umožňuje prepínať domáce reklamy, väčšinu UI reklám, reklamy na tovar, príspevky z komunity, predaj filmov, informácie kompaktných bannerov (napríklad informácie o COVID-19), ale aj úplne odstraňovanie komentárov, kompaktných filmov, odstraňovanie ponuky filmov a mnoho ďalšieho!"
    },
    {
      "title": "SponsorBlock",
      "description": "- Obsahuje možnosť preskočiť sponzorské segmenty (kde [YouTuber](https://en.wikipedia.org/wiki/YouTuber) inzeruje službu alebo produkt uprostred videa)\n- Podporuje tiež preskakovanie ďalších kategórií, ako sú intrá, outrá a sebapropagácia\n- Používa API [dostupné tu](https://sponsor.ajay.app). Pomocou daného odkazu nájdete viac informácií o tom, ako funguje\n- Umožňuje vám tiež odoslať do API svoje vlastné segmenty a prispieť tak k širšej komunite\n- Predstavuje úplnú kontrolu nad tým, či sa má automaticky preskočiť kategória segmentu alebo zobraziť tlačidlo na preskočenie, alebo či sa jednoducho nepreskočí vôbec\n- Zvýrazňuje segment konkrétnou farbou na základe jeho kategórie na časovej osi prehrávania"
    },
    {
      "title": "Platformy",
      "description": "Aplikácie sú k dispozícii iba pre zariadenia so systémom Android a momentálne sa neplánuje podpora iných platforiem"
    },
    {
      "title": "Rozdiel medzi Root a Non-Root",
      "description": "#### Root:\nRoot verzia Vanced plynulo nahrádza oficiálnu aplikáciu YouTube. Vďaka tomu môžete otvárať YouTube odkazy alebo vyvolať ich pomocou Asistenta Google, priamo prostredníctvom upravenej aplikácie Vanced.\n\n#### Non-Root:\n- Ak máte zariadenie, ktoré je ťažko rootovateľné, alebo ak vôbec nechcete rootovať svoje zariadenie, mali by ste sa rozhodnúť pre non-root verziu.\n- Vzhľadom na to, že názov balíka verzie non-root je odlišný od oficiálnej aplikácie YouTube, môžete ich vlastniť súčasne. Upozorňujeme, že aby ste sa mohli prihlásiť pomocou svojho YouTube/Google účtu, musíte si nainštalovať ďalšiu sprievodnú aplikáciu (Vanced microG).\n- Okrem toho musíte manuálne nastaviť Vanced ako predvolenú aplikáciu na otváranie odkazov na YouTube.\n- Keďže inštalácia a použitie non-root verzie je oveľa jednoduchšie, odporúčame vám použiť práve túto verziu, pokiaľ skutočne nepotrebujete nahradiť oficiálnu YouTube aplikáciu na svojom telefóne."
    }
  ]
}
