{
	"data": [
		{
			"title": "Základné riešenie problémov",
			"description": "A) Vymažte údaje a vyrovnávaciu pamäť z \n\n(I) Vanced/Vanced Music a microG pre Non-Root verziu\n(II) Vanced/Vanced Music a Služby Google Play pre Root verziu\n\nB) Preinštalujte YouTube Vanced\n\nDÔLEŽITÉ UPOZORNENIE: Medzi procesmi reštartujte zariadenie"
		},
		{
			"title": "Problémy s prihlásením",
			"description": "Ďalej sú popísané niektoré bežné chyby spolu so snímkami obrazovky, vďaka ktorým môžete zistiť, ktoré riešenie je vhodné pre váš problém.",
			"fields": [
				{
					"title": "Ak sa zobrazuje chybové hlásenie „skontrolujte svoje internetové pripojenie“",
					"content": "Postupujte prosím podľa tohto video sprievodcu: https://youtu.be/S5sTXRTrD5Y. Skúste vyčistiť aj dáta aplikácie microG."
				},
				{
					"title": "Ak máte problémy s prihlásením a vidíte chybovú hlášku „Ste offline, preskúmajte stiahnuté súbory“",
					"content": "1. Vymažte ÚDAJE aplikácií Vanced microG a Google Play Services\n2. ODINŠTALUJTE „Vanced microG“ aj Vanced.\n\n3. Ak chcete, reštartujte zariadenie.\n\n4. Preinštalujte oba súbory APK (microG a Vanced) s tým, že najskôr nainštalujete microG. Aplikácie inštalujte pomocou Vanced Manager alebo sai, zo súborov poskytnutých v poznámke #inštalácia\n\n5. Teraz sa prihláste.\n\nPOZNÁMKA: Ak stále máte problémy s tým, že Vanced hlási chyby v pripojení (dokonca aj po nainštalovaní aplikácie microG ako prvej), prijímaní upozornení atď., nezabudnite deaktivovať optimalizáciu batérie pre aplikácie Vanced a microG.\n\nPokyny sa líšia podľa výrobcu zariadenia. Môžete postupovať podľa pokynov ako https://dontkillmyapp.com alebo ich vyhľadať."
				},
				{
					"title": "Ak sa Vanced odhlasuje z vášho Google účtu",
					"content": "Stáva sa to kvôli veľkej optimalizácie batérie operačným systémom vášho zariadenia. To spôsobuje vynútené zavretie služieb/aktivít microG, ktoré sú zodpovedné za prihlásenie.\n\nNa vyriešenie tohto problému deaktivujte optimalizáciu batérie pre microG pomocou https://dontkillmyapp.com ALEBO riešenie vyhľadajte"
				},
				{
					"title": "Pre používateľov, ktorí používajú účet Gsuite v Non-Root verzii Vanced a často čelia problémom s pripojením (chyby ako „Ste offline“, „Skontrolujte svoj internet“ atď.)",
					"content": "•Log into your Gsuite account [admin console](https://admin.google.com/)\n\n• Search for device management\n\n• Go to setup and disable \"Mobile Management\"\n\n• That's it and it will get fixed."
				},
				{
					"title": "Huawei riešenie 1",
					"content": "For those who updated microG to most recent version but now are facing login issues\n\n1. Uninstall current installed Vanced microG.\n\n2. Download \"Vanced microG 0.2.12.203315 version\" from Mediafire v15 link and install it. [Link for Mediafire v15 here](https://del.dog/Mediafireonlyv15)\n\n3. You should be able to login now."
				},
				{
					"title": "Huawei riešenie 2",
					"content": "1. Ak máte nainštalovené aplikácie Vanced a microG, odinštalujte ich. Následne znova nainštalujte iba microG (najnovšie dostupné)\n\n2. Otvorte nastavenia aplikácie microG\n\n3. Vypnite možnosti „Google Cloud Messaging“ a aj „Registrácia zariadenia Google“.\n\n4. Pridajte svoj účet prostredníctvom samotného microG.\n\n5. Nakoniec nainštalujte Vanced."
				},
				{
					"title": "Huawei riešenie 3",
					"content": "1. First, install the old Vanced microG version{particularly microg_YouTube_Vanced_0.2.4-105_16052019_2.apk using [this link](https://www.mediafire.com/file/4mw2q6ajq85g2io/microg_YouTube_Vanced_0.2.4-105_16052019_2.apk/file)}. Make sure to uninstall the current version to install the above version and save the latest APK file as you will be needing it later.\n\n2. Then open YouTube Vanced and try logging in again until it shows the error message. Try to reload it by tapping the error message. \n\n3. Now install the newer microG version again and restart vanced. It should be logged in again and everything should work again.\n\nNOTE: Now make sure u disable battery optimization for both microG and vanced using https://dontkillmyapp.com otherwise your device software might kill microG and you might have to repeat all above steps again to fix login."
				}
			]
		},
		{
			"title": "Vanced Manažér",
			"fields": [
				{
					"title": "Vanced manažér uviazol na logu alebo zlyhal",
					"content": "Vymažte aplikačné údaje manažéra > Vypnite internet > Otvorte aplikáciu manažér > Zapnite internet."
				},
				{
					"title": "INSTALL_FAILED_INVALID_APK: No packages staged",
					"content": "Nainštalujte si oficiálny YouTube z Obchodu Play a potom aktualizujte Vanced pomocou Vanced manažéra."
				},
				{
					"title": "Ak sa najnovší Vanced manažér zasekne na obrazovke „Prosím, buďte trpezliví“, urobte to",
					"content": "Nainštalujte si oficiálny YouTube z Obchodu Play a potom aktualizujte Vanced pomocou Vanced manažéra."
				},
				{
					"title": "Ak sa pri inštalácii aplikácie microG/Vanced zobrazí hlásenie „Chyba pri sťahovaní microG/Vanced“ alebo sa inštalácia zasekla",
					"content": "Vymažte aplikačné údaje manažéra a potom pokračujte v inštalácii ale NEODCHÁDZAJTE Z APLIKÁCIE, DOKÝM PROCES NESKONČÍ."
				}
			]
		},
		{
			"title": "Inštalácia zlyhala, pretože aplikácia je v konflikte s už nainštalovanou aplikáciou. Odinštalujte aktuálnu verziu aplikácie a potom to skúste znova (INSTALL_FAILED_UPDATE_INCOMPATIBLE)",
			"description": "Stáva sa to používateľom s OneUI a Oxygen OS, keď aktualizujú svoj systém z Android 10 na Android 11 a čelili tomu aj niektoré custom ROM.\n\nPre tento problém sú k dispozícii 3 riešenia",
			"fields": [
				{
					"title": "Ak nemáte Root, použite ADB",
					"content": "1). Nainštalujte Android Debug Bridge; Sprievodca - https://www.xda-developers.com/install-adb-windows-macos-linux/amp/. \n\n2) Odomknite telefón. \n\n3) Povoľte režim vývojára (10 krát ťuknite na Číslo zostavy v Nastaveniach - Informácie o telefóne - Informácie o softvéri). \n\n4) Povoľte ladenie zariadenia cez USB v časti Nastavenia - Možnosti pre vývojárov. \n\n5) Pripojte telefón k počítaču. \n\n6) Otvorte príkazový riadok (CMD), zmeňte adresár: „cd C:/Windows/adb/“ a stlačte kláves Enter.\n\n7) Keď je už váš telefón pripojený a CMD otvorený, v CMD spustite príkaz „adb devices“. Vo vašom telefóne sa zobrazí výzva niečo ako „Chcete pripojiť svoj telefón k počítaču?“ Stlačte Áno. \n\n8) Spustite cmd príkaz „adb uninstall com.vanced.android.youtube“. \n\n9) Následne môžete nainštalovať Vanced Manager a taktiež aj najnovšiu verziu YouTube Vanced"
				},
				{
					"title": "Ak máte Root,",
					"content": "1) Použite program root explorer a prejdite do root úložiska. \n\n2) Ak sa snažíte nainštalovať YouTube Vanced, nájdite priečinok „data/app/com.vanced.android.youtube-....“ alebo ak YouTube Music Vanced priečinok „data/app/com.vanced.android.apps.youtube.music-....“  \n\n3) Ak ste také priečinky našli, jednoducho ich odstráňte a potom pokračujte v inštalácii YouTube Vanced alebo YouTube Music Vanced prostredníctvom aplikácie Vanced Manager."
				},
				{
					"title": "Ak obe vyššie uvedené metódy zlyhajú",
					"content": "Túto chybu môže vyriešiť obnovenie továrenských nastavení. Obnovenie však vykonajte len v krajnom prípade."
				},
				{
					"title": "Ak narazíte na chyby ako „Operácia zlyhala, pretože súbory apk sú neplatné/poškodené“",
					"content": "• Prejdite na nastavenia manažéra a vymažte stiahnuté súbory\\n\\n• Potom vymažte aplikačné údaje manažéra a pokračujte v inštalácii Vanced."
				}
			]
		},
		{
			"title": "Oprava upozornení",
			"description": "Pre opravu upozornení, biele pozadie alebo ak sa Vanced nezobrazuje pod „Google Cloud Messaging“, pozrite nižšie",
			"fields": [
				{
					"title": "Pre Non-Root",
					"content": "1. Nainštalujte Vanced microG ako prvé a až potom YouTube Vanced.\n\n2. Prihláste sa pomocou svojho účtu Google\n\n3. \na) Zakážte optimalizáciu batérie pre microG (odporúča sa sprievodca dontkillmyapp.com).\n\nb) **Vo „Vanced microG“ otvorte ďalšie nastavenia a pokračujte touto príručkou:\n\ni) https://youtu.be/Q-5YFmFWVok"
				},
				{
					"title": "Ak sa Vanced nezobrazuje v rámci GCM alebo sa zobrazuje ako neregistrovaný",
					"content": "Vyskúšajte VŠETKY z nasledujúcich spôsobov:\n\n1. Odstráňte svoj Google účet z nastavení účtu. Účet používaný pre Vanced má staré modré pozadie s malým g logom.\n\n2. Vymažte údaje microG a potom sa prihláste.\n\nALEBO\n\nAk vyššie uvedené riešenie nefunguje, preinštalujte Vanced."
				},
				{
					"title": "Pre Root",
					"content": "Uistite sa, že je v nastaveniach YouTube vypnutá možnosť \"Naplánovaný súhrn\" a zvuky upozornení sú nastavené a správne.\n\nMôžete skúsiť použiť aplikáciu „Správca upozornení“, ktorá sleduje všetky vaše upozornenia na jednom mieste, takže v prípade, že ich odmietate, môžete k nim znova získať prístup z danej aplikácie."
				}
			]
		},
		{
			"title": "Problémy s vynúteným zatváraním",
			"description": "Ak je aplikácia Vanced pri štarte vynútene zatváraná/padá",
			"fields": [
				{
					"title": "Non-Root",
					"content": "1) Ak je Non-Root verzia aplikácie Vanced vynútene zatváraná ešte pred inštaláciou MicroG, odinštalujte obe, Vanced aj MicroG. Následne začnite inštaláciou MicroG a až potom Vanced. Problém by mal byť vyriešený.\n\n2) Ak je Non-Root verzia aplikácie Vanced vynútene zatváraná bez inštalácie microG, nainštalujte microG. [Ak sa nechcete prihlásiť, neprihlasujte sa a nainštalujte si iba microG apk, kvôli závislosti Vanced na microG pre pripojenie k službám Google]"
				},
				{
					"title": "Root",
					"content": "1) Ak sa vaša Root verzia aplikácie Vanced vynútene zatvára po otvorení, odinštalujte všetky aktualizácie oficiálnej YouTube aplikácie. Ak to nepomôže, zakážte/odinštalujte prekrytia svojich tém substratum/swift.\nV poslednom prípade, ak nič nepomáha, poskytnite komunite/zamestnancom logcat.\n\n2) Ak sa vaša Root verzia aplikácie Vanced vynútene zatvára pri behu aplikácie, keď je v popredí/aktívna alebo prehráva video, vezmite svoje logcat a nájdite:\n\n(a) - Unsatisfiedlinkerror: \nSol:- Otvorte správcu súborov a choďte do root úložiska.\nPotom otvorte „system/app/youtube/lib“ ALEBO „Data/app/com.google.android.youtube/lib“ a premenujte \n\narm64-v8a na arm64\n\narmeabi-v7a na arm\n\na napraví sa to.\n\nTiež, ak v danom adresári vyššie nie sú „arm a arm64“, skúste získať obe z oficiálneho YouTube apk alebo si ich vypýtajte od svojich priateľov a rozbaľte do daného adresára\n\n(b) - Notehitelisted \"com.google.android.youtube\":\nSol:- Skontrolujte bielu listinu odtiaľto(todo)\n\nAk neviete, ako získať logy, pozrite si poznámky o chybách"
				},
				{
					"title": "Ak Vanced padá uprostred prehrávania (v režime prehrávania na pozadí)",
					"content": "Vzhľadom na to, že tento problém je spôsobený iba agresívnou optimalizáciou batérie prítomnou v rôznych OEM nadstavbách, ako sú MIUI, EMUI, ColorOS atď., odporúča sa deaktivovať optimalizáciu batérie pre aplikáciu Vanced aj MicroG.\n\nPokyny sa však líšia v závislosti od výrobcu zariadenia, takže vám nemôžeme pomôcť pri deaktivácii. Môžete skúsiť použiť web ako „dontkillmyapp.com“, ALEBO použiť Google a vyhľadať výraz „[výrobca telefónu] [model telefónu] [verzia Android] deaktivácia optimalizácie batérie“\n\nAk aj napriek tomu máte stále tento problém, poskytnite #bugreport na telegrame alebo na discorde s požadovanými podrobnosťami a logmi. Moderátori si tak budú môcť pozrieť, čo to vlastne spôsobuje. Nezabudnite však poskytnúť logy špecifické pre Vanced, NIE pre celý váš SYSTÉM."
				}
			]
		},
		{
			"title": "Odinštalovanie pri reštarte",
			"description": "Ak root verzia YouTube Vanced/YouTube Music Vanced zmizne/odinštaluje sa/vráti sa späť na pôvodnú pri reštarte,\n\nSú k dispozícii 2 riešenia",
			"fields": [
				{
					"title": "Riešenie 1",
					"content": "Použite Non-Root verziu, kým to vývojári neopravia."
				},
				{
					"title": "Riešenie 2",
					"content": "POŽIADAVKY:\n\nVanced Manager 2.2.0 alebo novší\nKrok 1: Prejdite do nastavení manažéra > Čas spánku Root skriptu (aby sa táto možnosť zobrazila, mali by ste byť v režime root), kde nastavte hodnotu na 2 > stlačte uložiť, reštartujte zariadenie a skontrolujte, či Vanced/Music aplikácie stále miznú. Ak áno, skúste upraviť hodnotu, kým nebude po reštarte všetko v poriadku"
				}
			]
		},
		{
			"title": "Reklamy vo Vanced",
			"description": "Ak sa vám zobrazujú reklamy v aplikáciách YouTube Vanced alebo Vanced Music, prečítajte si tento článok xfileFIN:\n\n> Potrebujem to vypátrať sám. Jednoduché skrytie rozloženia pre to nebude fungovať.\nNie som si istý ako rozhodujú, kto reklamy získa, je to všetko na strane servera.\nViem, že nemôžem iba skryť rozloženie, pretože rovnaké rozloženie sa používa aj pre samotné videá. Kód iba rozhoduje o tom, či je zobrazený odznak reklamy.\nNapriek tomu, že odznak reklamy by som mohol ľahko skryť, stále by bolo zobrazované video reklamy, iba s rozdielom jeho označenia.\nPotrebujem vypátrať reklamu v kóde sám, pretože zmätok to iba sťažuje.\n\nDomovská obrazovka a reklamy vo vyhľadávaní (pridané spoločnosťou Google) sú založené na regióne a nebudú sa zobrazovať, ak sa nenachádzate v regióne, v ktorom sú aktívne. Tieto reklamy nie sú nijako pridávané tímom Vanced, takže ak na nás ukážete prstom, vysmejeme sa vám. \n\nVývojári už vedia, že dostávate reklamy vo svojom regióne. Trpezlivo čakajte na aktualizácie, kým nebudú zablokované všetky reklamy. Do tej doby si užívajte Vanced a nespamujte chat týmito problémami.\n\nDočasným riešením by bolo vymazanie údajov a medzipamäte aplikácie alebo čakanie na ďalšie aktualizácie."
		},
		{
			"title": "História",
			"description": "If you are facing issues where videos watched/search results are not getting recorded by Vanced i.e., history being not working, this is how you get the history working:\n\n• For users who are rooted regardless of which variant (Non-Root or Root) you are using,\n\n> Make sure you whitelist *s.youtube.com in your Ad-Blocker.\n\n⚠️NOTE for Adaway users: If whitelisting the URL didn't work for you, tap on \"host sources\" and untick \"stevenblack\" and apply, then reboot and your history will work.⚠️\n\n• For Non-Root users:\n\n> Make sure you're on v14.10.53 or higher for the app to save your watch history. If history still doesn't update, then you need to merge your brand account in [YouTube Settings](https://www.youtube.com/account_advanced) to get history working. (Merging process will clean the current history.)\n\n⚠️NOTE for Adaway users using VPN Ad-Blocking instead of root based Ad-Blocking: If you are not using brand account, make sure to whitelist *s.youtube.com url in allowed list then apply the changes.⚠️"
		},
		{
			"title": "Problémy s načítaním aplikácií",
			"fields": [
				{
					"title": "Ak sa Vanced zasekol na úvodnej obrazovke",
					"content": "1. Zapnite režim v lietadle.\n2. Otvorte Youtube Vanced.\n\n3. Zavrite rozbaľovacie okno zoznamu zmien.\n4. Vypnite režim v lietadle.\n5. Znova otvorte Vanced.\n\nPoďakovanie patrí pre rocco6victor z XDA"
				},
				{
					"title": "Ak sa Vanced načítava donekonečna",
					"content": "1. Zakážte optimalizáciu batérie pre aplikácie YouTube Vanced a microG pomocou dontkillmyapp.com a následne zariadenie reštartujte.\n2. Problém by mal byť vyriešený."
				}
			]
		},
		{
			"title": "Problémy s obrazom v obraze (PiP)",
			"description": "⚠️Prosím, nenahlasujte problémy spojené s PIP.⚠️\n• Pip je ovládaný systémom keďže Vanced používa natívny pip pre Android. Viňte ROM za akékoľvek problémy s PIP.\nOstatné aplikácie, ako napríklad MX Player, VLC, atď., používajú svoj vlastný PIP namiesto natívneho zo systému Android, a preto nikdy nebudú čeliť takýmto problémom.\n\n• PIP je k dispozícii iba pre Android 8 a novší.\n\n• Ak chcete povoliť PIP, otvorte nastavenia aplikácie YouTube > Všeobecné > Povoliť pip\n\n> Ak chcete povoliť pip v MIUI, musíte sa uistiť, že je toto nastavenie zapnuté:\nOchrana súkromia -> Správa -> Prístupy špeciálnych aplikácií -> Obraz v obraze\n\nV najnovšej verzii V15.43.32 je pip chybou oficiálnej aplikácie YouTube, takže najskôr počkajte, kým ju Google úplne opraví."
		},
		{
			"title": "Problémy so sťahovaním aplikácií",
			"fields": [
				{
					"title": "Ak máte ťažkosti so sťahovaním Vanced súborov pomocou stránky vancedapp.com alebo nemôžete otvoriť našu stránku z dôvodu obmedzení servera alebo oblasti",
					"content": "Nášho nového manažéra môžete získať priamo [tu](https://github.com/YTVanced/VancedManager/releases/)\n\nPOZNÁMKA: Stiahnite si „manager.apk“ v latest release > assets. Nesťahujte však žiadne súbory zip ani nič iné, pretože to nie sú aplikácie."
				},
				{
					"title": "Ak máte problémy so sťahovaním a inštaláciou Vanced prostredníctvom manažéra, stále môžete na inštaláciu použiť SAI/manuálnu metódu.",
					"content": "• Odkaz na MediaFire na stiahnutie požadovaných súborov.\n>https://www.mediafire.com/folder/773e97cz2ezx1/AddFree_Youtube_BackgroundPlay_Enabled\n\n• Odkaz na AFH na stiahnutie požadovaných súborov.\n>https://androidfilehost.com/?w=files&flid=170196\n\nPOZNÁMKY:\n\nA) Vzhľadom k tomu, že máme všetky samostatné APK súbory na serveri mediafire/afh, musíte zazipovať všetky „base, architecture and language“ APK a nainštalovať ich cez SAI. Všetky 3 APK sú nevyhnutné.\nB) Manuálnu inštaláciu je možné vykonať iba prostredníctvom root, pretože vyžaduje prístup k root úložisku."
				}
			]
		},
		{
			"title": "Odpojenie YouTube",
			"description": "You can use any of the workarounds listed below to remove the YouTube app from the market.",
			"fields": [
				{
					"title": "Workaround 1(Recommended)",
					"content": "\n\nUsing [TeMiFi app](https://forum.xda-developers.com/t/app-tool-temefi-comprehensive-system-administration.3806260), Make sure the YouTube Vanced is a user app as this method won't work if Vanced is installed as a system app.\n\nIn TeMeFi select > Give root permissions > Tap on Application info > Detach package from play store > DETACH: Select package then protection level v5 > Select YouTube with package name \"com.google.android.youtube\" > Tap on 3. Invalidate the data, block any attempt.... > Yes, I accept full responsibility"
				},
				{
					"title": "Riešenie 2",
					"content": "\n\nUsing Titanium backup app(needs pro version)\n\n• Open titanium backup \n\n• Search for youtube and Click on it \n\n• Swipe left to access special features \n\n• Click on Attach to market \n\n• Then again go to special features \n\n• Click on \"detach from market\" \n\n• Done"
				},
				{
					"title": "Workaround 3",
					"content": "NOTE: Auto-Updates must be disabled in play store before doing this.\n\n1. Create \"Detach.txt\" in the following location /sdcard/ (equivalent to /storage/emulated/0/) write \"YouTube\" in that text file without quotes. You can also download the Detach.txt from Magisk module name Detach and remove the # in front of YouTube.\n\n2. Flash Detach module in Magisk manager.\n\n3. Flash Daily Job Scheduler (djs) in Magisk manager.\n\n4. Reboot\n\n5. Open Terminal and type \"su -c detach -t\" and set it to run once every hour.\n\n6. Done!\n\nPlay Store updates its database file on a random rhythm, sometimes several times a day. Once in a while (like once every two weeks), Play Store will show an update for Youtube, but it will go away when the script has run again by djs."
				},
				{
					"title": "Workaround 4",
					"content": "Switch to Non-Root variant of Vanced. This workaround should only be used as a last resort if all of the other options fail!"
				}
			]
		},
		{
			"title": "Riešenia pre chyby Vanced Manažéra/SAI",
			"description": "Nižšie uvádzame niektoré známe problémy, ktorým môžete čeliť, ak nebudete postupovať podľa pokynov. Prečítajte si teda tieto príčiny a ich riešenia pre opravu vášho problému.",
			"fields": [
				{
					"title": "INSTALL_FAILED_VERSION_DOWNGRADE",
					"content": "Odinštalujte aktualizácie oficiálnej aplikácie YouTube. Uistite sa, že oficiálna verzia YouTube je nižšia ako Vanced verzia, ktorú sa snažíte inštalovať."
				},
				{
					"title": "INSTALL_FAILED_UPDATE_INCOMPATIBE",
					"content": "Stačí odinštalovať všetky Vanced aplikácie, ktoré ste nainštalovali z akéhokoľvek iného zdroja, a potom znova Vanced nainštalovať. V opačnom prípade odinštalujte \"Vanced microG\" > reštartujte zariadenie > následne najskôr nainštalujte Vanced microG a až potom Vanced. Ak chyba stále pretrváva, použite SAI na manuálnu inštaláciu Vanced split apks. Tieto APK súbory sa nachádzajú v priečinku \n„android/data/com.vanced.manager/files/vanced/nonroot/“"
				},
				{
					"title": "INSTALL_PARSE_FAILED_NOT_APK",
					"content": "Zmeňte jazyk telefónu z indonézštiny na angličtinu a nainštalujte Vanced. Po inštalácii môžete jazyk zmeniť späť na indonézštinu. Ak vaše zariadenie nepoužíva indonézsky jazyk, uistite sa, že v aplikácii Vanced Manažér je správne vybraný jazyk, ktorý chcete nainštalovať s YouTube Vanced."
				},
				{
					"title": "INSTALL_FAILED_NO_MATCHING_ABIS",
					"content": "Namiesto predvolenej verzie si stiahnite staršiu verziu"
				},
				{
					"title": "INSTALL_FAILED_INVALID_APK: Split config.en was defined multiple times",
					"content": "Skúste odstrániť jeden apk split_config.en z apks súboru a znova spustite inštaláciu\n(apks súbor je iba zip súbor, takže z neho môžete apk ľahko odstrániť)"
				},
				{
					"title": "INSTALL_FAILED_DUPLICATE_PERMISSION",
					"content": "Odinštalujte microG > reštartujte zariadenie > nainštalujte Vanced cez SAI > nainštalujte microG\n\nAk sa microG nenainštaluje, nainštalujte ho taktiež pomocou SAI."
				},
				{
					"title": "Aplikáciu nie je možné nainštalovať, pretože je v konflikte s už nainštalovanou aplikáciou s rovnakým názvom balíka",
					"content": "Odinštalujte microG > reštartujte zariadenie > nainštalujte Vanced cez SAI > nainštalujte microG cez inštalátor balíkov\n\nAk sa microG nenainštaluje, nainštalujte ho taktiež pomocou SAI."
				},
				{
					"title": "APP IS INCOMPATIBLE WITH THIS DEVICE",
					"content": "Pri sťahovaní súborov Vanced z oficiálnych Vanced zdrojov si namiesto predvolenej architektúry stiahnite súbory staršej architektúry."
				},
				{
					"title": "INSTALL_PARSE_FAILED_NO_CERTIFICATES",
					"content": "It seems like you didn't read instructions properly and installed vanced without disabling signature verification. or you tried some method which didn't give any positive result, so the solution to both is to disable signature verification using the best method/alternative to what you used before or just use our [vanced manager](https://vancedapp.com which doesn't require you to disable signature verification."
				},
				{
					"title": "INSTALL_FAILED_INVALID_INSTALL_LOCATION",
					"content": "Prejdite do nastavení svojho zariadenia > možnosti pre vývojárov a vypnite možnosť „Vynútiť povolenie aplikácií na externom úložisku“ a potom nainštalujte aplikáciu Vanced cez SAI."
				},
				{
					"title": "INSTALL_FAILED_USER_RESTRICTED: Install canceled by user",
					"content": "Vaše zariadenie je chránené pred inštaláciou z neznámych zdrojov. Prejdite do nastavení zariadenia a povoľte neznáme zdroje pre SAI. Následne budete môcť Vanced nainštalovať."
				},
				{
					"title": "INSTALL_FAILED_INTERNAL_ERROR: Permission Denied",
					"content": "Zakážte optimalizáciu MIUI z vývojárskych možností zariadenia."
				}
			]
		},
		{
			"title": "Problémy s Live-Streamom",
			"description": "Riešenie: Postupujte podľa tejto príručky > https://youtu.be/R9asMVCQkAU. Taktiež zakážte pre Vanced váš Ad-Blocker/VPN/proxy/vlastné nastavenia. Ak nechcete čeliť žiadnym problémom, ponechajte si predvolené nastavenia."
		},
		{
			"title": "Black screen video fix",
			"description": "Solution: clearing data of Youtube Vanced and subsequently reinstalling it should fix the issue. If it doesn't, try a Reboot &\nCheck if black screen issue solves. \n\nIf problem persist, factory reset your device or change the ROM."
		},
		{
			"title": "Content Restrictions",
			"description": "In English it is callled \"restricted mode\"\nIn arabic it is called \"وضع تقييد المحتوى\"\n\nTo solve issue of lesser search results, do this\n\n1. Go to settings > General\n\n2. Find \"restricted mode\" and turn it off.\n\nIf you're in a country that Google hates, use a vpn."
		},
		{
			"title": "View count change",
			"description": "To change the view count from crores/lakhs to millions, do this:\n\n\nSolution:\n\n1. Go to settings (of your phone)\n\n2. Go to system \n\n3. Go to language preferences\n\n4. Add a language as English (US) \n\n5. Drag this language above your current one.\n\n6. Go to youtube and enjoy ⚡\n\nThanks to @ROG_OK from telegram Vanced group for finding the fix."
		},
		{
			"title": "Captions",
			"description": "If you face caption issues such as random subtitles of different languages on an english video, here's what you have to do;\nSet the caption language to your region language in your caption settings.\n\nTo access caption settings, head to device settings > accessibility > captions\n\nOr\n\nYouTube settings > captions"
		},
		{
			"title": "HDR brightness Workaround",
			"description": "Use the swiping features to turn the brightness to its maximum"
		},
		{
			"title": "Settings crashes",
			"description": "Turn off your fingerprint and go in the settings and do your setting, after it's done, turn it back on. It won't crash again after that, even if you keep going in it unless you restart your device."
		}
	]
}
