{
  "data": [
    {
      "title": "Vanced",
      "description": "یوتیوب اصلاح شده قصد دارد نسخه بهتری از یوتیوب باشد. این شامل مسدود کردن تبلیغات، تم سیاه و موارد دیگر است. از مدیریت کننده یوتیوب برای نصب یوتیوب اصلاح شده با سهولت نسبی استفاده کنید."
    },
    {
      "title": "YouTube Music Vanced",
      "description": "یوتیوب موزیک اصلاح شده همان هدف یوتیوب اصلاح شده را دارد، اما این برنامه روی یوتیوب موزیک تمرکز دارد. این نسبتاً در مقایسه با یوتیوب از ویژگی‌های غنی‌تری برخوردار است، اما همچنان موارد زیادی را دارد که شما انتظارش را دارید!"
    },
    {
      "title": "ویژگی های اصلی یوتیوب اصلاح شده",
      "description": "تم مشکی مناسب صفحه های اولد و تم تیره _(معروف به خاکستری تیره)_ علاوه بر تم سفید.\n- تمام تبلیغات را مسدود می کند\n- به شما امکان می دهد فیلم ها را در پس زمینه یا در حالت تصویر در تصویر (فقط در اندروید ۸ به بالا) پخش کنید. \n- کنترل‌های کشیدن به شما این امکان را می‌دهند که روشنایی و صدا را با حرکات بالا و پایین (با پد قابل تنظیم) کنترل کنید.\n- قابلیت تکرار خودکار که به شما امکان می دهد ویدیوها را در حالت تکرار نگه دارید.\n- تنظیم کیفیت پخش ویدیو ها می توانید در وضوح یک تبلت ویدیو ها را تماشا کنید."
    },
    {
      "title": "شخصی سازی",
      "description": "- به شما امکان می دهد گزینه های کدک مانند اجبار کردن H264 برای دستگاه های قدیمی یا VP9 را نادیده بگیرید، همچنین به شما امکان می دهد اگر یک تجربه سینمایی را ترجیح می دهید، پخش HDR را مجبور کنید یا 60 فریم در ثانیه را خاموش کنید. (پیکربندی‌های دستگاه سفارشی برای این ویژگی‌ها را می‌توانید در [سرور دیسکورد] (https://discord.gg/Vanced) یا XDA ما پیدا کنید.\n\n- وضوح تصویر پیش‌فرض را تا جایی که می‌خواهید بالا یا پایین کنید و حتی رزولوشن صفحه‌تان را لغو کنید. پخش واضح 4k در هر دستگاهی. همچنین به شما امکان می دهد سرعت پخش پیش فرض را بین 0.25x تا 2x تغییر دهید (با فرض اینکه دستگاه شما به اندازه کافی قدرتمند است) - به شما امکان می دهد تبلیغات خانگی، اکثر تبلیغات رابط کاربری، تبلیغات کالاها، پست های انجمن، فروش فیلم، اطلاعات بنر و غیره را غیرفعال کنید (مانند اطلاعات -کرونا)، نظرات را به طور کامل حذف کنید، فیلم فشرده، حذف قفسه فیلم و بسیاری موارد دیگر!"
    },
    {
      "title": "SponsorBlock",
      "description": "قابلیت رد شدن از بخش‌های حامی را دارد (جایی که یک [YouTuber](https://en.wikipedia.org/wiki/YouTuber) یک سرویس یا محصول را در وسط یک ویدیو تبلیغ می‌کند)\n - همچنین رد شدن از دسته‌های دیگر، مانند، خود تبلیغی و غیره... [در اینجا یافت می شود] (https://sponsor.ajay.app) یوتیوب از APIاستفاده می کند. می‌توانید اطلاعات بیشتری در مورد نحوه عملکرد آن بیابید\n - همچنین به شما امکان می‌دهد بخش‌های خود را به API ارسال کنید و در جامعه گسترده‌تر مشارکت کنید\n - کنترل کامل بر روی رد کردن خودکار دسته‌بندی یا نمایش دکمه‌ای برای پرش، یا نه اصلا رد شدن از آن\n - رنگ را در بخشی خاص بر اساس دسته بندی آن در جدول زمانی پخش برجسته می کند."
    },
    {
      "title": "پلتفرم ها",
      "description": "برنامه‌ها فقط برای دستگاه‌های اندرویدی در دسترس هستند و در حال حاضر برنامه‌ ما برای پشتیبانی از هیچ پلتفرم دیگری وجود ندارد"
    },
    {
      "title": "تفاوت بین کاربران روت و بدون روت",
      "description": "#### روت:\nنوع اصلی یوتیوب اصلاح شده به طور یکپارچه جایگزین برنامه اصلی یوتیوب می شود. در نتیجه، می‌توانید مستقیماً پیوندهای یوتیوب را باز کنید یا با استفاده از دستیار گوگل از طریق برنامه اصلاح‌شده یوتیوب با آنها تماس بگیرید.\n\n#### بدون روت:\n - اگر دستگاهی دارید که روت کردن آن دشوار است یا نمی‌خواهید دستگاه روزانه خود را از ابتدا روت کنید، باید نوع غیر روت را انتخاب کنید. \n- از آنجایی که نام برنامه در کاربران بدون روت با برنامه اصلی یوتیوب متفاوت است، آنها می توانند با هم وجود داشته باشند. توجه داشته باشید که باید یک برنامه همراه اضافی ( microG) نصب کنید تا بتوانید با حساب یوتیوب/گوگل خود وارد شوید. \n - علاوه بر این، باید به صورت دستی یوتیوب اصلاح شده را به عنوان برنامه پیش فرض برای باز کردن پیوندهای یوتیوب تنظیم کنید. \n- با این حال، نصب و استفاده از نوع غیر روت بسیار ساده‌تر است، بنابراین توصیه می‌کنیم از نوع غیر روت استفاده کنید، مگر اینکه واقعاً نیاز به جایگزینی برنامه اصلی یوتیوب در تلفن خود داشته باشید."
    }
  ]
}
