{
	"data": [
		{
			"title": "عیب یابی پایه",
			"description": "۱) پاک کردن اطلاعات یا حافظه کش\n\n۲) استفاده از یوتیوب و یوتیوب موزیک اصلاح شده از نوع بدون روت\n\n۳) استفاده از یوتیوب و یوتیوب موزیک اصلاح شده از نوع روت و سرویس گوگل پلی\n\n۴) نصب مجدد یوتیوب اصلاح شده\n\n>توجه مهم: بین هر کدام فرآیندهای بالا ، گوشی راه اندازی مجدد شود"
		},
		{
			"title": "مشکل در ورود",
			"description": "در زیر برخی از خطاهای رایج در اسکرین شات ها آورده شده است تا بتوانید بدانید کدام راه حل را باید دنبال کنید.",
			"fields": [
				{
					"title": "اگر خطای «لطفاً اتصال اینترنت خود را بررسی کنید» دریافت کردید",
					"content": "لطفاً این راهنمای ویدیویی را مشاهده کنید:\nhttps://youtu.be/S5sTXRTrD5Y و تلاش کنید که اطلاعات یوتیوب و microG را پاک کنید."
				},
				{
					"title": "اگر در ارتباط با ورود به سیستم با مشکلاتی روبرو هستید که می‌گویید: \"شما آفلاین هستید، دانلودها را کاوش کنید\"",
					"content": "1. داده های هر دو سرویس microG و گوگل پلی را پاک کنید\n2. هم « microG» و هم یوتیوب اصلاح شده را حذف نصب کنید.\n\n3. در هر صورت راه اندازی مجدد کنید.\n\n4. هر دو برنامه [microG و یوتیوب) را دوباره نصب کنید، اما مطمئن شوید که microG را قبل از نصب یوتیوب اصلاح شده نصب کرده اید. از طریق مدیریت کننده یوتیوب یا با استفاده از فایل های ارائه شده در یادداشت های نصب ، به صورت گروهی نصب کنید\n\n5. حالا لاگین کنید\n\nتوجه: اگر همچنان با خطاهای اتصال یوتیوب (حتی پس از نصب microG در ابتدا)، دریافت اعلان‌ها و غیره مشکل دارید، مطمئن شوید که بهینه‌سازی باتری را برای یوتیوب را غیرفعال کرده‌اید.\n\nدستورالعمل های انجام این کار در سازنده دستگاه شما متفاوت است. شما می توانید از راهنمایی مانند https://dontkillmyapp.com استفاده کنید."
				},
				{
					"title": "اگر خطایی دریافت می‌کنید که می‌گوید «مشکل در اتصال به سرورهای گوگل است»، لطفاً یکی از موارد زیر را برای رفع مشکل انجام دهید.",
					"content": "1. microG را حذف کنید و دوباره آن را نصب کنید.\n\n2. از دکمه جعلی هواوی در صفحه ورود به سیستم microG استفاده کنید."
				},
				{
					"title": "اگر یوتیوب از حساب گوگل شما خارج شود",
					"content": "این به این دلیل است که بهینه سازی باتری سنگین سیستم عامل دستگاه شما ، خدمات/فعالیت های microG را که مسئول ورود به سیستم هستند، از بین می برد\n\nبرای حل این مشکل بهینه‌سازی باتری را برایmicroG غیرفعال کنید https://dontkillmyapp.com یا روش های دیگر"
				},
				{
					"title": "برای کاربرانی که از حساب گوگل سویت در نسخه بدون روت استفاده می‌کنند و اغلب با مشکلات اتصال روبرو هستند (خطاهایی مانند \"شما آفلاین هستید\"، \"لطفاً اینترنت خود را بررسی کنید\" و غیره)",
					"content": "1. وارد حساب گوگل سویت خود [کنسول مدیریت] (https://admin.google.com/) شوید\n\n2. مدیریت دستگاه را جستجو کنید\n\n3. به تنظیمات بروید و «مدیریت تلفن همراه» را غیرفعال کنید\n\n4. همین است، الان مشکل درست می شود."
				},
				{
					"title": "راه حل هواوی 1",
					"content": "هنگام ورود به سیستم با جدیدترین نسخه microG موجود ، با استفاده از مدیر پیشرفته، از دکمه جعل هوآوی استفاده کنید."
				},
				{
					"title": "راه حل هواوی 2",
					"content": "برای کسانی که microG را به آخرین نسخه بروز کرده اند اما اکنون با مشکلات ورود مواجه هستند\n\n1. microG فعلی نصب شده را حذف نصب کنید.. \"نسخه microG 0.2.12\" را از [صفحه microG گیت هاپ] (https://github.com/YTVanced/VancedMicroG/releases/download/v0.2.12/microg.apk) دانلود کنید\n\n3. اکنون باید بتوانید وارد شوید."
				},
				{
					"title": "راه حل هواوی 3",
					"content": "1. اگر قبلاً نصب کرده اید، هم یوتیوب و هم microG را حذف نصب کنید. سپس فقط microG را دوباره نصب کنید (آخرین نسخه موجود)\n\n2. سپس تنظیمات برنامه microG را باز کنید\n\n3. « پیام های ابری گوگل» و « ریجستری دستگاه با گوگل » را خاموش کنید\n\n4. حساب خود را از طریق خود microG اضافه کنید.\n\n5. سپس یوتیوب اصلاح شده را نصب کنید."
				},
				{
					"title": "راه حل هواوی 4",
					"content": "1. ابتدا نسخه قدیمی microG{به خصوص microg_YouTube_Vanced_0.2.4-105_16052019_2.apk را با استفاده از [این پیوند] نصب کنید. (https://www.mediafire.com/file/4mw2q6ajq85g2io/microg_YouTube_Vanced_0.2.4-105_16052019_2.apk/file)}.\nمطمئن شوید که نسخه فعلی را حذف نصب کنید تا نسخه فوق را نصب کنید و آخرین فایل نصبی را ذخیره کنید زیرا بعداً به آن نیاز خواهید داشت.\n\n2. سپس یوتیوب اصلاح شده را باز کنید و دوباره وارد سیستم شوید تا پیام خطا را نشان دهد. سعی کنید با ضربه زدن روی پیام خطا آن را دوباره بارگیری کنید.\n\n3. حالا نسخه جدیدتر microG را دوباره نصب کنید و یوتیوب را ریستارت کنید\n\nتوجه: اکنون مطمئن شوید که با استفاده از https://dontkillmyapp.com بهینه سازی باتری را هم برای microG و هم برای یوتیوب غیرفعال کرده اید، در غیر این صورت سیستم دستگاه شما ممکن است microG را از بین ببرد و ممکن است مجبور شوید همه موارد بالا را تکرار کنید."
				}
			]
		},
		{
			"title": "مدیریت یوتیوب",
			"fields": [
				{
					"title": "برای رفع مشکل مدیریت کننده یوتیوب که روی لگو ایستاده و پاسخ نمی‌دهد",
					"content": "2 راه حل موجود است.\n\n 1. داده های برنامه مدیریت یوتیوب را پاک کنید > اینترنت را خاموش کنید > برنامه مدیر را باز کنید > اینترنت را روشن کنید.\n\n2. برای کاربرانی که زبان های RTL روی دستگاه تنظیم شده اند، لطفاً زبان خود را بروز کنید."
				},
				{
					"title": "نصب شکست خورد برنامه بی اعتبار: هیچ فایل نصبی مرحله‌بندی نشده یا مدیریت کننده یوتیوب در صفحه «لطفا صبور باشید» گیر می‌کند، انجام هیچ فایل نصبی و مرحله‌ای در مدیریت کننده یوتیوب کار نمیکند و می‌نویسد «لطفا صبور باشید»، این کار را انجام دهید",
					"content": "برنامه اصلی یوتیوب را از فروشگاه گوگل پلی نصب کنید و سپس با استفاده از مدیریت کننده یوتیوب آن بروزرسانی کنید. مطمئن شوید که آخرین نسخه مدیریت کننده یوتیوب را از [وب‌سایت رسمی] ما دارید (https://vancedapp) و همچنین نسخه 21.4 و یا بالاتر از مجیسک را دارید"
				},
				{
					"title": "اگر هنگام نصب microG/یوتیوب با «خطا در دانلود microG/یوتیوب» مواجه شدید یا نصب گیر کرده است",
					"content": "داده‌های برنامه مدیر یوتیوب را پاک کنید، سپس به نصب ادامه دهید و تا زمانی که فرآیند کامل نشده است، به برنامه‌های دیگر نروید."
				},
				{
					"title": "اگر با خطاهایی مانند \"عملیات نصب شکست خورد زیرا فایل های نصبی نامعتبر/خراب هستند\" مواجه شدید",
					"content": "1. به تنظیمات مدیریت کننده یوتیوب بروید و فایل های دانلود شده را پاک کنید.\n\n2. سپس داده های برنامه مدیریت کننده یوتیوب را پاک کنید سپس به نصب یوتیوب اصلاح شده ادامه دهید."
				}
			]
		},
		{
			"title": "خطای تداخل بسته پس از به‌روزرسانی به اندروید 11\n(نصب شکست خورد، بروزرسانی ناسازگار)",
			"description": "این اتفاق برای کاربرانی با رابط کاربری سامسونگ و اکسیژن ٱس کار می‌کنند می افتد که سیستم خود را از اندروید 10 به اندروید 11 بروز کرده اند، برخی از کاستوم رام ها نیز با آن مواجه هستند.\n\nاز این رو ما 3 راه حل برای شما در دسترس داریم",
			"fields": [
				{
					"title": "اگر دستگاه شما روت نشده ، از ADB استفاده کنید",
					"content": "1. اشکال زدایی اندروید را با استفاده از این [راهنما] نصب کنید\n(https://www.xda-developers.com/install-adb-windows-macos-linux). \n\n2. گوشی خود را آنلاک کنید\n\n3. حالت توسعه دهندگان را فعال کنید (10 بار روی شماره ساخت در تنظیمات - درباره تلفن - اطلاعات نرم افزار ضربه بزنید). \n\n4.اشکال زدایی یو اس بی را در تنظیمات توسعه دهندگان فعال کنید\n\n5. گوشی خود را به کامپیوتر وصل کنید\n\n6. عبارت cmd را در کامپیوتر سرچ کنید و برنامه اش را باز کنید ،سپس این عبارت \"cd C:/Windows/adb/\" را بدون آن دو خط اول و آخرش بنویسید، سپس کلید اینتر را بزنید\n\n7. بعدش عبارت \"adb devices\" را بنویسید تا دستگاه شما تشخیص داده شود، بعد آن یک پیام آنی روی گوشی شما ارسال میشود که نوشته \"آیا می خواهید به این دستگاه اجازه اشکال زدایی را بدهید؟\" یا همچین عبارتی شما باید گزینه بله را بزنید\n\n8. بعد از آن دستور \"adb uninstall com.vanced.android.youtube\" تایپ کنید و اینتر را بزنید\n\n9. بعد از اینکار برنامه یوتیوب از گوشی شما حذف میشود و شما میتوانید مدیریت کننده یوتیوب و با یوتیوب اصلاح شده را از دوباره نصب کنید"
				},
				{
					"title": "اگر گوشی شما روت است",
					"content": "1. از برنامه روت اکسپلورر استفاده کنید و به محل  روت بروید. \n\n 2. سپس این پوشه را هنگام نصب یوتیوب اصلاح شده  \"data/app/com.vanced.android.youtube-...\" یا زمانی که یوتیوب موزیک   \"com.vanced.android.apps.youtube.music- را نصب می کنید پیدا کنید. \n\n3. اگر چنین پوشه هایی را پیدا کردید، فقط آنها را حذف کنید و سپس به نصب  یوتیوب اصلاح شده و یا یوتیوب موزیک  از طریق  مدیریت کننده یوتیوب اقدام کنید."
				},
				{
					"title": "این راه حل فقط برای یوتیوب موزیک است، نه برای یوتیوب اصلاح شده",
					"content": "سعی کنید یوتیوب موزیک را به صورت دستی از طریق فایل نصبی آم با استفاده از [این پیوند] بروزرسانی کنید.\n(https://mega.nz/folder/QRcy1byC#44ZDhjXm9iLr-PlCIEYtqg)."
				},
				{
					"title": "اگر هر دو روش فوق با شکست مواجه شوند",
					"content": "ظاهراً با انجام ریست فکتوری (تنظیمات کارخانه) می‌توان این خطا را برطرف کرد. در نهایت این کار را انجام دهید."
				}
			]
		},
		{
			"title": "مشکل اعلانات",
			"description": "برای رفع اعلان در هر دو نوع کاربران بدون روت یا روت، به راه حل های زیر مراجعه کنید",
			"fields": [
				{
					"title": "برای کاربران بدون روت",
					"content": "1. ابتدا microG و سپس یوتیوب اصلاح شده را نصب کنید. \n\n2. با حساب گوگل خود وارد شوید \n\n3. بهینه سازی باتری برای microG را غیرفعال کنید (راهنمای dontkillmyapp.com پیشنهاد می شود). \n\n4. تنظیمات اضافی \"Vanced microG\" را با استفاده از مدیریت یوتیوب یا با رفتن به اطلاعات برنامه باز کنید. \n\n5. سپس با این [راهنما] (https://youtu.be/Q-5YFmFWVok) ادامه دهید."
				},
				{
					"title": "برای کاربران روت",
					"content": "مطمئن شوید که «خلاصه اعلانات برنامه ریزی شده» در تنظیمات یوتیوب خاموش است و صدای اعلان‌های شما درست و تنظیم شده است.\n\nمی‌توانید از برنامه «مدیر اعلان‌ها» استفاده کنید که همه اعلان‌های شما را در یک مکان ردیابی می‌کند، بنابراین اگر اعلان‌های خود را رد می‌کنید، می‌توانید دوباره از آن برنامه به آن دسترسی داشته باشید."
				}
			]
		},
		{
			"title": "اگر یوتیوب اصلاح شده در فضای ابری پیام رسان گوگل (GCM) نمایش داده نمی شود یا به صورت ثبت نشده نشان داده می شود",
			"description": "یکی از موارد زیر را امتحان کنید: \n1. حساب microg خود را از تنظیمات حساب حذف کنید. حساب مورد استفاده توسط یوتیوب دارای پس‌زمینه خاکستری تیره با آرم G روی آن است. \n\n2. داده های microG را پاک کنید و سپس وارد شوید.\n\n یا \n\nاگر راه حل فوق کار نکرد، یوتیوب را دوباره نصب کنید."
		},
		{
			"title": "مشکل بسته شدن اجباری",
			"description": "اگر برنامه یوتیوب در حال خراب شدن است/بسته شدن اجباری هنگام راه اندازی برنامه",
			"fields": [
				{
					"title": "بدون روت",
					"content": "1) اگر برنامه یوتیوب اصلاح شده را قبل از microG نصب کرده اید، هر دو یوتیوب و microG را حذف نصب کنید. سپس ابتدا microG را نصب کنید، سپس یوتیوب.\n\n2) اگر microG را نصب نکرده اید، لطفاً آن را نصب کنید و مشکل بسته شدن اجباری برنامه متوقف می شود. [اگر نمی خواهید وارد سیستم نشوید]"
				},
				{
					"title": "روت",
					"content": "1) اگر نسخه اصلی یوتیوب شما با باز کردن برنامه به اجبار بسته می‌شود، بروزرسانی‌های برنامه یوتیوب را حذف نصب کنید. اگر کمکی نکرد، همپوشانی‌های زیرلایه/موضوعات سریع خود را غیرفعال/حذف کنید. در آخرین راه حل، اگر هیچ کمکی نکرد، به انجمن/پشتیبانی ما اطلاع بدهید. \n\n2) اگر نسخه روت برنامه یوتیوب شما به اجبار در وسط برنامه زمانی که در پیش زمینه/فعال است یا در حال پخش یک ویدیو است بسته می شود، گزارش خود را بگیرید و پیدا کنید: (الف)- خطای باز کردن لینک: \"Data/app/com.google.android.youtube/lib\" نام آن را مطابق با نام ذکر شده تغییر دهید.\n\n (ب)- توجه داشته باشید موارد لیست شده است\n \"com.google.android.youtube\":: - این راهنما را از [این پیوند] بخوانید (https://www.xda-developers.com/how-to-fix-device-not-certified -by-google-error) و ببینید که آیا کمک می کند. \nاگر لینک کمکی نکرد، رام خود را از دوباره فلش کنید یا با رام دیگری تست کنید تا این مشکل برطرف شود. اگر نمی‌دانید چگونه گزارش‌ها را دریافت کنید، الگوی گزارش اشکال را بررسی کنید."
				},
				{
					"title": "اگر یوتیوب در وسط پخش از کار بیفتد (هنگام بازی در حالت پس‌زمینه)",
					"content": "از آنجایی که این مشکل فقط به دلیل بهینه سازی باتری موجود در پوسته های مختلف مانند رابط کاربری هواوی و شیائومی و غیره است، توصیه می شود بهینه سازی باتری را برای برنامه یوتیوب و MicroG غیرفعال کنید. دستورالعمل‌های انجام این کار در سازنده دستگاه شما متفاوت است، بنابراین ما واقعاً نمی‌توانیم در غیرفعال کردن آن به شما کمک کنیم. می‌توانید از سایتی مانند «dontkillmyapp.com» استفاده کنید، یا از گوگل استفاده کنید و «[سازنده تلفن] [مدل تلفن] [نسخه اندروید] غیرفعال کردن بهینه‌سازی باتری» را جستجو کنید، با این حال، اگر همچنان این مشکل را دارید، یک گزارش خطا در اختیار ما قرار دهید. گروه تلگرام یا سرور دیسکورد با تمام جزئیات و گزارشات های لازم باید وجود داشته باشد تا توسعه دهندگان بتوانند ببینند که واقعاً چه چیزی باعث شده است. همچنین، مطمئن شوید که مشکلات مربوط به یوتیوب، نه کل سیستم خود را بگیرید."
				}
			]
		},
		{
			"title": "حذف نصب یا راه اندازی مجدد",
			"description": "اگر نسخه اصلی یوتیوب و یوتیوب موزیک اصلاح شده در حال ناپدید شدن/حذف نصب/برگرداندن هستند، نیاز دارید بعد از نصب راه اندازی مجدد کنید،\n\nما 2 راه حل برای شما داریم:",
			"fields": [
				{
					"title": "راه حل ۱",
					"content": "رفتن به حالت بدون روت."
				},
				{
					"title": "راه حل ۲",
					"content": "الزامات: مدیریت کننده یوتیوب نسخه 2.2.0 یا جدیدتر\n\n 1. مدیریت کننده یوتیوب را باز کنید و به تنظیمات بروید و زمان خاموشی اسکریپت روت را پیدا کنید (برای نمایش این گزینه باید در حالت روت باشید). \n\n2. سپس مقدار را روی <2 تنظیم کنید و ذخیره را بزنید، و راه اندازی مجدد کنید و ببینید آیا یوتیوب موزیک و یوتیوب اصلاح شده همچنان ناپدید می شوند یا خیر. اگر همچنان ناپدید می‌شوند، مقدار را تا زمانی که پس از راه‌اندازی مجدد بچسبند، تنظیم کنید"
				}
			]
		},
		{
			"title": "رفع خالی شدن باتری برای دستگاه های سامسونگ",
			"description": "اگر از یک دستگاه سامسونگ استفاده می‌کنید و با مشکل خالی/گرم شدن بیش از حد باتری مواجه هستید، در جای مناسبی هستید! این خطا به دلیل یوتیوب نیست، بلکه به دلیل برنامه تقویت کننده بازی داخلی سامسونگ و خدمات آن است. به نوعی یوتیوب را به عنوان یک بازی تشخیص می دهد و شروع به تقویت آن برای عملکرد بهتر می کند که نیازی به آن ندارد. متأسفانه فقط در صورتی می توانید این مشکل را برطرف کنید که روت یا رایانه شخصی داشته باشید.\n",
			"fields": [
				{
					"title": "پیش نیازها",
					"content": "شما نیاز خواهید داشت\n\n• یک کامپیوتر با تنظیم ADB یا\n • یک گوشی روت شده"
				},
				{
					"title": "حذف نصب برنامه تقویت کننده بازی با استفاده از روت",
					"content": "در مرحله اول شما نیاز به یک برنامه دارید مانند [Termux]\n(https://play.google.com/store/apps/details?id=com.termux) but you can use whatever you prefer.\n\n2. آن را باز کنید و تمام مراحل زیر را یک به یک انجام دهید\n\n `su -c \"pm uninstall -k --user 0 com.samsung.android.game.gamehome\"`\n\n `su -c \"pm uninstall -k --user 0 com.enhance.gameservice\"`\n\n `su -c \"pm uninstall -k --user 0 com.samsung.android.game.gametools\"`\n\n `su -c \"pm uninstall -k --user 0 com.samsung.android.game.gos\"`\n\n `su -c \"pm uninstall -k --user 0 com.samsung.android.gametuner.thin\"`\n\n اگر هر برنامه ای به طور خودکار از دوباره نصب شد، `-k` را از دستور آن بسته حذف کنید و دوباره دستور را در Adb اجرا کنید."
				},
				{
					"title": "حذف نصب برنامه تقویت کننده بازی با استفاده از adb در رایانه شخصی شما",
					"content": "برنامه اشکال زدایی اندروید را نصب کنید [راهنما]\n(https://www.xda-developers.com/install-adb-windows-macos-linux).\n\n2. پس از راه اندازی برنامه ، \"دستور adb shell\" را تایپ کنید سپس دستورات زیر را یکی یکی اجرا کنید.\n\n `pm uninstall -k --user 0 com.samsung.android.game.gamehome`\n\n `pm uninstall -k --user 0 com.enhance.gameservice`\n\n `pm uninstall -k --user 0 com.samsung.android.game.gametools`\n\n  `pm uninstall -k --user 0 com.samsung.android.game.gos`\n\n `pm uninstall -k --user 0 com.samsung.android.gametuner.thin`"
				}
			]
		},
		{
			"title": "تبلیغات در یوتیوب اصلاح شده",
			"description": "اگر در یوتیوب اصلاح شده یا یوتیوب موزیک تبلیغات می‌بینید، لطفاً این مطلب را در زیر بخوانید: \n\nصفحه اصلی و تبلیغات جستجو (افزوده شده توسط گوگل) مختص منطقه شما هستند و اگر در منطقه‌ای که در آن فعال هستند نباشید، نمایش داده نمی‌شوند. اون تبلیغات به هیچ وجه توسط تیم یوتیوب اصلاح شده اضافه نشده بود که اگه انگشتت رو به سمت ما بگیری بهت میخندیم. با انتشار نسخه 16، تبلیغات به طور کامل حذف شدند. اگر اتفاقی آنها را در برنامه خود مشاهده کردید، لطفاً هرگونه تغییر دهنده ای را که اشتباه مربوط به حذف آگهی را فعال کرده اید از منوی تنظیمات پیشرفته خاموش کنید. همچنین می توانید پاک کردن داده ها را امتحان کنید و ببینید که آیا حل می شود یا خیر. هنگام استفاده از ویژگی بازتابندن استفاده می کنید، توجه داشته باشید که یوتیوب اصلاح شده تبلیغات را هنگام ارسال محتوا مسدود نمی کند."
		},
		{
			"title": "سابقه",
			"description": "اگر با مشکلاتی مواجه هستید که در آن ویدیوهای تماشا شده/نتایج جستجو توسط یوتیوب نشان داده نمی‌شوند، یعنی سابقه کار نمی‌کند، به این صورت است که سابقه کار را دریافت می‌کنید:\n • برای کاربرانی که بدون در نظر گرفتن نوع (غیر روت یا روت) روت شده‌اند. شما در حال استفاده از آن هستید، مطمئن شوید که *s.youtube.com را در مسدود کننده تبلیغات خود در لیست سفید قرار داده اید. \n\n> ⚠️نکته برای کاربران Adaway: اگر قرار دادن آدرس در لیست سفید برای شما کارساز نبود، روی \"کد میزبان\" ضربه بزنید و تیک \"استیون بلک\" را بردارید و اعمال کنید، سپس راه اندازی مجدد کنید و سابقه شما کار خواهد کرد.\n\n⚠️ • برای کاربران غیر روت: مطمئن شوید شما در نسخه 14.10.53 یا بالاتر هستید تا این برنامه بتواند سابقه تماشای شما را ذخیره کند. اگر سابقه همچنان بروزرسانی نمی‌شود، باید حساب نام تجاری خود را در [تنظیمات یوتیوب] (https://www.youtube.com/account_advanced) ادغام کنید تا سابقه کار کند. (فرآیند ادغام تاریخچه فعلی را پاک می کند.) \n\n> ⚠️نکته برای کاربران Adaway که از فیلترشکن مسدود کننده تبلیغات به جای مسدود کردن تبلیغات مبتنی بر روت استفاده می کنند: اگر از حساب نام تجاری استفاده نمی کنید، مطمئن شوید که *s.youtube.com آدرس را در لیست مجاز قرار دهید. لیست کنید سپس تغییرات را اعمال کنید.⚠️"
		},
		{
			"title": "مشکل لود برنامه",
			"fields": [
				{
					"title": "اگر برنامه یوتیوب روی لگو گبر کرده ، این کار را انجام دهید;",
					"content": "1. حالت هواپیما را روشن کنید.\n2. یوتیوب اصلاح شده را باز کنید.\n\n3. در پنجره تغییرات فهرست روی بستن ضربه بزنید.\n4. حالت هواپیما را خاموش کنید.\n5. بازگشایی مجدد.\n\nبا تشکر از rocco6victorFrom در سایت xda"
				},
				{
					"title": "اگر یوتیوب همینجوری روی علامت بارگذاری باقی مانده، این کار را انجام دهید;",
					"content": "1. با استفاده از dontkillmyapp.com بهینه سازی باتری را برای یوتیوب و برنامه microG غیرفعال کنید و سپس دستگاه خود را راه اندازی مجدد کنید.\n\n2. الان باید درست بشود."
				}
			]
		},
		{
			"title": "مشکل تصویر در تصویر",
			"description": "⚠️لطفاً مشکلات مربوط به تصویر در تصویر را گزارش نکنید. ⚠️\n\n سایر برنامه ها (مانند MX Player، VLC، و دیگران) از تصویر در تصویر سفارشی استفاده می کنند. در نتیجه، هر گونه مشکل در تصویر در تصویر باید به گوگل گزارش شود. \n\n • تصویر در تصویر فقط برای اندروید 8 و بالاتر در دسترس است. \n\n • برای فعال کردن تصویر در تصویر، تنظیمات برنامه یوتیوب را باز کنید > عمومی > فعال کردن تصویر در تصویر \n\n> برای فعال کردن تصویر در تصویر در رابط کاربری شیائومی ، باید مطمئن شوید که این تنظیمات روشن است: \nحفاظت از حریم خصوصی-> مدیریت-> دسترسی های ویژه برنامه-> تصویر در تصویر"
		},
		{
			"title": "مشکل دانلود برنامه",
			"fields": [
				{
					"title": "اگر در دانلود فایل های پیشرفته با استفاده از vancedapp.com مشکل دارید یا به دلیل محدودیت های سرور/منطقه نمی توانید سایت ما را باز کنید",
					"content": "You can get our new manager right [here](https://github.com/YTVanced/VancedManager/releases/)\n\nNOTE: Here you have to choose \"manager.apk\" in latest release > assets. Don't choose zips or anything else as they are not apks."
				},
				{
					"title": "If you are having trouble downloading and installing vanced via manager, you can still use SAI/manual method to install vanced.",
					"content": "• Use the MediaFire mirror to download the required files.\n>https://www.mediafire.com/folder/773e97cz2ezx1/AddFree_Youtube_BackgroundPlay_Enabled\n\n• Use the AFH Mirror to download the required files.\n>https://androidfilehost.com/?w=files&flid=170196\n\nNOTES:\n\nA) Since we have all separate apk files on Mediafire and android file host(AFH) now, you have to zip all \"base, architecture and language\" apk's & install it via SAI. All 3 apk are must.\n\nB) Manual installation can only be done either via root since it requires accessing root storage."
				}
			]
		},
		{
			"title": "Detach from market",
			"description": "You can use any of the workarounds listed below to remove the YouTube app from the market.",
			"fields": [
				{
					"title": "Workaround 1(Recommended)",
					"content": "\n\nUsing [TeMiFi app](https://forum.xda-developers.com/t/app-tool-temefi-comprehensive-system-administration.3806260), Make sure the YouTube Vanced is a user app as this method won't work if Vanced is installed as a system app.\n\n1. Open TeMiFi app and Give root permissions. \n\n2. Tap on Application info and tap on Detach package from play store option. \n\n3. Tap on DETACH: Select package then protection level v5 \n\n4. Select YouTube with package name \"com.google.android.youtube\" \n\n5. Tap on 3. Invalidate the data, block any attempt.... \n\n6. Yes, I accept full responsibility \n\n7. Proft!"
				},
				{
					"title": "Workaround 2",
					"content": "\n\nUsing Titanium backup app(needs pro version)\n\n1. Open titanium backup \n\n2. Search for youtube and Click on it \n\n3. Swipe left to access special features \n\n4. Click on Attach to market \n\n5. Then again go to special features \n\n6. Click on \"detach from market\" \n\n7. Done"
				},
				{
					"title": "Workaround 3",
					"content": "NOTE: Auto-Updates must be disabled in play store before doing this.\n\n1. Create \"Detach.txt\" in the following location /sdcard/ (equivalent to /storage/emulated/0/) write \"YouTube\" in that text file without quotes. You can also download the Detach.txt from Magisk module name Detach and remove the # in front of YouTube.\n\n2. Flash Detach module in Magisk manager.\n\n3. Flash Daily Job Scheduler (djs) in Magisk manager.\n\n4. Reboot\n\n5. Open Terminal and type \"su -c detach -t\" and set it to run once every hour.\n\n6. Done!\n\nPlay Store updates its database file on a random rhythm, sometimes several times a day. Once in a while (like once every two weeks), Play Store will show an update for Youtube, but it will go away when the script has run again by djs."
				},
				{
					"title": "Workaround 4",
					"content": "Switch to Non-Root variant of Vanced. This workaround should only be used as a last resort if all of the other options fail!"
				}
			]
		},
		{
			"title": "Fix For SAI/Vanced Manager errors",
			"description": "Below are some known reasons you might face when you don't follow instructions, so read the appropriate cause with its solution and fix your problem.",
			"fields": [
				{
					"title": "INSTALL_FAILED_VERSION_DOWNGRADE",
					"content": "Uninstall stock yt updates. Make sure Stock YouTube version is lower than vanced version you are installing now."
				},
				{
					"title": "INSTALL_FAILED_UPDATE_INCOMPATIBE",
					"content": "Just uninstall any vanced app that you have installed from any other source then install vanced.  Otherwise uninstall \"vanced microG\" > reboot device > then install vanced microG first then Vanced. If error still comes, use SAI to install the vanced split apks manually. These apk files are located in \n\"android / data / com.vanced.manager / files / vanced / nonroot / \""
				},
				{
					"title": "INSTALL_PARSE_FAILED_NOT_APK",
					"content": "Change the language of your phone from Indonesian to English then install vanced. After installing, you can change language back to Indonesian. If your device isn't using Indonesian language, make sure language is properly selected in Vanced manager which you wanna install with YouTube Vanced."
				},
				{
					"title": "INSTALL_FAILED_NO_MATCHING_ABIS",
					"content": "Download legacy version instead of default"
				},
				{
					"title": "INSTALL_FAILED_INVALID_APK: Split config.en was defined multiple times",
					"content": "Try removing one split_config.en apk from apks file then install\n(Apks file is just a zip file so you can easily remove the apk from it)"
				},
				{
					"title": "INSTALL_FAILED_DUPLICATE_PERMISSION",
					"content": "Uninstall microG > reboot > install vanced via sai > install microG\n\nIf microG doesn't install, install microG too via SAI."
				},
				{
					"title": "Unable to install the app because it conflicts with an already installed app with same package name",
					"content": "Uninstall microG > reboot > install vanced via sai > install microG via apk package installer\nIf microG doesn't install, install microG too via SAI."
				},
				{
					"title": "APP IS INCOMPATIBLE WITH THIS DEVICE",
					"content": "Download the legacy architecture files when downloading vanced files from official vanced mirrors instead of default architecture."
				},
				{
					"title": "INSTALL_PARSE_FAILED_NO_CERTIFICATES",
					"content": "It seems like you didn't read instructions properly and installed vanced without disabling signature verification. or you tried some method which didn't give any positive result, so the solution to both is to disable signature verification using the best method/alternative to what you used before or just use our [vanced manager](https://vancedapp.com) which doesn't require you to disable signature verification."
				},
				{
					"title": "INSTALL_FAILED_INVALID_INSTALL_LOCATION",
					"content": " Please head to your device settings > developer options and turn off \"force allow apps on external\" then install the Vanced app in SAI."
				},
				{
					"title": "INSTALL_FAILED_USER_RESTRICTED: Install canceled by user",
					"content": "Unknown sources install is protected per service in your MIUI devices Please go to your device settings and enable unknown sources for SAI and issue will get solved and you will be able go install Vanced."
				},
				{
					"title": "INSTALL_FAILED_INTERNAL_ERROR: Permission Denied",
					"content": "Disable MIUI optimization from your device developer options."
				}
			]
		},
		{
			"title": "Live-Stream issues",
			"description": "Solution: Follow this guide > https://youtu.be/R9asMVCQkAU. Also, disable your external ad-blockers/vpn/proxy/custom settings in vanced. Keep stock settings if you don't wanna see any issues."
		},
		{
			"title": "Black screen video fix",
			"description": "Solution: clearing data of Youtube Vanced and subsequently reinstalling it should fix the issue. If it doesn't, try a Reboot &\nCheck if black screen issue solves. \n\nIf problem persist, factory reset your device or change the ROM."
		},
		{
			"title": "Content Restrictions",
			"description": "In English it is callled \"restricted mode\"\nIn arabic it is called \"وضع تقييد المحتوى\"\n\nTo solve issue of lesser search results, do this\n\n1. Go to settings > General\n\n2. Find \"restricted mode\" and turn it off.\n\nIf you're in a country that Google hates, use a vpn."
		},
		{
			"title": "View count change",
			"description": "To change the view count from crores/lakhs to millions, do this:\n\n\nSolution:\n\n1. Go to settings (of your phone)\n\n2. Go to system \n\n3. Go to language preferences\n\n4. Add a language as English (US) \n\n5. Drag this language above your current one.\n\n6. Go to youtube and enjoy ⚡\n\nThanks to @ROG_OK from telegram Vanced group for finding the fix."
		},
		{
			"title": "Captions",
			"description": "\n\n If you face caption issues such as random subtitles of different languages on an english video, here's what you have to do; \n\n1. Open browser and go to youtube desktop site. If you are on a mobile, tap on \"Request desktop website\". \n\n2. Now tap on your profile icon from top right corner and tap on Settings. \n\n3. Then head to \"Playback and performance\" and uncheck the \"Always show captions\" box. \n\n4. Close browser and go to YouTube Vanced app info and clear cache(not data) [not sure if this is necessary, just writing what i did to fix it for myself] \n\n5. Then open YouTube app and go to settings > captions > set Language to default if it's not. Otherwise skip this step. \n\n6. Auto captions will be fixed"
		},
		{
			"title": "HDR brightness Workaround",
			"description": "Use the swiping features to turn the brightness to its maximum."
		},
		{
			"title": "Settings crashes",
			"description": "Turn off your fingerprint scanner and go to the settings to configure it; once finished, turn it back on. It will not crash again unless you restart your device."
		}
	]
}
