{
	"data": [
		{
			"title": "عیب یابی پایه",
			"description": "۱) پاک کردن اطلاعات یا حافظه کش\n\n۲) استفاده از یوتیوب و یوتیوب موزیک اصلاح شده از نوع بدون روت\n\n۳) استفاده از یوتیوب و یوتیوب موزیک اصلاح شده از نوع روت و سرویس گوگل پلی\n\n۴) نصب مجدد یوتیوب اصلاح شده\n\n>توجه مهم: بین هر کدام فرآیندهای بالا ، گوشی راه اندازی مجدد شود"
		},
		{
			"title": "مشکل در ورود",
			"description": "در زیر برخی از خطاهای رایج در اسکرین شات ها آورده شده است تا بتوانید بدانید کدام راه حل را باید دنبال کنید.",
			"fields": [
				{
					"title": "اگر خطای «لطفاً اتصال اینترنت خود را بررسی کنید» دریافت کردید",
					"content": "لطفاً این راهنمای ویدیویی را مشاهده کنید:\nhttps://youtu.be/S5sTXRTrD5Y و تلاش کنید که اطلاعات یوتیوب و microG را پاک کنید."
				},
				{
					"title": "اگر در ارتباط با ورود به سیستم با مشکلاتی روبرو هستید که می‌گویید: \"شما آفلاین هستید، دانلودها را کاوش کنید\"",
					"content": "1. داده های هر دو سرویس microG و گوگل پلی را پاک کنید\n2. هم « microG» و هم یوتیوب اصلاح شده را حذف نصب کنید.\n\n3. در هر صورت راه اندازی مجدد کنید.\n\n4. هر دو برنامه [microG و یوتیوب) را دوباره نصب کنید، اما مطمئن شوید که microG را قبل از نصب یوتیوب اصلاح شده نصب کرده اید. از طریق مدیریت کننده یوتیوب یا با استفاده از فایل های ارائه شده در یادداشت های نصب ، به صورت گروهی نصب کنید\n\n5. حالا لاگین کنید\n\nتوجه: اگر همچنان با خطاهای اتصال یوتیوب (حتی پس از نصب microG در ابتدا)، دریافت اعلان‌ها و غیره مشکل دارید، مطمئن شوید که بهینه‌سازی باتری را برای یوتیوب را غیرفعال کرده‌اید.\n\nدستورالعمل های انجام این کار در سازنده دستگاه شما متفاوت است. شما می توانید از راهنمایی مانند https://dontkillmyapp.com استفاده کنید."
				},
				{
					"title": "اگر خطایی دریافت می‌کنید که می‌گوید «مشکل در اتصال به سرورهای گوگل است»، لطفاً یکی از موارد زیر را برای رفع مشکل انجام دهید.",
					"content": "1. microG را حذف کنید و دوباره آن را نصب کنید.\n\n2. از دکمه جعلی هواوی در صفحه ورود به سیستم microG استفاده کنید."
				},
				{
					"title": "اگر یوتیوب از حساب گوگل شما خارج شود",
					"content": "این به این دلیل است که بهینه سازی باتری سنگین سیستم عامل دستگاه شما ، خدمات/فعالیت های microG را که مسئول ورود به سیستم هستند، از بین می برد\n\nبرای حل این مشکل بهینه‌سازی باتری را برایmicroG غیرفعال کنید https://dontkillmyapp.com یا روش های دیگر"
				},
				{
					"title": "برای کاربرانی که از حساب گوگل سویت در نسخه بدون روت استفاده می‌کنند و اغلب با مشکلات اتصال روبرو هستند (خطاهایی مانند \"شما آفلاین هستید\"، \"لطفاً اینترنت خود را بررسی کنید\" و غیره)",
					"content": "1. وارد حساب گوگل سویت خود [کنسول مدیریت] (https://admin.google.com/) شوید\n\n2. مدیریت دستگاه را جستجو کنید\n\n3. به تنظیمات بروید و «مدیریت تلفن همراه» را غیرفعال کنید\n\n4. همین است، الان مشکل درست می شود."
				},
				{
					"title": "راه حل هواوی 1",
					"content": "هنگام ورود به سیستم با جدیدترین نسخه microG موجود ، با استفاده از مدیر پیشرفته، از دکمه جعل هوآوی استفاده کنید."
				},
				{
					"title": "راه حل هواوی 2",
					"content": "برای کسانی که microG را به آخرین نسخه بروز کرده اند اما اکنون با مشکلات ورود مواجه هستند\n\n1. microG فعلی نصب شده را حذف نصب کنید.. \"نسخه microG 0.2.12\" را از [صفحه microG گیت هاپ] (https://github.com/YTVanced/VancedMicroG/releases/download/v0.2.12/microg.apk) دانلود کنید\n\n3. اکنون باید بتوانید وارد شوید."
				},
				{
					"title": "راه حل هواوی 3",
					"content": "1. اگر قبلاً نصب کرده اید، هم یوتیوب و هم microG را حذف نصب کنید. سپس فقط microG را دوباره نصب کنید (آخرین نسخه موجود)\n\n2. سپس تنظیمات برنامه microG را باز کنید\n\n3. « پیام های ابری گوگل» و « ریجستری دستگاه با گوگل » را خاموش کنید\n\n4. حساب خود را از طریق خود microG اضافه کنید.\n\n5. سپس یوتیوب اصلاح شده را نصب کنید."
				},
				{
					"title": "راه حل هواوی 4",
					"content": "1. ابتدا نسخه قدیمی microG{به خصوص microg_YouTube_Vanced_0.2.4-105_16052019_2.apk را با استفاده از [این پیوند] نصب کنید. (https://www.mediafire.com/file/4mw2q6ajq85g2io/microg_YouTube_Vanced_0.2.4-105_16052019_2.apk/file)}.\nمطمئن شوید که نسخه فعلی را حذف نصب کنید تا نسخه فوق را نصب کنید و آخرین فایل نصبی را ذخیره کنید زیرا بعداً به آن نیاز خواهید داشت.\n\n2. سپس یوتیوب اصلاح شده را باز کنید و دوباره وارد سیستم شوید تا پیام خطا را نشان دهد. سعی کنید با ضربه زدن روی پیام خطا آن را دوباره بارگیری کنید.\n\n3. حالا نسخه جدیدتر microG را دوباره نصب کنید و یوتیوب را ریستارت کنید\n\nتوجه: اکنون مطمئن شوید که با استفاده از https://dontkillmyapp.com بهینه سازی باتری را هم برای microG و هم برای یوتیوب غیرفعال کرده اید، در غیر این صورت سیستم دستگاه شما ممکن است microG را از بین ببرد و ممکن است مجبور شوید همه موارد بالا را تکرار کنید."
				}
			]
		},
		{
			"title": "مدیریت یوتیوب",
			"fields": [
				{
					"title": "برای رفع مشکل مدیریت کننده یوتیوب که روی لگو ایستاده و پاسخ نمی‌دهد",
					"content": "2 راه حل موجود است.\n\n 1. داده های برنامه مدیریت یوتیوب را پاک کنید > اینترنت را خاموش کنید > برنامه مدیر را باز کنید > اینترنت را روشن کنید.\n\n2. برای کاربرانی که زبان های RTL روی دستگاه تنظیم شده اند، لطفاً زبان خود را بروز کنید."
				},
				{
					"title": "نصب شکست خورد برنامه بی اعتبار: هیچ فایل نصبی مرحله‌بندی نشده یا مدیریت کننده یوتیوب در صفحه «لطفا صبور باشید» گیر می‌کند، انجام هیچ فایل نصبی و مرحله‌ای در مدیریت کننده یوتیوب کار نمیکند و می‌نویسد «لطفا صبور باشید»، این کار را انجام دهید",
					"content": "برنامه اصلی یوتیوب را از فروشگاه گوگل پلی نصب کنید و سپس با استفاده از مدیریت کننده یوتیوب آن بروزرسانی کنید. مطمئن شوید که آخرین نسخه مدیریت کننده یوتیوب را از [وب‌سایت رسمی] ما دارید (https://vancedapp) و همچنین نسخه 21.4 و یا بالاتر از مجیسک را دارید"
				},
				{
					"title": "اگر هنگام نصب microG/یوتیوب با «خطا در دانلود microG/یوتیوب» مواجه شدید یا نصب گیر کرده است",
					"content": "داده‌های برنامه مدیر یوتیوب را پاک کنید، سپس به نصب ادامه دهید و تا زمانی که فرآیند کامل نشده است، به برنامه‌های دیگر نروید."
				},
				{
					"title": "اگر با خطاهایی مانند \"عملیات نصب شکست خورد زیرا فایل های نصبی نامعتبر/خراب هستند\" مواجه شدید",
					"content": "1. به تنظیمات مدیریت کننده یوتیوب بروید و فایل های دانلود شده را پاک کنید.\n\n2. سپس داده های برنامه مدیریت کننده یوتیوب را پاک کنید سپس به نصب یوتیوب اصلاح شده ادامه دهید."
				}
			]
		},
		{
			"title": "خطای تداخل بسته پس از به‌روزرسانی به اندروید 11\n(نصب شکست خورد، بروزرسانی ناسازگار)",
			"description": "این اتفاق برای کاربرانی با رابط کاربری سامسونگ و اکسیژن ٱس کار می‌کنند می افتد که سیستم خود را از اندروید 10 به اندروید 11 بروز کرده اند، برخی از کاستوم رام ها نیز با آن مواجه هستند.\n\nاز این رو ما 3 راه حل برای شما در دسترس داریم",
			"fields": [
				{
					"title": "اگر دستگاه شما روت نشده ، از ADB استفاده کنید",
					"content": "1. اشکال زدایی اندروید را با استفاده از این [راهنما] نصب کنید\n(https://www.xda-developers.com/install-adb-windows-macos-linux). \n\n2. گوشی خود را آنلاک کنید\n\n3. حالت توسعه دهندگان را فعال کنید (10 بار روی شماره ساخت در تنظیمات - درباره تلفن - اطلاعات نرم افزار ضربه بزنید). \n\n4.اشکال زدایی یو اس بی را در تنظیمات توسعه دهندگان فعال کنید\n\n5. گوشی خود را به کامپیوتر وصل کنید\n\n6. عبارت cmd را در کامپیوتر سرچ کنید و برنامه اش را باز کنید ،سپس این عبارت \"cd C:/Windows/adb/\" را بدون آن دو خط اول و آخرش بنویسید، سپس کلید اینتر را بزنید\n\n7. بعدش عبارت \"adb devices\" را بنویسید تا دستگاه شما تشخیص داده شود، بعد آن یک پیام آنی روی گوشی شما ارسال میشود که نوشته \"آیا می خواهید به این دستگاه اجازه اشکال زدایی را بدهید؟\" یا همچین عبارتی شما باید گزینه بله را بزنید\n\n8. بعد از آن دستور \"adb uninstall com.vanced.android.youtube\" تایپ کنید و اینتر را بزنید\n\n9. بعد از اینکار برنامه یوتیوب از گوشی شما حذف میشود و شما میتوانید مدیریت کننده یوتیوب و با یوتیوب اصلاح شده را از دوباره نصب کنید"
				},
				{
					"title": "اگر گوشی شما روت است",
					"content": "1. از برنامه روت اکسپلورر استفاده کنید و به محل  روت بروید. \n\n 2. سپس این پوشه را هنگام نصب یوتیوب اصلاح شده  \"data/app/com.vanced.android.youtube-...\" یا زمانی که یوتیوب موزیک   \"com.vanced.android.apps.youtube.music- را نصب می کنید پیدا کنید. \n\n3. اگر چنین پوشه هایی را پیدا کردید، فقط آنها را حذف کنید و سپس به نصب  یوتیوب اصلاح شده و یا یوتیوب موزیک  از طریق  مدیریت کننده یوتیوب اقدام کنید."
				},
				{
					"title": "این راه حل فقط برای یوتیوب موزیک است، نه برای یوتیوب اصلاح شده",
					"content": "سعی کنید یوتیوب موزیک را به صورت دستی از طریق فایل نصبی آم با استفاده از [این پیوند] بروزرسانی کنید.\n(https://mega.nz/folder/QRcy1byC#44ZDhjXm9iLr-PlCIEYtqg)."
				},
				{
					"title": "اگر هر دو روش فوق با شکست مواجه شوند",
					"content": "ظاهراً با انجام ریست فکتوری (تنظیمات کارخانه) می‌توان این خطا را برطرف کرد. در نهایت این کار را انجام دهید."
				}
			]
		},
		{
			"title": "مشکل اعلانات",
			"description": "برای رفع اعلان در هر دو نوع کاربران بدون روت یا روت، به راه حل های زیر مراجعه کنید",
			"fields": [
				{
					"title": "برای کاربران بدون روت",
					"content": "1. ابتدا microG و سپس یوتیوب اصلاح شده را نصب کنید. \n\n2. با حساب گوگل خود وارد شوید \n\n3. بهینه سازی باتری برای microG را غیرفعال کنید (راهنمای dontkillmyapp.com پیشنهاد می شود). \n\n4. تنظیمات اضافی \"Vanced microG\" را با استفاده از مدیریت یوتیوب یا با رفتن به اطلاعات برنامه باز کنید. \n\n5. سپس با این [راهنما] (https://youtu.be/Q-5YFmFWVok) ادامه دهید."
				},
				{
					"title": "برای کاربران روت",
					"content": "Make sure \"Scheduled Digest\" is off in youtube settings and your notifications sounds are correct and set.\n\nYou can try using \"notification manager\" app which keeps track of all your notification at one place so in case if you are dismissing your notifications, you can access the same again from that app."
				}
			]
		},
		{
			"title": "If YouTube Vanced is not showing up under Google Cloud Messaging(GCM) or it shows up as unregistered",
			"description": "Try EITHER of the following:\n\n1. Remove your microg account from account settings. The account used by vanced has a dark grey background with G logo on it. \n\n2. Clear data of microG then login. \n\nOR\n\nIf above workaround doesn't work, reinstall vanced."
		},
		{
			"title": "Force closing issues",
			"description": "If Vanced app is crashing/force closing on startup",
			"fields": [
				{
					"title": "Nonroot",
					"content": "1) If you installed YouTube vanced before vanced microG app, uninstall both YouTube vanced and vanced microG. Then install vanced microG first, then Vanced and vanced will stop force closing.\n\n2) If you didn't install vanced microG, please install it and force closing will stop. [Don't log in if you don't want to]"
				},
				{
					"title": "Root",
					"content": "1) If your root version of Vanced is force closing upon opening the app, uninstall stock YouTube app updates. If this doesn't help, disable/uninstall your substratum/swift themes overlays.\nAt last resort, if nothing helps, give the community/staff a logcat.\n\n2) If your root version of Vanced is force closing in the middle of app when it's in foreground/active or playing a video, grab your logcats and find:\n\n(a)- Unsatisfiedlinkerror: \nSol:- Place the arm and arm64 files in root directory \"Data/app/com.google.android.youtube/lib\" or rename accordingly to the name mentioned.\n\n(b)- Notehitelisted \"com.google.android.youtube\":\nSol:- Read this guide from [this link](https://www.xda-developers.com/how-to-fix-device-not-certified-by-google-error) and see if it helps. If Link didn't help, clean flash your ROM or test with a different ROM to resolve this issue. If you don't know how to get logs, check the bugreport template."
				},
				{
					"title": "If Vanced crashes in the middle of playback (when playing in background mode)",
					"content": "Since this issue is only caused by aggressive battery optimization present in various OEM skins such as MIUI, EMUI, ColorOS, etc..., it is recommended to disable battery optimization for both Vanced and MicroG app. \n\nInstructions to do so vary on your device manufacturer, so we can’t really assist with helping you disable it. You can try using a site like \"dontkillmyapp.com\", OR using Google and searching “[phone manufacturer] [phone model] [Android version] disable battery optimization”\n\nHowever, if you still have this issue, provide us with a bugreport on telegram group or discord server with all the necessary details and logs must be there so that Mods can take a look what's actually causing. Also, make sure to grab logs specific to vanced, NOT your whole SYSTEM."
				}
			]
		},
		{
			"title": "Uninstall on reboot",
			"description": "If the root version of YouTube Vanced/ YouTube Music Vanced is disappearing/uninstalling/reverting back to stock on reboot,\n\nWe have 2 solutions available for you:",
			"fields": [
				{
					"title": "Solution 1",
					"content": "Switch to the non-root version."
				},
				{
					"title": "Solution 2",
					"content": "REQUIREMENTS: Vanced Manager 2.2.0 or newer\n\n 1. Open Vanced manager and go to settings and find Root Script Sleep Time (you should be on root mode for this option to appear).\n\n2. Then set the value to 2 > hit save, reboot and see if Vanced/Music still disappear. If they still disappear try adjusting the value until they stick after reboot"
				}
			]
		},
		{
			"title": "Battery drain fix for Samsung devices",
			"description": "If you are using a Samsung device and facing huge battery drain/overheating issues, then you are at the right spot!\n The error is not caused by vanced but is caused by Samsung's built-in Game booster app and its services. It somehow detects vanced as a game and starts boosting it for better performance which it doesn't need.\n Sadly you can only fix this issue if you have root or a PC.\n",
			"fields": [
				{
					"title": "Prerequisites",
					"content": "You will need\n\n• EITHER a PC with adb set up OR\n • A rooted phone"
				},
				{
					"title": "Uninstalling the Game booster stuff using root",
					"content": "First, you need a Terminal. We recommend [Termux](https://play.google.com/store/apps/details?id=com.termux) but you can use whatever you prefer.\n\n2 Open it up and run the following commands one by one,\n\n `su -c \"pm uninstall -k --user 0 com.samsung.android.game.gamehome\"`\n\n `su -c \"pm uninstall -k --user 0 com.enhance.gameservice\"`\n\n `su -c \"pm uninstall -k --user 0 com.samsung.android.game.gametools\"`\n\n `su -c \"pm uninstall -k --user 0 com.samsung.android.game.gos\"`\n\n `su -c \"pm uninstall -k --user 0 com.samsung.android.gametuner.thin\"`\n\n >If any app installs back automatically, remove `-k` from the command of that package and run command in adb again."
				},
				{
					"title": "Uninstalling the Game booster stuff using adb on your PC",
					"content": "1. Install Android Debug Bridge using this [Guide](https://www.xda-developers.com/install-adb-windows-macos-linux).\n\n2. After setting up adb, type `adb shell` then run the following commands one by one.\n\n `pm uninstall -k --user 0 com.samsung.android.game.gamehome`\n\n `pm uninstall -k --user 0 com.enhance.gameservice`\n\n `pm uninstall -k --user 0 com.samsung.android.game.gametools`\n\n  `pm uninstall -k --user 0 com.samsung.android.game.gos`\n\n `pm uninstall -k --user 0 com.samsung.android.gametuner.thin`"
				}
			]
		},
		{
			"title": "Advertisements in Vanced",
			"description": "If you are seeing ads in YouTube Vanced or Vanced Music, please read this below:\n\nThe home screen and search ads (added by Google) are region-specific and will not be displayed if you are not in the region where they are active. Those advertisements were not added in any way by the Vanced team, so if you pointed a finger at us, we would laugh at you. \n\n With the v16 release, the advertisements have been fully removed. If you happen to see them in your app, please turn off any toggles you turned on mistake relating to ad removal from the vanced settings menu. You can also try clearing data and see if it resolves. When using the cast feature, note that vanced won't block ads while casting."
		},
		{
			"title": "History",
			"description": "If you are facing issues where videos watched/search results are not getting recorded by Vanced i.e., history being not working, this is how you get the history working:\n\n• For users who are rooted regardless of which variant (Non-Root or Root) you are using,\n\n Make sure you whitelist *s.youtube.com in your Ad-Blocker.\n\n> ⚠️NOTE for Adaway users: If whitelisting the URL didn't work for you, tap on \"host sources\" and untick \"stevenblack\" and apply, then reboot and your history will work.⚠️\n\n• For Non-Root users:\n\n Make sure you're on v14.10.53 or higher for the app to save your watch history. If history still doesn't update, then you need to merge your brand account in [YouTube Settings](https://www.youtube.com/account_advanced) to get history working. (Merging process will clean the current history.)\n\n> ⚠️NOTE for Adaway users using VPN Ad-Blocking instead of root based Ad-Blocking: If you are not using brand account, make sure to whitelist *s.youtube.com url in allowed list then apply the changes.⚠️"
		},
		{
			"title": "APP loading issues",
			"fields": [
				{
					"title": "If Vanced got stuck on splash screen, do this;",
					"content": "1. Switch Airplane mode on.\n2. Open Youtube Vanced.\n\n3. Tap on close in changelog popup.\n4. Turn off Airplane mode.\n5. Reopen vanced.\n\nThanks to rocco6victorFrom XDA"
				},
				{
					"title": "If Vanced keeps on loading infinitely, do this;",
					"content": "1. Disable battery optimization for both YouTube Vanced and microG app using dontkillmyapp.com then reboot your device.\n2. It should get fixed now."
				}
			]
		},
		{
			"title": "Picture-in-Picture issues",
			"description": "⚠️Please don't report PIP related issues.⚠️\n\n• PIP is managed by the Android system because YouTube uses native PIP, and the same is true for YouTube Vanced. Other apps (such as MX Player, VLC, and others) make use of a custom-made PIP. As a result, any problems with PIP should be reported to Google instead.\n\n• PIP is available for android 8 and above only.\n\n• To enable PIP, Open YT app settings > general > enable pip\n\n> To enable pip in MIUI, you have to make sure this setting is on:\nPrivacy protection->manage->special app accesss->picture-in-picture"
		},
		{
			"title": "App download issues",
			"fields": [
				{
					"title": "If you are having trouble downloading vanced files using vancedapp.com or can't open our site due to server/region restrictions",
					"content": "You can get our new manager right [here](https://github.com/YTVanced/VancedManager/releases/)\n\nNOTE: Here you have to choose \"manager.apk\" in latest release > assets. Don't choose zips or anything else as they are not apks."
				},
				{
					"title": "If you are having trouble downloading and installing vanced via manager, you can still use SAI/manual method to install vanced.",
					"content": "• Use the MediaFire mirror to download the required files.\n>https://www.mediafire.com/folder/773e97cz2ezx1/AddFree_Youtube_BackgroundPlay_Enabled\n\n• Use the AFH Mirror to download the required files.\n>https://androidfilehost.com/?w=files&flid=170196\n\nNOTES:\n\nA) Since we have all separate apk files on Mediafire and android file host(AFH) now, you have to zip all \"base, architecture and language\" apk's & install it via SAI. All 3 apk are must.\n\nB) Manual installation can only be done either via root since it requires accessing root storage."
				}
			]
		},
		{
			"title": "Detach from market",
			"description": "You can use any of the workarounds listed below to remove the YouTube app from the market.",
			"fields": [
				{
					"title": "Workaround 1(Recommended)",
					"content": "\n\nUsing [TeMiFi app](https://forum.xda-developers.com/t/app-tool-temefi-comprehensive-system-administration.3806260), Make sure the YouTube Vanced is a user app as this method won't work if Vanced is installed as a system app.\n\n1. Open TeMiFi app and Give root permissions. \n\n2. Tap on Application info and tap on Detach package from play store option. \n\n3. Tap on DETACH: Select package then protection level v5 \n\n4. Select YouTube with package name \"com.google.android.youtube\" \n\n5. Tap on 3. Invalidate the data, block any attempt.... \n\n6. Yes, I accept full responsibility \n\n7. Proft!"
				},
				{
					"title": "Workaround 2",
					"content": "\n\nUsing Titanium backup app(needs pro version)\n\n1. Open titanium backup \n\n2. Search for youtube and Click on it \n\n3. Swipe left to access special features \n\n4. Click on Attach to market \n\n5. Then again go to special features \n\n6. Click on \"detach from market\" \n\n7. Done"
				},
				{
					"title": "Workaround 3",
					"content": "NOTE: Auto-Updates must be disabled in play store before doing this.\n\n1. Create \"Detach.txt\" in the following location /sdcard/ (equivalent to /storage/emulated/0/) write \"YouTube\" in that text file without quotes. You can also download the Detach.txt from Magisk module name Detach and remove the # in front of YouTube.\n\n2. Flash Detach module in Magisk manager.\n\n3. Flash Daily Job Scheduler (djs) in Magisk manager.\n\n4. Reboot\n\n5. Open Terminal and type \"su -c detach -t\" and set it to run once every hour.\n\n6. Done!\n\nPlay Store updates its database file on a random rhythm, sometimes several times a day. Once in a while (like once every two weeks), Play Store will show an update for Youtube, but it will go away when the script has run again by djs."
				},
				{
					"title": "Workaround 4",
					"content": "Switch to Non-Root variant of Vanced. This workaround should only be used as a last resort if all of the other options fail!"
				}
			]
		},
		{
			"title": "Fix For SAI/Vanced Manager errors",
			"description": "Below are some known reasons you might face when you don't follow instructions, so read the appropriate cause with its solution and fix your problem.",
			"fields": [
				{
					"title": "INSTALL_FAILED_VERSION_DOWNGRADE",
					"content": "Uninstall stock yt updates. Make sure Stock YouTube version is lower than vanced version you are installing now."
				},
				{
					"title": "INSTALL_FAILED_UPDATE_INCOMPATIBE",
					"content": "Just uninstall any vanced app that you have installed from any other source then install vanced.  Otherwise uninstall \"vanced microG\" > reboot device > then install vanced microG first then Vanced. If error still comes, use SAI to install the vanced split apks manually. These apk files are located in \n\"android / data / com.vanced.manager / files / vanced / nonroot / \""
				},
				{
					"title": "INSTALL_PARSE_FAILED_NOT_APK",
					"content": "Change the language of your phone from Indonesian to English then install vanced. After installing, you can change language back to Indonesian. If your device isn't using Indonesian language, make sure language is properly selected in Vanced manager which you wanna install with YouTube Vanced."
				},
				{
					"title": "INSTALL_FAILED_NO_MATCHING_ABIS",
					"content": "Download legacy version instead of default"
				},
				{
					"title": "INSTALL_FAILED_INVALID_APK: Split config.en was defined multiple times",
					"content": "Try removing one split_config.en apk from apks file then install\n(Apks file is just a zip file so you can easily remove the apk from it)"
				},
				{
					"title": "INSTALL_FAILED_DUPLICATE_PERMISSION",
					"content": "Uninstall microG > reboot > install vanced via sai > install microG\n\nIf microG doesn't install, install microG too via SAI."
				},
				{
					"title": "Unable to install the app because it conflicts with an already installed app with same package name",
					"content": "Uninstall microG > reboot > install vanced via sai > install microG via apk package installer\nIf microG doesn't install, install microG too via SAI."
				},
				{
					"title": "APP IS INCOMPATIBLE WITH THIS DEVICE",
					"content": "Download the legacy architecture files when downloading vanced files from official vanced mirrors instead of default architecture."
				},
				{
					"title": "INSTALL_PARSE_FAILED_NO_CERTIFICATES",
					"content": "It seems like you didn't read instructions properly and installed vanced without disabling signature verification. or you tried some method which didn't give any positive result, so the solution to both is to disable signature verification using the best method/alternative to what you used before or just use our [vanced manager](https://vancedapp.com) which doesn't require you to disable signature verification."
				},
				{
					"title": "INSTALL_FAILED_INVALID_INSTALL_LOCATION",
					"content": " Please head to your device settings > developer options and turn off \"force allow apps on external\" then install the Vanced app in SAI."
				},
				{
					"title": "INSTALL_FAILED_USER_RESTRICTED: Install canceled by user",
					"content": "Unknown sources install is protected per service in your MIUI devices Please go to your device settings and enable unknown sources for SAI and issue will get solved and you will be able go install Vanced."
				},
				{
					"title": "INSTALL_FAILED_INTERNAL_ERROR: Permission Denied",
					"content": "Disable MIUI optimization from your device developer options."
				}
			]
		},
		{
			"title": "Live-Stream issues",
			"description": "Solution: Follow this guide > https://youtu.be/R9asMVCQkAU. Also, disable your external ad-blockers/vpn/proxy/custom settings in vanced. Keep stock settings if you don't wanna see any issues."
		},
		{
			"title": "Black screen video fix",
			"description": "Solution: clearing data of Youtube Vanced and subsequently reinstalling it should fix the issue. If it doesn't, try a Reboot &\nCheck if black screen issue solves. \n\nIf problem persist, factory reset your device or change the ROM."
		},
		{
			"title": "Content Restrictions",
			"description": "In English it is callled \"restricted mode\"\nIn arabic it is called \"وضع تقييد المحتوى\"\n\nTo solve issue of lesser search results, do this\n\n1. Go to settings > General\n\n2. Find \"restricted mode\" and turn it off.\n\nIf you're in a country that Google hates, use a vpn."
		},
		{
			"title": "View count change",
			"description": "To change the view count from crores/lakhs to millions, do this:\n\n\nSolution:\n\n1. Go to settings (of your phone)\n\n2. Go to system \n\n3. Go to language preferences\n\n4. Add a language as English (US) \n\n5. Drag this language above your current one.\n\n6. Go to youtube and enjoy ⚡\n\nThanks to @ROG_OK from telegram Vanced group for finding the fix."
		},
		{
			"title": "Captions",
			"description": "\n\n If you face caption issues such as random subtitles of different languages on an english video, here's what you have to do; \n\n1. Open browser and go to youtube desktop site. If you are on a mobile, tap on \"Request desktop website\". \n\n2. Now tap on your profile icon from top right corner and tap on Settings. \n\n3. Then head to \"Playback and performance\" and uncheck the \"Always show captions\" box. \n\n4. Close browser and go to YouTube Vanced app info and clear cache(not data) [not sure if this is necessary, just writing what i did to fix it for myself] \n\n5. Then open YouTube app and go to settings > captions > set Language to default if it's not. Otherwise skip this step. \n\n6. Auto captions will be fixed"
		},
		{
			"title": "HDR brightness Workaround",
			"description": "Use the swiping features to turn the brightness to its maximum."
		},
		{
			"title": "Settings crashes",
			"description": "Turn off your fingerprint scanner and go to the settings to configure it; once finished, turn it back on. It will not crash again unless you restart your device."
		}
	]
}
