{
  "data": [
    {
      "title": "Vanced",
      "description": "YouTube Vanced שואף להיות גרסה טובה יותר של YouTube. הוא כולל חסימת מודעות, ערכת נושא כהה ועוד הרבה יותר. השתמשו ב־Vanced Manager כדי להתקין את YouTube Vanced בקלות יחסית."
    },
    {
      "title": "שירותי המוזיקה של Vanced",
      "description": "YouTube Music Vanced שואף לאותה מטרה כמו YouTube Vanced, אך יישום זה מתמקד ב־YouTube Music. הוא יחסית פחות עשיר בתכונות בהשוואה ל־Vanced, אך עדיין כולל דברים רבים שאתם מצפים להם, כמו חסימת מודעות והשמעה ברקע, הכול בתוך YouTube Music Vanced!"
    },
    {
      "title": "התכונות העיקריות של YouTube Vanced",
      "description": "- ערכת נושא שחורה וידידותית למסכי OLED וערכת נושא כהה (אפור כהה) מלבד הלבנה הרגילה.\n- חסימת כלל המודעות\n- מאפשר להפעיל סרטונים ברקע או במצב תמונה בתוך תמונה (PiP) (רק באנדרואיד 8 ומעלה)\n- פקדי החלקה מאפשרים לשלוט על הבהירות ועומצת השמע בעזרת תנועות מעלה ומטה (עם גבולות הניתנים להגדרה).\n- תכונת חזרה אוטומטית המאפשרת לולאת סרטונים החוזרת על עצמה.\n- פריסת הנגן הקטן החדש יכולה להופיע בגרסאות הטאבלט שדומות מאוד לגרסה הישנה (עם זאת, היא מעט נוטה לתקלות)."
    },
    {
      "title": "התאמה אישית",
      "description": "- מאפשר לעקוף את אפשרויות המקודד כגון אילוץ לקידוד ב־H264 למכשירים ישנים או ב־VP9, כמו גם מאפשר לאלץ הפעלת HDR או לכבות מצב 60 פריימים לשנייה אם אתם מעדיפים חוויה קולנועית. (תצורות התקן מותאמות אישית עבור תכונות אלה ניתן למצוא בשרת הדיסקורד שלנו (https://discord.gg/Vanced) או ב־XDA)\n- כפה את רזולוציית הווידאו המוגדרת כברירת מחדל כגבוהה או כנמוכה ככל שתרצה ואפילו עקוף את רזולוציית המסך שלך עבור הזרמה באיכות 4k בכל מכשיר. כמו גם מאפשר לשנות את מהירות ההפעלה המוגדרת כברירת מחדל לכל דבר שבין 0.25x ל־2x (בהנחה שהמכשיר שלך מספיק חזק בשביל זה)\n- מאפשר להחליף מודעות במסך הבית, רוב המודעות בממשק המשתמש, מודעות סחר, פוסטים בקהילה, מכירת סרטים, מידע קומפקטי בבאנרים (כגון מידע אודות על COVID-19), להסיר תגובות לחלוטין, קטגוריית סרטים ועוד דברים רבים נוספים!"
    },
    {
      "title": "חוסם החסויות",
      "description": "- כולל יכולת לדלג על קטעי חסות (כאשר בעל ערוץ [YouTuber]) מפרסם שירות או מוצר באמצע סרטון).\n- תומך גם בדילוג על קטגוריות אחרות, כמו פתיחים, קטעי סיום וקידום עצמי.\n- משתמש ב־API [נמצא כאן](https://sponsor.ajay.app). ניתן למצוא מידע נוסף על אופן הפעולה.\n- מאפשר גם להמליץ על קטעים משלכם ל־API ולתרום לקהילה הרחבה.\n- שליטה מלאה אם לדלג אוטומטית על קטגוריית קטעים שלמה או להציג כפתור לדילוג, או פשוט לא לדלג עליה בכלל.\n- מדגיש את הקטע בצבע הספציפי על סמך הקטגוריה שלו בציר הזמן של ההפעלה."
    },
    {
      "title": "פלטפורמות",
      "description": "היישומים שלנו זמינים רק למכשירי אנדרואיד ואין כרגע תוכניות לתמוך בפלטפורמות אחרות"
    },
    {
      "title": "הבדלים בין גרסאות עם ובלי Root",
      "description": "#### עם Root:\nהגרסה בעלת הרשאות Root של Vanced מחליפה בצורה חלקה את אפליקציית YouTube הרשמית. כתוצאה מכך, ניתן אף לפתוח ישירות קישורי YouTube או להשתמש בהם באמצעות העוזרת הקולית של Google דרך אפליקציית Vanced המעוצבת.\n\n#### ללא Root:\n- אם יש לך מכשיר שקשה לתת לו הרשאות Root, או שאינך רוצה בכך, עליך לבחור בגרסה שאינה דורשת הרשאות Root.\n- כיוון ששם החבילה של הגרסה שאינה דורשת הרשאות Root שונה מאפליקציית YouTube הרגילה, הם יכולים להתקיים זו לצד זו. שים לב כי עליך להתקין אפליקציה נלווית נוספת (Vanced microG) כדי שתוכל להתחבר לחשבון YouTube/Google שלך.\nיתר על כן, עליך להגדיר ידנית את Vanced כאפליקציית ברירת המחדל לפתיחת קישורי YouTube.\n- עם זאת, הגרסה שאינה דורשת הרשאות Root היא הרבה יותר פשוטה להתקנה ולשימוש, לכן אנו ממליצים שתישאר עימה, אלא אם כן אתה באמת צריך להחליף את אפליקציית YouTube הרגילה במכשיר שלך."
    }
  ]
}
