{
  "data": [
    {
      "title": "Что такое Youtube Vanced?",
      "description": "YouTube Vanced — это модифицированная версия YouTube с дополнительными функциями и улучшениями для того, чтобы сделать использование YouTube чуточку лучше!\n\nТакие дополнительные функции, как:\n\n- Воспроизведение в фоне\n- Картинка в картинке\n- Пользовательские темы (обычный темный цвет или черный для OLED)\n- Блокировка большинства видов рекламы\n- Изменение максимального разрешения видео\n- ...И многое другое!\n\nДля дополнительной информации, посетите <https://vancedapp.com>"
    },
    {
      "title": "А где кнопка для скачивания?",
      "description": "Of course, Google won't allow a modified version of its own app to be on their store so don't look for it on the Google Play Store, those are just fake apps.\n\nVanced apps can be downloaded and installed using Vanced Manager which can be found on our official website: <https://vancedapp.com> but you can also grab it from [GitHub repo](https://github.com/YTVanced/VancedManager/releases/latest)."
    },
    {
      "title": "Будет ли приложение автоматически обновляться?",
      "description": "Нет, не будет.\n\nVanced Manager вышлет вам уведомление, когда обновление выйдет.\n\nВы также можете присоединиться к нашему [серверу Discord](https://discord. g/wYrRPgv) или к [каналу в Telegram](https://t.me/Vanced) для получения последних новостей и уведомлений об обновлениях."
    },
    {
      "title": "Может ли Vanced скачивать видео?",
      "description": "Vanced не имеет функции загрузки видео и она никогда не будет добавлена.\n\nМногие видео доступны для скачивания бесплатно в [некоторых странах](https://support. oogle.com/youtube/answer/6141269). Для остального мира, пожалуйста, скачайте YouTube Premium или используйте сторонний загрузчик.\n\nОпять же, команда Vanced НИКОГДА добавит скачивание видео в приложение или что-то подобное.\n\nЭто причина закрытия многих модов YouTube в прошлом, поскольку Google не любит когда люди скачивают контент, защищённый авторским правом, поэтому не спрашивайте об этом!!!"
    },
    {
      "title": "Почему не работают свайп-жесты?",
      "description": "Если вы включили \"старые комментарии\" из настроек YouTube > Настройки Vanced > Настройки внешнего вида, отключите его и перезапустите приложение. Если это не работает, попробуйте очистить данные приложения и кэш."
    },
    {
      "title": "Почему субтитры недоступны?",
      "description": "Это не проблема. Не все видео имеют субтитры."
    },
    {
      "title": "Вы принимаете пожертвования?",
      "description": "Мы НЕ принимаем никаких пожертвований ни при каких обстоятельствах и любой сайт или ссылка или сообщение, которые говорят о \"пожертвовании для Vanced\" — фальшивые.\n\nНо если вы хотите поддержать разработчиков Vanced, вы можете скачать Brave по [этой ссылке](https://brave.com/kev231) и AdGuard по [этой ссылке](https://adguard.com/en/welcome.html?aid=31141)."
    },
    {
      "title": "Как автоматически скрывать управление плеером?",
      "description": "Используйте встроенные настройки специальных возможностей для изменения и управления функциями. Откройте настройки в приложении \"Youtube Vanced\" и нажмите на кнопку специальных возможностей. Это откроет параметр, который показан на рисунке выше.\nЕсли опции все еще не найдены, перейдите к настройкам устройства > специальные возможности и найдите \"Меню специальных возможностей\" и отключите ее.\nТакже, если это не работает, отключите усилитель звука, Switch Access, автоматические субтитры, если они включены."
    },
    {
      "title": "Почему приложение разбито на несколько частей?",
      "description": "Потому, что: \n1. Обычное приложение YouTube тоже разбито на несколько частей.\n2. Такой способ установки позволяет загружать только нужный вам язык для экономии места.\n3. Приложение содержит только нужные библиотеки для вашего устройства.\n\nКонечно, Vanced Manager или разработчики могли бы конвертировать все это в обычный APK, но нам лень этим заниматься. Вам просто нужно привыкнуть к тому, что вы предлагаем.\n\nНе волнуйтесь, Vanced Manager все сделает за вас при нажатии на кнопку \"Установить\"."
    },
    {
      "title": "Почему цвет на экране запуска отличается от темы?",
      "description": "Цвет фона на заставке теперь взят из цвета фреймворка Android (система Android), чтобы убедиться, что Vanced/Youtube изменяет свой цвет в соответствии с системной темой. Независимо от цвета в фреймворке Android, такой же цвет будет использоваться и в Vanced.\n\nВы можете использовать темы Substratum/Swift для изменения цвета темы."
    },
    {
      "title": "Зачем загружать файлы установки заново?",
      "description": "Причина довольно проста: иногда скачанные файлы могут быть повреждены и попытка их установки приведет к множественным ошибкам. Чтобы избежать этого, менеджер перезагружает файлы каждый раз при нажатии кнопки.\n\nОднако, Non-Root установщик теперь может использовать загруженные файлы для переустановки Vanced."
    },
    {
      "title": "Почему рут-версия не имеет разрешения на микрофон?",
      "description": "Всё есть, если ваш Vanced актуален."
    },
    {
      "title": "Что такое ExoPlayer v1?",
      "description": "Это старая версия медиаплеера используемого YouTube. Производительность и стабильность может быть лучше при его использовании."
    },
    {
      "title": "Опции для разработчиков",
      "description": "В расширенных настройках нажмите на раздел \"О программе\" 6-7 раз, чтобы разблокировать секретное меню. Это меню позволяет использовать дополнительные настройки видеокодека."
    },
    {
      "title": "Как сделать YouTube Vanced по умолчанию?",
      "description": "As the title says, a lot of users have been asking many times how they can make YouTube Vanced as default for opening YouTube links from other apps(like browsers, messaging apps and any other app).\n\nFor root, you don't need to worry about because it is already set by default since YouTube Vanced gets replaced with Stock YouTube.\n\nFor non-root, solutions has been divided between as OneUI, MIUI and the rest.  We can't provide solutions for every OS out there, and you may need to Google it by yourself.",
      "fields": [
        {
          "title": "Пользователи OneUI:",
          "content": "1. Tap and hold down on YouTube or YouTube Vanced app icon from your app drawer.\n2. Tap **App info**.\n3. Find \"**Set as default**\" and tap it\n4. Tap \"**Open supported links**\" and choose \"**Open in this app**\"\n\nIn older versions of OneUI, the name of the options in the 4th step might be slightly different. You may need to tap \"**Go to supported URLs**\" and choose \"**In this app**\" option.\nIn the very older version of OneUI 💩, you may need to go to **Settings** > **Apps** > *[tap three dots at the right corner]* > **Default apps** > **Set as default**. After apps loaded Find YouTube Vanced or YouTube and follow the 4th step..."
        },
        {
          "title": "Пользователи MIUI:",
          "content": "1. Open Settings\n2. Go to **Apps**,\n3. **Manage apps**,\n4. Then, tap the three dots at the right corner,\n5. **Default apps**,\n6. **Opening links**.\n7. Wait until all your apps gets listed…\n8. Find YouTube or YouTube Vanced and tap it.\n9. Tap \"**Open supported links**\" and choose \"**Open**\""
        },
        {
          "title": "AOSP и другие пользовательские интерфейсы (OOS, ColorOS, EMUI, и т.д.):",
          "content": "1. Open **Settings**\n2. Go to **Apps**\n3. Tap **Default apps**\n4. Find **YouTube** or **YouTube Vanced**\n5. Tap \"**Go to Supported URLs**\" and choose \"**Open in this app**\" option\n\nIf you're still troubling with this, you may need to search some \"how to\" articles/videos on [Google](https://www.google.com/search?q=%22android%22+how+to+open+youtube+links+with+youtube) or you can install a 3rd party app from [Play Store](https://play.google.com/store/search?q=open%20with) to save you from this hassle…"
        }
      ]
    },
    {
      "title": "Почему вариант root не работает с microG Core?",
      "description": "1. You need to have at least the [pico](https://github.com/opengapps/opengapps/wiki/Pico-Package) variant of GApps to run Vanced.\n\n2. You can’t run Vanced with microG Core without Google Play Services Framework which is available in all GApps packages and it's a required library.\n\n3. If you are worried about your privacy & don’t want to use GApps but still want to use watch YouTube without ads, then the [web version](https://youtube.com) is always available."
    },
    {
      "title": "Почему трансляция не работает?",
      "description": "Для пользователей последней версией v16.16.38 non-root версии, в исходном коде microG есть баг. До решения бага, пожалуйста ждите обновлений или вернитесь на версию v15. Пользователи root не будут испытывать проблемы с трансляцией экрана при использовании сервисов Google Play."
    },
    {
      "title": "Что такое подпись APK?",
      "description": "You are reading this because you are not using Vanced Manager or you may have installed Vanced from an unofficial source.\nJust use Vanced Manager!\n\nYou can safely download Vanced Manager from:\n- [Official site](https://vancedapp.com)\n- [GitHub repository](https://github.com/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Есть ли YouTube Vanced в Play Маркете?",
      "description": "NO!\nAgain, DO NOT install or even try to search for any fake apps named \"YouTube Vanced\" or similar on the Play Store or any app stores to install Vanced.\n\nWe only have [Vanced Guide](https://play.google.com/store/apps/details?id=com.vanced.faq), and it's the only official app published on Play Store.\n\nIf you find any other app with our icon and name, report it as impersonation and give it a bad review.\n\nOur apps can only be found at [official site](https://vancedapp.com)."
    },
    {
      "title": "Почему Vanced не видно на главном экране или в меню приложений?",
      "description": "Вы читаете это, потому что вы не используете Vanced Manager или вы могли установить Vanced из неофициального источника. \nИспользуйте Vanced Manager!\n\nВы можете безопасно скачать Vanced Manager с:\n- Официального сайта <https://vancedapp.com> \n- [Репозитория GitHub](https://github. om/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Почему видео не воспроизводятся?",
      "description": "Попробуйте перезапустить приложение. Также это может быть связано с вашим интернет-соединением или устройством."
    },
    {
      "title": "Почему у меня есть ограничение в 480p?",
      "description": "Из-за COVID-19, Google ограничивает использование данных для нескольких стран. Это происходит на сервере и затрагивает как пользователей Vanced, так и пользователь обычного YouTube.",
      "fields": [
        {
          "title": "Обходные решения:",
          "content": "1. Подключитесь через VPN используя другой регион.\n2. Используйте [веб-версию] (https://youtube.com)\n3. Поскольку ограничение 480p существует только для мобильных устройств и не для планшетов, вы можете изменить модель устройства в YouTube Vanced для преодоления ограничения.\n\n#### Как изменить модель устройства?\n1. Откройте YouTube Vanced.\n2. Перейдите в Настройки\n3. Нажмите на \"Расширенные настройки\"\n4. Включите скрытые настройки\n  - Прокрутите вниз до конца и нажимайте на раздел \"О программе\" до тех пор, пока вы не получите сообщение о том, что скрытые настройки включены.\n5. Перейдите в Режим переопределения кодека\n6. Укажите в разделе устройство Samsung и модель \"SM-T865\".\n7. Перезапустите приложение.\n\nПосле перезапуска, лимит в 480p должен уйти."
        }
      ]
    },
    {
      "title": "Как скрыть уведомление от microG?",
      "description": "To hide microG the notification,\n\n1. You can disable battery optimization for Vanced microG and reboot your device.\n\n2. If the above method doesn't work, disable microG notifications by holding on to the notification, toggle it off and tap Save.\n\n> Disabling app notifications can be done in different ways depending on the Android user interface. If you don't know how to disable it, try using Google for learning how to disable it."
    },
    {
      "title": "Выглядит ли 1440p лучше на моем 1080p экране?",
      "description": "Да, но только если соотношение сторон экрана 18:9 или 21:9, ... Вы можете включить \"Статистика для сисадминов` в \"Настройки > Основные\" чтобы удостовериться.\n\nЧтобы включить более высокое разрешение видео, перейдите в \"Настройки Vanced > Настройки видео\", включите \"Максимальное разрешение\" и перезапустите приложение."
    }
  ]
}
