{
  "data": [
    {
      "title": "Что такое Youtube Vanced?",
      "description": "YouTube Vanced — это модифицированная версия YouTube с дополнительными функциями и улучшениями для того, чтобы сделать использование YouTube чуточку лучше!\n\nТакие дополнительные функции, как:\n\n- Воспроизведение в фоне\n- Картинка в картинке\n- Пользовательские темы (обычный темный цвет или черный для OLED)\n- Блокировка большинства видов рекламы\n- Изменение максимального разрешения видео\n- ...И многое другое!\n\nДля дополнительной информации, посетите <https://vancedapp.com>"
    },
    {
      "title": "А где кнопка для скачивания?",
      "description": "Компания Google не разрешает публикацию своего модифицированного приложения в магазине, поэтому не ищите его в Play Market, все эти приложения являются подделками.\n\nВы можете скачать его с официального сайта: <https://vancedapp.com>, а также с репозитория на GitHub: <https://github.com/YTVanced/VancedManager/releases/latest>"
    },
    {
      "title": "Будет ли приложение автоматически обновляться?",
      "description": "Нет, не будет.\n\nVanced Manager вышлет вам уведомление, когда обновление выйдет.\n\nВы также можете присоединиться к нашему [серверу Discord](https://discord. g/wYrRPgv) или к [каналу в Telegram](https://t.me/Vanced) для получения последних новостей и уведомлений об обновлениях."
    },
    {
      "title": "Может ли Vanced скачивать видео?",
      "description": "Vanced не имеет функции загрузки видео и она никогда не будет добавлена.\n\nМногие видео доступны для скачивания бесплатно в [некоторых странах](https://support. oogle.com/youtube/answer/6141269). Для остального мира, пожалуйста, скачайте YouTube Premium или используйте сторонний загрузчик.\n\nОпять же, команда Vanced НИКОГДА добавит скачивание видео в приложение или что-то подобное.\n\nЭто причина закрытия многих модов YouTube в прошлом, поскольку Google не любит когда люди скачивают контент, защищённый авторским правом, поэтому не спрашивайте об этом!!!"
    },
    {
      "title": "Почему не работают свайп-жесты?",
      "description": "Если вы включили \"старые комментарии\" из настроек YouTube > Настройки Vanced > Настройки внешнего вида, отключите его и перезапустите приложение. Если это не работает, попробуйте очистить данные приложения и кэш."
    },
    {
      "title": "Почему субтитры недоступны?",
      "description": "Это не проблема. Не все видео имеют субтитры."
    },
    {
      "title": "Вы принимаете пожертвования?",
      "description": "Мы НЕ принимаем никаких пожертвований ни при каких обстоятельствах и любой сайт или ссылка или сообщение, которые говорят о \"пожертвовании для Vanced\" — фальшивые.\n\nНо если вы хотите поддержать разработчиков Vanced, вы можете скачать Brave по [этой ссылке](https://brave.com/kev231) и AdGuard по [этой ссылке](https://adguard.com/en/welcome.html?aid=31141)."
    },
    {
      "title": "Как автоматически скрывать управление плеером?",
      "description": "Используйте встроенные настройки специальных возможностей для изменения и управления функциями. Откройте настройки в приложении \"Youtube Vanced\" и нажмите на кнопку специальных возможностей. Это откроет параметр, который показан на рисунке выше.\nЕсли опции все еще не найдены, перейдите к настройкам устройства > специальные возможности и найдите \"Меню специальных возможностей\" и отключите ее.\nТакже, если это не работает, отключите усилитель звука, Switch Access, автоматические субтитры, если они включены."
    },
    {
      "title": "Почему приложение разбито на несколько частей?",
      "description": "Потому, что: \n1. Обычное приложение YouTube тоже разбито на несколько частей.\n2. Такой способ установки позволяет загружать только нужный вам язык для экономии места.\n3. Приложение содержит только нужные библиотеки для вашего устройства.\n\nКонечно, Vanced Manager или разработчики могли бы конвертировать все это в обычный APK, но нам лень этим заниматься. Вам просто нужно привыкнуть к тому, что вы предлагаем.\n\nНе волнуйтесь, Vanced Manager все сделает за вас при нажатии на кнопку \"Установить\"."
    },
    {
      "title": "Почему цвет на экране запуска отличается от темы?",
      "description": "Цвет фона на заставке теперь взят из цвета фреймворка Android (система Android), чтобы убедиться, что Vanced/Youtube изменяет свой цвет в соответствии с системной темой. Независимо от цвета в фреймворке Android, такой же цвет будет использоваться и в Vanced.\n\nВы можете использовать темы Substratum/Swift для изменения цвета темы."
    },
    {
      "title": "Зачем загружать файлы установки заново?",
      "description": "Причина довольно проста: иногда скачанные файлы могут быть повреждены и попытка их установки приведет к множественным ошибкам. Чтобы избежать этого, менеджер перезагружает файлы каждый раз при нажатии кнопки.\n\nОднако, Non-Root установщик теперь может использовать загруженные файлы для переустановки Vanced."
    },
    {
      "title": "Почему рут-версия не имеет разрешения на микрофон?",
      "description": "Всё есть, если ваш Vanced актуален."
    },
    {
      "title": "Что такое ExoPlayer v1?",
      "description": "Это старая версия медиаплеера используемого YouTube. Производительность и стабильность может быть лучше при его использовании."
    },
    {
      "title": "Опции для разработчиков",
      "description": "В расширенных настройках нажмите на раздел \"О программе\" 6-7 раз, чтобы разблокировать секретное меню. Это меню позволяет использовать дополнительные настройки видеокодека."
    },
    {
      "title": "Почему вариант root не работает с microG Core?",
      "description": "1. Вам нужно нужен хотя установить [pico](https://github.com/opengapps/opengapps/wiki/Pico-Package) вариант GApps для запуска Vanced.\n\n2. Вы не можете запустить Vanced с microG Core потому что он требует Google Play Services Framework, который доступен во всех пакетах GApps.\n\n3. Если вы обеспокоены конфиденциальностью и не хотите использовать GApps, но все ещё хотите использовать Vanced, то вы можете использовать [веб-версию](https://youtube.com) сайта."
    },
    {
      "title": "Почему трансляция экрана не работает?",
      "description": "Трансляция экрана работает если у вас последняя версия MicroG."
    },
    {
      "title": "Что такое подпись APK?",
      "description": "Вы читаете это, потому что вы не используете Vanced Manager или вы могли установить Vanced из неофициального источника. \nИспользуйте Vanced Manager!\n\nВы можете безопасно скачать Vanced Manager с:\n- Официального сайта <https://vancedapp.com> \n- [Репозитория GitHub](https://github. om/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "YouTube Vanced есть в Play Маркете?",
      "description": "СТОП!\nНе устанавливайте или не пытайтесь найти поддельные приложения под названием \"YouTube Vanced\" или подобные приложения для установки Vanced.\n\nУ нас есть только [Vanced Guide](https://play.google.com/store/apps/details?id=com. anced.faq), и это единственное официальное приложение опубликованное в Play Store.\n\nЕсли вы найдете любое другое приложение с нашим значком и именем, сообщите об этом как мошенничество и напишите плохой отзыв.\n\nНаши приложения можно найти только на <https://vancedapp.com>."
    },
    {
      "title": "Почему Vanced не видно на главном экране или в меню приложений?",
      "description": "Вы читаете это, потому что вы не используете Vanced Manager или вы, возможно, установили Vanced из неофициального источника. \nИспользуйте Vanced Manager!\n\nВы можете безопасно скачать Vanced Manager с:\n- Официального сайта <https://vancedapp.com> \n- [Репозитория GitHub](https://github. om/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Почему видео не воспроизводится?",
      "description": "Попробуйте перезапустить приложение. Это также может быть связано с вашим интернет-соединением или устройством."
    },
    {
      "title": "Почему у меня есть ограничение в 480p?",
      "description": "Из-за COVID-19, Google ограничивает использование данных для нескольких стран. Это происходит на сервере и затрагивает как пользователей Vanced, так и пользователь обычного YouTube.",
      "fields": [
        {
          "title": "Обходные решения:",
          "content": "1. Подключитесь через VPN используя другой регион.\n2. Используйте [веб-версию](https://youtube.com)\n3. Поскольку ограничение 480p существует только для мобильных устройств и не для планшетов, вы можете изменить модель устройства в YouTube Vanced для преодоления ограничения.\n\n#### Как изменить модель устройства?\n1. Откройте YouTube Vanced.\n2. Включите дополнительные опции \n  1. Перейдите в Настройки\n  2. Нажмите Встроенные настройки\n  3. Нажмите на раздел \"О программе\" до тех пор, пока вы не получите сообщение о том, что скрытые настройки включены.\nПерейдите в режим переопределения кодека и установите модель \"SM-T865\" и устройство в Samsung.\n4. Перезапустите приложение и лимит 480p пропадет."
        }
      ]
    },
    {
      "title": "Как скрыть уведомление от microG?",
      "description": "Чтобы скрыть уведомления microG, вы можете отключить оптимизацию батареи для MicroG и перезагрузить устройство.\n\nЕсли уведомление все еще есть после перезагрузки, отключите уведомления microG, удерживая уведомление, отключите их и нажмите \"Сохранить\".\n\nОтключение уведомлений от приложения может осуществляться различными способами в зависимости от пользовательского интерфейса Android. Если вы не знаете, как его отключить, попробуйте использовать Google для изучения того, как его отключить."
    },
    {
      "title": "Выглядит ли 1440p лучше на моем 1080p экране?",
      "description": "Да, но только если соотношение сторон экрана 18:9 или 21:9, ... Вы можете включить \"Статистика для сисадминов` в \"Настройки > Основные\" чтобы удостовериться.\n\nЧтобы включить более высокое разрешение видео, перейдите в \"Настройки Vanced > Настройки видео\", включите \"Максимальное разрешение\" и перезапустите приложение."
    }
  ]
}