{
  "data": [
    {
      "title": "Что такое Youtube Vanced?",
      "description": "YouTube Vanced — это модифицированная версия YouTube с дополнительными функциями и улучшениями для того, чтобы сделать использование YouTube чуточку лучше!\n\nТакие дополнительные функции, как:\n\n- Воспроизведение в фоне\n- Картинка в картинке\n- Пользовательские темы (обычный темный цвет или черный для OLED)\n- Блокировка большинства видов рекламы\n- Изменение максимального разрешения видео\n- ...И многое другое!\n\nДля дополнительной информации, посетите <https://vancedapp.com>"
    },
    {
      "title": "А где кнопка для скачивания?",
      "description": "Конечно, Google не позволит модифицированной версии собственного приложения находиться в своем магазине, поэтому не ищите его в Google Play Store, это просто поддельные приложения.\n\nПриложения Vanced можно загрузить и установить с помощью Vanced Manager, который можно найти на нашем официальном сайте: <https://vancedapp.com>, но вы также можете взять его из [GitHub репозитория](https://github.com/YTVanced/VancedManager/releases/latest)."
    },
    {
      "title": "Будет ли приложение автоматически обновляться?",
      "description": "Нет, не будет.\n\nVanced Manager вышлет вам уведомление, когда обновление выйдет.\n\nВы также можете присоединиться к нашему [серверу Discord](https://discord. g/wYrRPgv) или к [каналу в Telegram](https://t.me/Vanced) для получения последних новостей и уведомлений об обновлениях."
    },
    {
      "title": "Может ли Vanced скачивать видео?",
      "description": "Vanced не имеет функции загрузки видео и она никогда не будет добавлена.\n\nМногие видео доступны для скачивания бесплатно в [некоторых странах](https://support. oogle.com/youtube/answer/6141269). Для остального мира, пожалуйста, скачайте YouTube Premium или используйте сторонний загрузчик.\n\nОпять же, команда Vanced НИКОГДА добавит скачивание видео в приложение или что-то подобное.\n\nЭто причина закрытия многих модов YouTube в прошлом, поскольку Google не любит когда люди скачивают контент, защищённый авторским правом, поэтому не спрашивайте об этом!!!"
    },
    {
      "title": "Why don't the swipe gestures work?",
      "description": "Если вы включили \"старые комментарии\" из настроек YouTube > Настройки Vanced > Настройки внешнего вида, отключите его и перезапустите приложение. Если это не работает, попробуйте очистить данные приложения и кэш."
    },
    {
      "title": "Почему субтитры недоступны?",
      "description": "Это не проблема. Не все видео имеют субтитры."
    },
    {
      "title": "Вы принимаете пожертвования?",
      "description": "Мы НЕ принимаем никаких пожертвований ни при каких обстоятельствах и любой сайт или ссылка или сообщение, которые говорят о \"пожертвовании для Vanced\" — фальшивые.\n\nНо если вы хотите поддержать разработчиков Vanced, вы можете скачать Brave по [этой ссылке](https://brave.com/kev231) и AdGuard по [этой ссылке](https://adguard.com/en/welcome.html?aid=31141)."
    },
    {
      "title": "Как автоматически скрывать управление плеером?",
      "description": "Используйте встроенные настройки специальных возможностей для изменения и управления функциями. Откройте настройки в приложении \"Youtube Vanced\" и нажмите на кнопку специальных возможностей. Это откроет параметр, который показан на рисунке выше.\nЕсли опции все еще не найдены, перейдите к настройкам устройства > специальные возможности и найдите \"Меню специальных возможностей\" и отключите ее.\nТакже, если это не работает, отключите усилитель звука, Switch Access, автоматические субтитры, если они включены."
    },
    {
      "title": "Почему приложение разбито на несколько частей?",
      "description": "Потому, что: \n1. Обычное приложение YouTube тоже разбито на несколько частей.\n2. Такой способ установки позволяет загружать только нужный вам язык для экономии места.\n3. Приложение содержит только нужные библиотеки для вашего устройства.\n\nКонечно, Vanced Manager или разработчики могли бы конвертировать все это в обычный APK, но нам лень этим заниматься. Вам просто нужно привыкнуть к тому, что вы предлагаем.\n\nНе волнуйтесь, Vanced Manager все сделает за вас при нажатии на кнопку \"Установить\"."
    },
    {
      "title": "Why does the color in the startup screen not match the theme? ",
      "description": "Цвет фона на заставке теперь взят из цвета фреймворка Android (система Android), чтобы убедиться, что Vanced/Youtube изменяет свой цвет в соответствии с системной темой. Независимо от цвета в фреймворке Android, такой же цвет будет использоваться и в Vanced.\n\nВы можете использовать темы Substratum/Swift для изменения цвета темы."
    },
    {
      "title": "Зачем загружать файлы установки заново?",
      "description": "Причина довольно проста: иногда скачанные файлы могут быть повреждены и попытка их установки приведет к множественным ошибкам. Чтобы избежать этого, менеджер перезагружает файлы каждый раз при нажатии кнопки.\n\nОднако, Non-Root установщик теперь может использовать загруженные файлы для переустановки Vanced."
    },
    {
      "title": "Why doesn't the root version have Microphone permissions? ",
      "description": "Всё есть, если ваш Vanced актуален."
    },
    {
      "title": "Что такое ExoPlayer v1?",
      "description": "Это старая версия медиаплеера используемого YouTube. Производительность и стабильность может быть лучше при его использовании."
    },
    {
      "title": "Опции для разработчиков",
      "description": "В расширенных настройках нажмите на раздел \"О программе\" 6-7 раз, чтобы разблокировать секретное меню. Это меню позволяет использовать дополнительные настройки видеокодека."
    },
    {
      "title": "Как сделать YouTube Vanced по умолчанию?",
      "description": "As the title says, a lot of users have been asking many times how they can make YouTube Vanced as default for opening YouTube links from other apps(like browsers, messaging apps and any other app).\n\nFor root, you don't need to worry about because it is already set by default since official YouTube gets replaced with YouTube vanced.\n\nFor non-root, solutions has been divided between as OneUI, MIUI and the rest.  We can't provide solutions for every OS out there, and you may need to Google it by yourself.",
      "fields": [
        {
          "title": "Пользователи OneUI:",
          "content": "1. Нажмите и удерживайте значок приложения YouTube или YouTube Vanced в ящике приложений.\n2. Нажмите **Информация о приложении**.\n3. Найдите пункт \"**Установить по умолчанию**\" и нажмите его.\n4. Нажмите \"**Открывать поддерживаемые ссылки**\" и выберите \"**Открывать в этом приложении**\".\n\nВ старых версиях OneUI название опций на 4-м шаге может быть немного другим. Вам может понадобиться нажать \"**Перейти к поддерживаемым URL**\" и выбрать опцию \"**В этом приложении**\".\nВ очень старой версии OneUI 💩 вам может понадобиться перейти в **Настройки** > **Приложения** > *[нажать на три точки в правом углу]* > **Приложения по умолчанию** > **Установить по умолчанию**. После загрузки приложений найдите YouTube Vanced или YouTube и выполните 4-й шаг..."
        },
        {
          "title": "Пользователи MIUI:",
          "content": "1. Откройте Настройки\n2. Перейдите в раздел **Приложения**,\n3. **Управление приложениями**,\n4. Затем нажмите на три точки в правом углу,\n5. **Приложения по умолчанию**,\n6. **Открытые ссылки**.\n7. Подождите, пока все ваши приложения появятся в списке…\n8. Найдите YouTube или YouTube Vanced и нажмите на него.\n9. Нажмите \"**Открыть поддерживаемые ссылки**\" и выберите \"**Открыть**\""
        },
        {
          "title": "AOSP и другие пользовательские интерфейсы (OOS, ColorOS, EMUI, и т.д.):",
          "content": "1. Откройте **Настройки**.\n2. Перейдите в раздел **Приложения**.\n3. Нажмите на **Приложения по умолчанию**.\n4. Найдите **YouTube** или **YouTube Vanced**.\n5. Нажмите \"**Перейти к поддерживаемым URL**\" и выберите опцию \"**Открыть в этом приложении**\".\n\nЕсли вы все ещё не можете решить эту проблему, вам может потребоваться поиск статей/туториалы в [Google](https://www.google.com/search?q=%22android%22+как+открыть+ютуб+ссылки+с+ютуба) или вы можете установить стороннее приложение из [Play Маркета](https://play.google.com/store/search?q=open%20with), чтобы избавить себя от этой проблемы…"
        }
      ]
    },
    {
      "title": "Why doesn't the root variant work with the microG core? ",
      "description": "1. You need to have at least the [pico](https://github.com/opengapps/opengapps/wiki/Pico-Package) variant of GApps to run Vanced.\n\n2. You can’t run Vanced with microG Core without Google Play Services Framework which is available in all GApps packages and it's a required library.\n\n3. If you are worried about your privacy & don’t want to use GApps but still want to use watch YouTube without ads, then the [web version](https://youtube.com) is always available."
    },
    {
      "title": "Why doesn't casting work?",
      "description": "For users with v16.16.38 and all above non-root variants and root variants who are using microG based ROMs, there's a bug in upstream microG. Until that resolves, please wait for updates or roll back to v15 versions. If you use Google Play Services with root variants, you won't have any problems with casting."
    },
    {
      "title": "Что такое подпись APK?",
      "description": "Вы читаете это, потому что не используете Vanced Manager или, возможно, установили Vanced из неофициального источника.\nПросто скачайте Vanced Manager!\n\nВы можете безопасно скачать Vanced Manager с:\n- [Официального сайта](https://vancedapp.com)\n- [Репозитория GitHub](https://github.com/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Есть ли YouTube Vanced в Play Маркете?",
      "description": "НЕТ!\nОпять же, НЕ устанавливайте и даже не пытайтесь искать любые поддельные приложения с названием \"YouTube Vanced\" или подобные им в Play Маркете или любых других магазинах приложений для установки Vanced.\n\nВ Play Маркете у нас есть только [Vanced Guide](https://play.google.com/store/apps/details?id=com.vanced.faq), и это единственное официальное приложение.\n\nЕсли вы найдёте любое другое приложение с нашей иконкой и названием, сообщите об этом как о самозванстве и оставьте плохой отзыв.\n\nНаши приложения можно найти только на [официальном сайте](https://vancedapp.com)."
    },
    {
      "title": "Почему Vanced не видно на главном экране или в меню приложений?",
      "description": "Вы читаете это, потому что вы не используете Vanced Manager или вы могли установить Vanced из неофициального источника. \nИспользуйте Vanced Manager!\n\nВы можете безопасно скачать Vanced Manager с:\n- Официального сайта <https://vancedapp.com> \n- [Репозитория GitHub](https://github. om/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Почему видео не воспроизводятся?",
      "description": "Попробуйте перезапустить приложение. Также это может быть связано с вашим интернет-соединением или устройством."
    },
    {
      "title": "Почему у меня есть ограничение в 480p?",
      "description": "Из-за COVID-19, Google ограничивает использование данных для нескольких стран. Это происходит на сервере и затрагивает как пользователей Vanced, так и пользователь обычного YouTube.",
      "fields": [
        {
          "title": "Обходные решения:",
          "content": "1. Подключитесь через VPN используя другой регион.\n2. Используйте [веб-версию] (https://youtube.com)\n3. Поскольку ограничение 480p существует только для мобильных устройств и не для планшетов, вы можете изменить модель устройства в YouTube Vanced для преодоления ограничения.\n\n#### Как изменить модель устройства?\n1. Откройте YouTube Vanced.\n2. Перейдите в Настройки\n3. Нажмите на \"Расширенные настройки\"\n4. Включите скрытые настройки\n  - Прокрутите вниз до конца и нажимайте на раздел \"О программе\" до тех пор, пока вы не получите сообщение о том, что скрытые настройки включены.\n5. Перейдите в Режим переопределения кодека\n6. Укажите в разделе устройство Samsung и модель \"SM-T865\".\n7. Перезапустите приложение.\n\nПосле перезапуска, лимит в 480p должен уйти."
        }
      ]
    },
    {
      "title": "Как скрыть уведомление от microG?",
      "description": "Чтобы скрыть уведомление microG,\n\n1. Вы можете отключить оптимизацию батареи для Vanced microG и перезагрузить устройство.\n\n2. Если вышеуказанный способ не сработал, отключите уведомления microG, нажимая и удерживая уведомление, переключите его и нажмите \"Сохранить\".\n\n> Отключение уведомлений приложений может быть выполнено разными способами в зависимости от пользовательского интерфейса Android. Если вы не знаете, как отключить уведомления, попробуйте воспользоваться поиском Google, чтобы узнать это."
    },
    {
      "title": "Выглядит ли 1440p лучше на моем 1080p экране?",
      "description": "Да, но только если соотношение сторон экрана 18:9 или 21:9, ... Вы можете включить \"Статистика для сисадминов` в \"Настройки > Основные\" чтобы удостовериться.\n\nЧтобы включить более высокое разрешение видео, перейдите в \"Настройки Vanced > Настройки видео\", включите \"Максимальное разрешение\" и перезапустите приложение."
    }
  ]
}
