{
  "features": [
    {
      "title": "Vanced",
      "description": "YouTube Vanced призван стать лучше по сравнению с обычной версией YouTube. Оно включает в себя блокировку рекламы, черную тему и многое другое. Используйте Vanced Manager, чтобы с легкостью установить YouTube Vanced."
    },
    {
      "title": "Vanced Music",
      "description": "Vanced Music имеет ту же цель, что и YouTube Vanced, но фокусируется на YouTube Music. Там относительно меньше возможностей по сравнению с Vanced, но все равно имеет некоторые функции, например, блокирование рекламы и фоновое воспроизведение и всё это в YouTube Music!"
    },
    {
      "title": "Основные функции YouTube Vanced",
      "description": "- Тёмная тема для OLED экранов.\n- Блокирует всю рекламу и позволяет воспроизводить видео в фоновом режиме или в режиме картинка-в-картинке (только на Android 8 и выше)\n- Свайп элементы управления позволяют управлять яркостью и громкостью с помощью жестов вверх и вниз (с настраиваемым отступом).\n- Функция автоповтора, позволяющая вам постоянно проигрывать видео заново.\n- Новое расположение комментариев/мини-плеера может быть переключено на планшетные версии, которое очень похоже на старую версию (но с багами)."
    },
    {
      "title": "Персонализация",
      "description": "- Позволяет вам переопределить параметры видеокодека, такие как принудительный H264 для старых устройств или VP9, это также позволяет вам принудительно включить воспроизведение HDR или выключить 60 кадров в секунду, если вы предпочитаете кинематографичность. (конфигурации устройств для этих функций можно найти в нашем Discord или XDA)\n- Устанавливайте максимальное или низкое разрешение видео по умолчанию и даже переопределите разрешение экрана для четкого воспроизведения 4K на любом устройстве. Оно также позволяет изменять скорость воспроизведения по умолчанию в любом видео между 0.25х до 2х (если ваше устройство достаточно мощное)\n- Позволяет включать или отключать рекламу на домашней странице, большинство рекламы в интерфейсе, рекламу магазинов, сообщения в сообществе, покупку фильмов, компактная информация в виде баннеров (такая как информация о COVID-19), полностью отключить комментарии, отключить полку с фильмами и многое другое!"
    },
    {
      "title": "SponsorBlock",
      "description": "- Возможность пропускать спонсируемые сегменты (когда ютубер рекламирует сервис или продукт в видео)\n- Это также поддерживает пропуск других категорий, таких как заставки, концовки и самопродвижение.\n- Использует найденный API. Вы можете найти дополнительную информацию о том, как она работает\n- Это также позволяет отправлять свои собственные сегменты в API и вносить вклад в широкое сообщество\n- Полный контроль над пропуском, вы можете автоматически пропустить категорию сегмента или включить отображение кнопки для пропуска, или просто не пропускать его вообще.\n- Выделяет сегмент определенным цветом, исходя из его категории на временной шкале воспроизведения."
    },
    {
      "title": "Платформы",
      "description": "В настоящее время приложение существует только на Android, пока планов для поддержки на других платформах нет"
    },
    {
      "title": "Различия между Root и Non-Root",
      "description": "Root-версия:\nRoot-версия Vanced легко заменяет официальное приложение YouTube. В результате вы можете напрямую открыть ссылки на YouTube или открыть их через ассистент Google используя модифицированное приложение.\n- Non-Root версия:\n- Если у вас есть устройство, на которое сложно получить root-доступ или вы не хотите рутировать ваш телефон на каждый день, вы должны выбрать Non-Root версию. \n- Эта версия также может быть установлена на устройстве с рут-доступом. Так как имя пакета у этой версии отличается от стандартного приложения YouTube, они могут сосуществовать. Обратите внимание, что для входа в систему с учетной записью YouTube/Google необходимо установить дополнительное приложение (Vanced microG). \n- Кроме того, вы должны вручную установить Vanced в качестве приложения по умолчанию для открытия YouTube ссылки. \n- Тем не менее, с этой версией проще жить, поэтому мы рекомендуем придерживаться версии Non-Root, если вам не нужно стандартное приложение YouTube на вашем телефоне."
    }
  ]
}
