{
  "data": [
    {
      "title": "Как да докладвам за грешки?",
      "description": "Може да докладвате за грешки, като използвате [GitHub Issue Center] (https://github.com/YTVanced/Vanced#vanced-issue-center).\n\nНе забравяйте да прегледате съществуващите проблеми, за да проверите дали проблемът ви вече е бил докладван, преди да опишете проблема си!",
      "fields": [
        {
          "title": "Кога докладваната от мен грешка ще бъде разгледана?",
          "content": "Разработчиците отделят от времето си за създаване на нови функции и решаване на много проблеми и решаването на всеки от тях може да отнеме известно време.\nПросто трябва да изчакате. Проблемът ви ще бъде разгледан възможно най-скоро."
        },
        {
          "title": "Как да изпълня logcat?",
          "content": "За потребители без root достъп:\nЩе ви бъде необходим PC за да изпълните logcat. Тук имa [текстово ръководство] (https://github.com/YTVanced/Vanced#creating-a-logcat-using-the-android-debug-bridge-adb-on-your-pc) и [видео ръководство] (https://youtu.be/ICLpwgsJJP0).\n\nЗа потребители с root достъп:\nНяма да ви бъде необходим PC за да изпълните logcat. Можете да последвате [инструкциите] (https://github.com/YTVanced/Vanced#creating-a-logcat-using-termux-on-your-rooted-android)."
        },
        {
          "title": "Грешката ви е свързана с потребителския интерфейс?",
          "content": "За грешки, свързани с потребителския интерфейс, ще трябва да предприемете допълнителни стъпки.\n\nМоля, инсталирайте и настройте приложението [Developer Assistant](https://play.google.com/store/apps/details?id=com.appsisle.developerassistant). След което отидете във Vanced и възпроизведете грешката, после отворете Layout viewer като задействате Developer Assistant.\n\nСега следвайте следните стъпки:\n1. Уверете се, че грешката е видима на екрана.\n2. Докоснете елемента, който мислите, че е засегнат от грешката.\n3. Отидете в разделите ,,Element“ и ,,Hierarchy“ и направете снимки на резултатите.\n4. Включете тези снимки при описа на проблема ви."
        }
      ]
    }
  ]
}
