{
  "data": [
    {
      "title": "Какво е YouTube Vanced?",
      "description": "YouTube Vanced е модифицирана версия на YouTube с допълнителни функции за да направи гледането на видео още по-добро!\n\nНякои от тези функции са:\n- Изпълнение на заден план,\n- Картина в картината (PiP),\n- Черна тема (добра за OLED екрани),\n- Премахване на реклами (изисква разрешаване),\n- Смяна на максималната резолюция (позволява възпроизвеждане на видео с резолюция по-висока от тази на екрана ви),\n- ...и много други!\n\nЗа повече информация посетете <https://vancedapp.com>"
    },
    {
      "title": "Къде е бутона за изтегляне?",
      "description": "Естествено Google няма да позволи модифицирана версия на собственото си приложение в магазина си за това не търсете в Google Play Store. Наличните приложения там са фалшиви.\n\nVanced може да бъде изтеглено и инсталирано чрез Vanced Manager който се намира на официалния ни сайт:<https://vancedapp.com> също можете да го вземете и от GitHub:<https://github.com/YTVanced/VancedManager/releases/latest>."
    },
    {
      "title": "Ще се актуализира ли YouTube Vanced само?",
      "description": "Не няма.\n\nVanced Manager ще ви изпрати уведомление когато е налична актуализация.\n\nМожете също да се присъедините в нашия [Discord Server](https://discord.gg/wYrRPgv) или да ни последвате в [Telegram channel](https://t.me/Vanced) за последни новини и обявления за актуализации."
    },
    {
      "title": "Може ли Vanced да изтегля видео?",
      "description": "Vanced не притежава функция за изтегляне на видео и никога няма да има такава.\n\nМного от видеата е възможно да бъдат изтеглени безплатно в [selected countries](https://support.google.com/youtube/answer/6141269). За останалата част от света моля използвайте YouTube Premium или друг допълнителен софтуер от трети страни.\n\nОтново във Vanced НИКОГА няма да бъде вградена функция за изтегляне на видео или нещо подобно.\n\nТова е причината за спирането на много модифицирани версии на YouTube в миналото защото Google не желае хората да изтеглят материали със защитени авторски права от платформата им. За това ви молим да не искате от нас подобна функция!!!"
    },
    {
      "title": "Защо жестовете с плъзгане не работят?",
      "description": "Ако коментарите се показват в дъното (старото място) отидете в Vanced Настройки > Настройки за оформление и го изключете след което рестартирайте приложението. Ако това не помогне спрете принудително приложението и изчистете данните му."
    },
    {
      "title": "Субтитрите са недостъпни?",
      "description": "Това не е проблем. Не всяко видео има субтитри."
    },
    {
      "title": "Приемаме ли дарения?",
      "description": "Ние НЕ ПРИЕМАМЕ дарения!\n\nВсякакъв вид дарения при каквито и да било условия или сайтове, връзки и постове който искат дарения са просто фалшиви.\n\nАко все пак желаете да подпомогнете разработчиците на Vanced можете да изтеглите браузъра Brave като използвате [този линк](https://brave.com/kev231) или приложението AdGuard като използвате [този линк](https://adguard.com/en/welcome.html?aid=31141)."
    },
    {
      "title": "Как да направя оформлението на плейъра да се скрива автоматично?",
      "description": "Можете да го настройте като отидете в YouTube Vanced Настройки > Достъпност. Ако настройките не се отворят отидете в настройките на достъпност на устройството ви и изключете усилване на звука, превключване на достъпа и живи субтитри."
    },
    {
      "title": "Защо се използват разделени .APK файлове?",
      "description": "Защото:\n\n1. Оригиналното приложение ги използва следователно и Vanced също.\n2. Инсталират само избрания от вас език за да се намали употребата на памет.\n3. Имат единствената версия на основния APK файл, която устройството ви изисква.\n\nЕстествено Vanced Manager или разработчиците могат да ги конвертират до нормален единичен APK файл но ние сме мързеливи и не желаем да го направим. Просто трябва да свикнете и да ползвате това което ви предлагаме...\n\nНе се притеснявайте Vanced Manager върши всичката трудна работа вместо вас просто натиснете бутона ,,Инсталиране''."
    },
    {
      "title": "Защо цветът на началния екран не съответства на темата? ",
      "description": "Цвета на фона на началния екран е взет от цветната рамка на Android за да бъде сигурно че ще се променя заедно със системната тема. Можете да ползвате Substratum/Swift теми за да смените цвета."
    },
    {
      "title": "Трябва ли да изтегля инсталационните файлове отново?",
      "description": "Файловете могат да бъдат повредени по много причини и да създават проблеми. За да избегнете това може да изберете да ги изтеглите отново за да бъдете сигурни че инсталацията ще премине нормално."
    },
    {
      "title": "Защо версията, изискваща root достъп не изисква разрешение за ползване на микрофона? ",
      "description": "Изисква ако вашето Vanced приложение е актуализирано до последната версия."
    },
    {
      "title": "Какво е ExoPlayer v1?",
      "description": "Това е стара версия на плейъра който се ползва в YouTube. Приложението може да работи по-бързо и стабилно ако го използвате."
    },
    {
      "title": "Как да бъдат разрешени скритите настройки?",
      "description": "В Vanced Настройки докоснете менюто ,,Относно'' 6-7 пъти за да ги активирате. Това разрешава само допълнителните настройки на видео кодеците."
    },
    {
      "title": "Как да направим YouTube Vanced приложение по подразбиране?",
      "description": "Както се казва в заглавието, много потребители много пъти са питали как могат да направят YouTube Vanced по подразбиране за отваряне на връзки към YouTube от други приложения (като браузъри, приложения за съобщения и всяко друго приложение).\n\nЗа root не е нужно да се притеснявате, защото той вече е зададен по подразбиране, тъй като официалният YouTube се заменя с YouTube vanced.\n\nЗа не-root, решенията бяха разделени между OneUI, MIUI и останалите. Не можем да предоставим решения за всяка операционна система и може да се наложи да го потърсите в Google сами.",
      "fields": [
        {
          "title": "Потребители на OneUI:",
          "content": "1. Докоснете и задръжте иконата на приложението YouTube или YouTube Vanced от чекмеджето на приложението си.\n2. Докоснете **Информация за приложението**.\n3. Намерете „**Задаване по подразбиране**“ и го докоснете\n4. Докоснете „**Отваряне на поддържаните връзки**“ и изберете „**Отваряне в това приложение**“\n\nВ по-старите версии на OneUI името на опциите в четвъртата стъпка може да е малко по-различно. Може да се наложи да докоснете „**Отидете на поддържаните URL адреси**“ и да изберете опцията „**В това приложение**“.\nВ много по-старата версия на OneUI 💩 може да се наложи да отворите **Настройки**> **Приложения**> *[докоснете три точки в десния ъгъл]*> **Приложения по подразбиране**> **Задаване като по подразбиране**. След зареждане на приложенията намерете YouTube Vanced или YouTube и следвайте 4-та стъпка..."
        },
        {
          "title": "Потребители на MIUI:",
          "content": "1. Отворете Настройки\n2. Отидете в **Приложения**,\n3. **Управление на приложенията**,\n4. След това докоснете трите точки в десния ъгъл,\n5. **Стандартни приложения**,\n6. **Отваряне на връзки**.\n7. Изчакайте, докато всичките ви приложения бъдат показани...\n8. Намерете YouTube или YouTube Vanced и го докоснете.\n9. Докоснете „**Отваряне на поддържаните връзки**“ и изберете „**Отваряне**“"
        },
        {
          "title": "AOSP и други потребителски интерфейси (OOS, ColorOS, EMUI и др.):",
          "content": "1. Отворете **Настройки**\n2. Отидете в **Приложения**\n3. Докоснете **Приложения по подразбиране**\n4. Намерете **YouTube** или **YouTube Vanced**\n5. Докоснете „**Отиване на поддържани URL адреси**“ и изберете опцията „**Отваряне в това приложение**“\n\nАко все още имате проблеми с това, може да се наложи да потърсите някои статии/видеоклипове в [Google](https://www.google.com/search?q=%22android%22+как+да+отваряме+youtube+връзки+с+youtube) или можете да инсталирате приложение на трета страна от [Play Store](https://play.google.com/store/search?q=open%20with), за да ви спаси от този казус…"
        }
      ]
    },
    {
      "title": "Защо вариантът, изискващ root не работи с ядрото microG? ",
      "description": "1. Трябва да имате поне [pico](https://github.com/opengapps/opengapps/wiki/Pico-Package) вариант на GApps, за да стартирате Vanced.\n\n2. Не можете да стартирате Vanced с microG Core без Услуги за Google Play Framework, който се предлага във всички GApps пакети и е задължителна библиотека.\n\n3. Ако се притеснявате за поверителността си и не искате да използвате GApps, но все пак искате да гледате YouTube без реклами, тогава [уеб версията](https://youtube.com) е винаги на разположение."
    },
    {
      "title": "Защо предаването към устройства не работи?",
      "description": "За потребители с v16.16.38 и всички следващи не-root варианти и root варианти, които използват ROM-ове, базирани на microG, има грешка в microG. Докато това не се реши, изчакайте актуализации или се върнете към версии v15. Ако използвате Услуги на Google Play с root варианти, няма да имате проблеми с предаването."
    },
    {
      "title": "Какво е подписване на apk?",
      "description": "Четете това защото не ползвате Vanced Manager или сте инсталирали Vanced от неофициален източник. Просто използвайте Vanced Manager!\n\nМожете да изтеглите безопасно Vanced Manager от:\n- Официалния сайт <https://vancedapp.com>\n- [GitHub хранилище](https://github.com/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Налично ли е YouTube Vanced в Play Store?",
      "description": "НЕ!\nОтново да напомним ДА НЕ търсите и инсталирате фалшиви приложения с име \"YouTube Vanced\" или подобни в Play Store или подобни които твърдят че инсталират Vanced.\n\nНие имаме само [Vanced Ръководство](https://play.google.com/store/apps/details?id=com.vanced.faq) и това е единственото приложение което сме публикували в Play Store.\n\nАко откриете друго приложение което ползва икона и име като нашите докладвайте го като измамно и му дайте лоша оценка.\n\nНашите приложения могат да бъдат открити само тук <https://vancedapp.com>)."
    },
    {
      "title": "Защо Vanced не се показва на началния екран или в списъка с приложения?",
      "description": "Четете това защото не ползвате Vanced Manager или сте инсталирали Vanced от неофициален източник. Просто използвайте Vanced Manager!\n\nМожете да изтеглите безопасно Vanced Manager от:\n- Официалния сайт <https://vancedapp.com>\n- [GitHub хранилище](https://github.com/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Защо видеото не тръгва?",
      "description": "Опитайте да рестартирате приложението. Може и да бъде заради интернет връзката на устройството ви."
    },
    {
      "title": "Защо имам 480p ограничение на видеото?",
      "description": "Заради COVID-19 Google е наложила ограничение на потреблението на данни в някои държави. Това се случва на самия сървър и оказва влияние както на Vanced така и на оригиналното YouTube приложение.",
      "fields": [
        {
          "title": "Начини на преодоляване:",
          "content": "1. Свържете се с VPN от различен регион\n2. Използвайте [уеб версията](https://youtube.com)\n3. Ограничението от 480р е само за таблети и телефони можете да смените модела на вашето устройство в YouTube Vanced и да го преодолеете.\n\n#### Как да сменя модела на устройството?\n1. Отворете YouTube Vanced.\n2. Отидете в Настройки\n3. Докоснете Vanced Настройки\n4. Разрешете скритите настройки\n  -Докоснете няколко пъти менюто Относно и ще видите съобщение че допълнителните настройки са разрешени.\n5. Отидете до Смяна ма кодека\n6. Задайте модел на устройството \"SM-T865\" и марка \"Samsung\".\n7. Рестартирайте приложението.\n\nСлед като рестартирате приложението лимита на 480p трябва да го няма."
        }
      ]
    },
    {
      "title": "Как да скрия известията от microG?",
      "description": "За да скриете известието от microG,\n\n1. Можете да изключите оптимизацията на батерията за Vanced microG и да рестартирате устройството си.\n\n2. Ако методът по-горе не работи, изключете известията за microG, като задържите пръста си върху тях, изберете изключване и след това запаметяване.\n\n>Изключването на известията може да се направи по различни начини, в зависимост от потребителския интерфейс на Android. Ако не знаете как да ги изключите, потърсете в Google, за да научите как."
    },
    {
      "title": "Изглежда ли по-добре видео с резолюция 1440р на екран с резолюция 1080р?",
      "description": "Да но само ако съотношението му е 18:9 или 21:9 и т.н. Може да включите \"Стат. данни за умници\" в Настройки > Общи за да потвърдите това.\n\nЗа да разрешите по-високи резолюции отидете в Vanced Настройки > Настройки за видео и включете Максимална резолюция. След което рестартирайте приложението."
    }
  ]
}
