{
  "features": [
    {
      "title": "Vanced",
      "description": "YouTube Vanced има за цел да бъде подобрена версия на YouTube. Тя включва блокиране на реклами, черна тема и много други. Използвайте Vanced Manager за да инсталирате YouTube Vanced с лекота."
    },
    {
      "title": "Vanced Music",
      "description": "Vanced Music има същата цел като YouTube Vanced но е фокусирано върху YouTube Music. То има по-малко функции сравнено с Vanced но включва много от нещата като например блокиране на реклами и възпроизвеждане на заден план."
    },
    {
      "title": "Основни функции на YouTube Vanced",
      "description": "- Черна тема подходяща за OLED екрани.\n- Блокиране на всички реклами\n- Позволява ви да възпроизвеждате видео на заден план или в режим картина в картината (PiP) (само за Android 8 или по-нова)\n- Плъзгащите контроли ви позволяват да нагласяте силата на звука и яркостта на картината чрез жестове нагоре и надолу\n- Функция за автоматично повторение на видеото\n- Ново място на коментарите и мини плейър за таблет. Те могат да бъдат включени във версията за таблети и са много сходни със старите версии на приложението (доста са нестабилни все още)."
    },
    {
      "title": "Персонализиране",
      "description": "- Позволява ви да променяте кодека на видеото например да зададете Н264 за по-стари устройства или VP9 също така да зададете принудително HDR изпълнение или да изключите 60fps ако предпочитате изживяване като на кино. (Настройки по избор за дадено устройство на тези функции могат да бъдат открити на нашия Discord сървър или във форумите на XDA)\n- Можете да зададете резолюция на видеото по подразбиране толкова висока или ниска колкото пожелаете като пренебрегнете дори резолюцията на екрана. Това ще ви позволи да гледате кристална 4к картина на всяко устройство. Имате възможност също да променяте скоростта на възпроизвеждане на видеото между 0,25х и 2х (ако приемем че устройството ви е достатъчно бързо)\n- Дава ви възможност да включвате и изключвате домашните реклами както и повечето от тези в потребителския интерфейс. Също и рекламите на стоки във видеата, постовете от общността, компактните банери (като информацията за COVID-19 например). Можете също да премахнете коментарите напълно както и компактните филмчета, филмовия рафт и много други!"
    },
    {
      "title": "Блокиране на спонсорирани части във видеата (Sponsor Block)",
      "description": "- Дава ви възможност да пропускате спонсорираните части във видеото (където автора рекламира услуга или продукт по средата на видеото)\n- Поддържа се също пропускане на други категории като антракти и заключения както и самореклама.\n- Използва API който се намират тук. Можете да откриете повече информация как работят.\n- Позволява ви също да добавяте ваши части към API и да допринесете за разширяването на общността.\n- Имате пълен контрол върху това дали да бъде пропусната спонсорираната част автоматично или да бъде показан бутон за пропускане както и да не бъде пропусната въобще.\n- Спонсорираните части се осветяват в различен цвят според категорията им в лентата за възпроизвеждане."
    },
    {
      "title": "Платформи",
      "description": "Понастоящем приложението съществува само за Android, в момента не се планират да се поддържат други платформи"
    },
    {
      "title": "Разлики между версията с root достъп и тази без",
      "description": "- Версия с root достъп:\nТози вариант заменя оригиналното YouTube приложение. В резултат на това можете да отваряте връзки или да ги извиквате чрез асистента на Google директно в модифицираната Vanced версия на приложението.\n- Версия без root достъп:\n- Ако имате устройство на което е трудно да се осигури root достъп или просто не желаете да го правите то тази версия е за вас.\n- Тази версия може да бъде инсталирана и на устройство с root достъп защото името на пакета е различно от това на оригиналното YouTube приложение и те могат да съществуват съвместно. Имайте в предвид че ще се наложи да инсталирате придружаващото приложение (Vanced microG) за да можете да влезете във вашия YouTube/Google акаунт.\n- Също ще трябва да зададете Vanced като приложение по подразбиране за отваряне на връзки в YouTube.\n- Въпреки всичко тази версия е по-лесна за инсталиране и конфигуриране и ние ви препоръчваме нея освен ако по някаква причина не искате да замените оригиналното YouTube приложение."
    }
  ]
}
