{
  "data": [
    {
      "title": "Què és YouTube Vanced?",
      "description": "YouTube Vanced és una versió modificada de YouTube amb noves funcions afegides que milloren la teva experiència amb YouTube!\n\nAquestes funcions inclouen:\n- Reproducció en segon pla,\n- Pantalla en pantalla (PiP),\n- Tema negre (idoni per a pantalles OLED),\n- Bloqueja els anuncis (requereix activació),\n- Forçar la resolució màxima (permet reproduir video amb una resolució superior a la de la teva pantalla),\n- ... i molt més!\n\nPer a més informació visita <https://vancedapp.com>"
    },
    {
      "title": "On és el botó de descàrrega?",
      "description": "Of course, Google won't allow a modified version of its own app to be on their store so don't look for it on the Google Play Store, those are just fake apps.\n\nVanced apps can be downloaded and installed using Vanced Manager which can be found on our official website: <https://vancedapp.com> but you can also grab it from [GitHub repo](https://github.com/YTVanced/VancedManager/releases/latest)."
    },
    {
      "title": "YouTube Vanced s'actualitza automàticament?",
      "description": "No, it doesn't.\n\nVanced Manager will send you a notification when there is one.\n\nYou can also join our [Discord Server](https://discord.gg/Vanced) or follow [Telegram channel](https://t.me/Vanced) for the latest news and update notices as well."
    },
    {
      "title": "Pot Vanced descarregar vídeos?",
      "description": "Vanced doesn't include any video downloading feature and never will.\n\nMany videos are available to download for free in [selected countries](https://support.google.com/youtube/answer/6141269). For the rest of the world, please get YouTube Premium.\n\nAgain, Vanced WILL NEVER add a video downloader to the app or anything similar.\n\nThis has been the reason for the shutdown of many YouTube mods in the past as Google doesn't like people downloading copyrighted content from their platform so don't ask for it!!!"
    },
    {
      "title": "Why the swipe gestures doesn't work?",
      "description": "If you have comments shown at the bottom (old place) in Vanced settings > Layout settings, disable it and restart the app. If that doesn't work, force stop the app and clear its data."
    },
    {
      "title": "Subtítols no disponibles?",
      "description": "Aquest no és un problema relacionat amb Vanced o YouTube. No tots els vídeos disposen de subtítols."
    },
    {
      "title": "Accepteu donatius?",
      "description": "NO acceptem donatius!\n\nQualsevol tipus de donatius sota qualsevol circumstància i qualsevol lloc, enllaç o publicació són simplement falsos.\n\nPerò si vols donar suport als desenvolupadors de Vanced pots fer-ho descarregant Brave mitjançant [aquest enllaç](https://brave.com/kev231) i AdGuard mitjançant [aquest enllaç](https://adguard.com/en/welcome.html?aid=31141)."
    },
    {
      "title": "Com puc fer que el reproductor s'amagui automàticament?",
      "description": "Podeu configurar-ho a YouTube Vanced > Configuració > Accessibilitat. Si la configuració no es pot obrir o no funciona, dirigiu-vos a la configuració d'accessibilitat del vostre dispositiu i desactiveu l'amplificació de so, l'accessibilitat amb interruptors i els subtítols en temps real."
    },
    {
      "title": "Per què emprar APK separades?",
      "description": "Perquè:\n\n1. L'aplicació original ho fa, i per tant Vanced també.\n2. Només instal·la les llengües que especifiqueu per a reduir el consum d'emmagatzematge.\n3. Té l'única versió base de l'APK que el vostre dispositiu requereix.\n\nPer descomptat, el Gestor de Vanced o els desenvolupadors podrien convertir-ho a un sol fitxer APK, però són massa ganduls per a fer-ho. Us haureu de conformar amb el que tenim...\n\nNo us preocupeu, però, el Gestor de Vanced o els desenvolupadors han fet la feina més tediosa perquè per a vós només sigui prémer el botó 'Instal·lar'."
    },
    {
      "title": "Why the colour in the startup screen is different from the theme?",
      "description": "The startup screen background color is taken from the Android framework colour to make sure it changes according to the system theme. You can use [Substratum](https://play.google.com/store/apps/details?id=projekt.substratum) or [Swift Installer](https://play.google.com/store/apps/details?id=com.brit.swiftinstaller) or a similar app to change the colour."
    },
    {
      "title": "Should I re-download the installation files?",
      "description": "Files can be corrupted because of various reasons and can cause problems afterward. To avoid this, you can choose to download it again to ensure your installation goes smoothly."
    },
    {
      "title": "Why does the root version don't have Microphone permission?",
      "description": "It does if your Vanced is up-to-date."
    },
    {
      "title": "What is ExoPlayer v1?",
      "description": "It's an older version of the current media player used by YouTube. You might get better performance and stability when using it."
    },
    {
      "title": "How to enable hidden settings?",
      "description": "In Vanced settings, tap on the `About` section 6-7 times to enable it. This only enables the additional video codec settings."
    },
    {
      "title": "How to make YouTube Vanced as default app?",
      "description": "As the title says, a lot of users have been asking many times how they can make YouTube Vanced as default for opening YouTube links from other apps(like browsers, messaging apps and any other app).\n\nFor root, you don't need to worry about because it is already set by default since YouTube Vanced gets replaced with Stock YouTube.\n\nFor non-root, solutions has been divided between as OneUI, MIUI and the rest.  We can't provide solutions for every OS out there, and you may need to Google it by yourself.",
      "fields": [
        {
          "title": "OneUI users:",
          "content": "1. Tap and hold down on YouTube or YouTube Vanced app icon from your app drawer.\n2. Tap **App info**.\n3. Find \"**Set as default**\" and tap it\n4. Tap \"**Open supported links**\" and choose \"**Open in this app**\"\n\nIn older versions of OneUI, the name of the options in the 4th step might be slightly different. You may need to tap \"**Go to supported URLs**\" and choose \"**In this app**\" option.\nIn the very older version of OneUI 💩, you may need to go to **Settings** > **Apps** > *[tap three dots at the right corner]* > **Default apps** > **Set as default**. After apps loaded Find YouTube Vanced or YouTube and follow the 4th step..."
        },
        {
          "title": "MIUI users:",
          "content": "1. Open Settings\n2. Go to **Apps**,\n3. **Manage apps**,\n4. Then, tap the three dots at the right corner,\n5. **Default apps**,\n6. **Opening links**.\n7. Wait until all your apps gets listed…\n8. Find YouTube or YouTube Vanced and tap it.\n9. Tap \"**Open supported links**\" and choose \"**Open**\""
        },
        {
          "title": "AOSP & other custom UIs (OOS, ColorOS, EMUI, etc.):",
          "content": "1. Open **Settings**\n2. Go to **Apps**\n3. Tap **Default apps**\n4. Find **YouTube** or **YouTube Vanced**\n5. Tap \"**Go to Supported URLs**\" and choose \"**Open in this app**\" option\n\nIf you're still troubling with this, you may need to search some \"how to\" articles/videos on [Google](https://www.google.com/search?q=%22android%22+how+to+open+youtube+links+with+youtube) or you can install a 3rd party app from [Play Store](https://play.google.com/store/search?q=open%20with) to save you from this hassle…"
        }
      ]
    },
    {
      "title": "Why the root variant doesn't work with microG Core?",
      "description": "1. You need to have at least the [pico](https://github.com/opengapps/opengapps/wiki/Pico-Package) variant of GApps to run Vanced.\n\n2. You can’t run Vanced with microG Core without Google Play Services Framework which is available in all GApps packages and it's a required library.\n\n3. If you are worried about your privacy & don’t want to use GApps but still want to use watch YouTube without ads, then the [web version](https://youtube.com) is always available."
    },
    {
      "title": "Why casting doesn't work?",
      "description": "For users with latest v16.16.38 non-root variant, there's a bug in upstream microG. Until that resolves, please wait for updates or roll back to v15 versions. Root users will no issues with casting if they are using Google Play Services."
    },
    {
      "title": "What is APK Signing?",
      "description": "You are reading this because you are not using Vanced Manager or you may have installed Vanced from an unofficial source.\nJust use Vanced Manager!\n\nYou can safely download Vanced Manager from:\n- [Official site](https://vancedapp.com)\n- [GitHub repository](https://github.com/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Is YouTube Vanced on Play Store?",
      "description": "NO!\nAgain, DO NOT install or even try to search for any fake apps named \"YouTube Vanced\" or similar on the Play Store or any app stores to install Vanced.\n\nWe only have [Vanced Guide](https://play.google.com/store/apps/details?id=com.vanced.faq), and it's the only official app published on Play Store.\n\nIf you find any other app with our icon and name, report it as impersonation and give it a bad review.\n\nOur apps can only be found at [official site](https://vancedapp.com)."
    },
    {
      "title": "Why is Vanced not showing up in home screen or app drawer?",
      "description": "You are reading this because you are not using Vanced Manager or you may have installed Vanced from an unofficial source.\nJust use Vanced Manager!\n\nYou can safely download Vanced Manager from:\n- Official site <https://vancedapp.com>\n- [GitHub repository](https://github.com/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Why aren't videos playing?",
      "description": "Try restarting the app. It might also because of your internet connection or your device."
    },
    {
      "title": "Why am I having the 480p limit?",
      "description": "Due to the COVID-19, Google is restricting data usage of several countries. This happens on the server and affects both Vanced and stock YouTube users.",
      "fields": [
        {
          "title": "Workarounds:",
          "content": "1. Connect to a VPN of a different region.\n2. Use the [web version](https://youtube.com)\n3. Since the 480p restriction is only for phones and not tablets, you can change the device model in YouTube Vanced to overcome the restriction.\n\n#### How to change the device model?\n1. Open YouTube Vanced.\n2. Go to Settings\n3. Tap the `Vanced Settings`\n4. Enable hidden settings:\n  - Scroll down and tap on the `About` section till you get a message saying `Hidden settings enabled`.\n5. Go to `Codec override`\n6. Set manufacturer to `Samsung` and model to `SM-T865`.\n7. Restart the app.\n\nAfter restarting, the 480p limit should be gone."
        }
      ]
    },
    {
      "title": "How to hide the microG notification?",
      "description": "To hide microG the notification,\n\n1. You can disable battery optimization for Vanced microG and reboot your device.\n\n2. If the above method doesn't work, disable microG notifications by holding on to the notification, toggle it off and tap Save.\n\n> Disabling app notifications can be done in different ways depending on the Android user interface. If you don't know how to disable it, try using Google for learning how to disable it."
    },
    {
      "title": "Does 1440p look better on my 1080p screen?",
      "description": "Yes, but only if the video ratio is something like 18:9, 21:9, ... You can enable `Stats for nerds` in Settings > General to confirm it.\n\nTo enable higher resolutions, go to Vanced settings > Video settings and turn on `Max resolution` then restart the app."
    }
  ]
}
