{
  "data": [
    {
      "title": "Vanced",
      "description": "YouTube Vanced tracta de ser una versió millorada de YouTube. Inclou bloqueig d'anuncis, tema negre i molt més. Feu servir el Gestor Vanced (Vanced Manager) per instal·lar YouTube Vanced amb certa facilitat."
    },
    {
      "title": "YouTube Music Vanced",
      "description": "YouTube Music Vanced té el mateix propòsit que YouTube Vanced, però centrant-se aquesta aplicació en YouTube Music. Aquesta és menys rica en característiques que Vanced, però també inclou moltes de les esperades com bloqueig d'anuncis i reproducció en segon pla, tot dins de YouTube Music Vanced!"
    },
    {
      "title": "Característiques principals de YouTube Vanced",
      "description": "- Tema negre favorable per pantalles OLED i tema fosc _(color gris fosc)_ a més del tema blanc.\n- Bloqueja tots els anuncis\n- Permet reproduir vídeos en segon pla o en el mode de Finestra Flotant (PiP) (només per a Android 8+)\n- Els controls de lliscament permeten controlar la brillantor i el volum amb gestos ascendents i descendents (amb la longitud de lliscament configurable).\n- Funció de repetició automàtica que permet repetir els vídeos en bucle.\n- El nou disseny del minireproductor i la secció de comentaris a una tauleta es pot commutar per versions que són molt similars a la versió antiga (tot i que contenen alguns errors)."
    },
    {
      "title": "Personalització",
      "description": "- Permet anul·lar les opcions del còdec, com ara forçar l'H264 per dispositius antics o el VP9, i també permet forçar la reproducció en HDR o desactivar els 60fps si preferiu una experiència cinematogràfica. (Es poden trobar configuracions personalitzades d'aquestes característiques per a certs dispositius al nostre [Servidor de Discord](https://discord.gg/Vanced) o XDA)\n- Força la resolució de vídeo per defecte tan alta o baixa com vulgueu i fins i tot permet ignora la resolució de la pantalla i reproduïr vídeo en 4k a qualsevol dispositiu. També us permet canviar la velocitat de reproducció per defecte a qualsevol entre 0,25x i 2x (assumint que el vostre dispositiu és prou potent)\n- Permet amagar anuncis a l'inici, la majoria d'anuncis d'interfície, anuncis de merxandatge, publicacions de la Comunitat, venda de pel·lícules, informació de bàner compacta (com ara la informació sobre el COVID-19), eliminar els comentaris completament, anuncis de pel·lícula compactes, eliminació de col·leccions de pel·lícules i molt més!"
    },
    {
      "title": "SponsorBlock",
      "description": "- Inclou la possibilitat de saltar segments promocionals (on un/a [YouTuber](https://ca.wikipedia.org/wiki/Youtuber) anuncia un servei o producte dins el mateix vídeo).\n- També permet saltar altres categories, com introduccions, cloendes i promocions a sí mateix/a.\n- Fa servir l'API [trobada aquí](https://sponsor.ajay.app). Hi podeu trobar més informació sobre com funciona.\n- Permet també aportar els vostres propis segments a l'API per a contribuïr a la comunitat.\n- Control complet sobre si saltar automàticament una categoria de segments, mostrar un botó per saltar-ho o no fer-hi res.\n- Ressalta el segment amb un color específic segons la categoria a la barra de progrés del vídeo."
    },
    {
      "title": "Plataformes",
      "description": "Les aplicacions només estan disponibles per a dispositius Android i per ara no hi ha plans de donar suport a altres plataformes"
    },
    {
      "title": "Diferències entre Superusuari (\"Root\") i No Superusuari (\"No Root\")",
      "description": "#### Superusuari (\"Root\"):\nLa variant de Superusuari (\"Root\") de Vanced reemplaça l'aplicació oficial de YouTube. D'aquesta forma es poden obrir directament enllaços de YouTube o obrir el Vanced mitjançant l'Assistent de Google.\n\n### No Superusuari (\"No-Root\"):\n- Si tens un dispositiu on habilitar el mode de superusuari és difícil, o simplement no vols habilitar-lo al teu dispositiu habitual, cal fer servir la variant No Superusuari (\"No-Root\").\n- Ja que el nom del paquet de la variant No Superusuari (\"No-Root\") és diferent del de la versió original de YouTube aquestes dues poden coexistir. Cal tenir en compte, però, que és necessari instal·lar una apliació de suport (Vanced microG) per tal de poder iniciar sessió amb el vostre compte de YouTube/Google.\n- Addicionalment, es pot configurar de forma manual que Vanced obri per defecte els enllaços de YouTube.\n- Tanmateix, la variant No Superusuari (\"No-Root\") resulta força més senzilla d'instal·lar i fer servir, per la qual cosa recomanem que sigui aquesta la que feu servir a no ser que realment necessiteu reemplaçar l'aplicació per defecte de YouTube al vostre telèfon."
    }
  ]
}
