{
  "data": [
    {
      "title": "YouTube Vanced là gì?",
      "description": "Youtube Vaned là một bản mod của Youtube với các tính năng và cải tiến để giúp trải nghiệm Youtube của bạn tốt hơn!\n\nCách tính năng đó bao gồm:\n\n- Phát trong nền,\n- Hình trong hình (PiP),\n- Giao diện đen (cho màn OLED),\n- Chặn quảng cáo (yêu kích hoạt thủ công cho một số loại),\n- Ép độ phân giải tối đa (cho phát video với độ phân giải cao hơn màn hình của bạn),\n- ...và nhiều hơn nữa!\n\nThông tin thêm tại <https://vancedapp.com>"
    },
    {
      "title": "Nút Tải xuống ở đâu?",
      "description": "Đương nhiên Google sẽ không cho một bản mod của ứng dụng của chính họ xuất hiện trên cửa hàng của họ nên đừng tìm nó trên Cửa hàng Google Play, các ứng dụng đó đều là giả.\n\nCác ứng dụng Vanced có thể được tải về và cài đặt bằng Vanced Manager có thể được tìm thấy tại trang web chính thức của chúng tôi: <https://vancedapp.com> nhưng bạn cũng có thể tải nó từ [Github](https://github.com/YTVanced/VancedManager/releases/lates)."
    },
    {
      "title": "Youtube Vanced có tự động cập nhật không?",
      "description": "Không.\n\nVanced Manager sẽ thông báo cho bạn khi có phiên bản mới.\n\nBạn cũng có thể tham gia [Server Discord](https://discord.gg/Vanced) hoặc theo dõi [Kênh Telegram](https://t.me/Vanced) của chúng tôi cho tin tức mới nhất và thông báo cập nhật."
    },
    {
      "title": "Vanced có thể tải xuống video không?",
      "description": "Vanced không bao gồm các tính năng tải xuống video và sẽ không bao giờ.\n\nRất nhiều video có sẵn để tải xuống miễn phí ở [các nước](https://support.google.com/youtube/answer/6141269). Với các nước còn lại, hãy sử dụng Youtube Premium.\n\nNhắc lại, Vanced SẼ KHÔNG BAO GIỜ thêm bộ tải xuống video hoặc bất cứ thứ gì liên quan vào ứng dụng.\n\nĐây là lý do mà trong quá khứ rất nhiều bản Youtube mods bị sập bởi vì Google không thích người dùng tải xuống các nội dung bản quyền từ nền tảng của họ nên đừng đòi hỏi về nó!!!"
    },
    {
      "title": "Tại sao các cử chỉ vuốt không hoạt động?",
      "description": "Nếu các bình luận của bạn ở dưới cùng (vị trí cũ) thì ở cài đặt Vanced > Cài đặt giao diện, tắt nó và khởi động lại ứng dụng. Nếu không được, buộc dừng ứng dụng và xoá dữ liệu của nó."
    },
    {
      "title": "Không có phụ đề?",
      "description": "Đây không phải là một vấn đề. Không phải tất cả video đều có phụ đề."
    },
    {
      "title": "Bạn có nhận ủng hộ không?",
      "description": "Chúng tôi KHÔNG nhận ủng hộ!\n\nMọi loại quyên góp dưới bất kì hình hay trang web hoặc bài viết nào kêu gọi ủng hộ đều là giả.\n\nNhưng nếu bạn muốn ủng hộ đội ngũ phát triển Vanced, bạn có thể cài đặt Brave sử dụng [link này](https://brave.com/kev231) và AdGuard bằng [link này](https://adguard.com/en/welcome.html?aid=31141)."
    },
    {
      "title": "Cách để làm cho giao diện trình phát tự ẩn?",
      "description": "Bạn có thể chỉnh nó ở cài đặt Youtube Vanced > Trợ năng. Nếu cài đặt không thể mở hay không hoạt động, hãy dùng cài đặt trợ năng của thiết bị và vô hiệu hoá bộ khuếch đại âm thanh, thay đổi truy cập, phụ đề."
    },
    {
      "title": "Tại sao lại sử dụng APKs tách rời?",
      "description": "Bởi vì:\n\n 1. Ứng dụng gốc sử dụng nó nên Vanced cũng sử dụng nó.\n 2. Nó chỉ cài đặt ngôn ngữ bạn chỉ định để giảm tiêu thụ bộ nhớ.\n 3. Nó có phiên bản APK cốt lõi duy nhất mà thiết bị của bạn yêu cầu.\n\n Tất nhiên, Vanced Manager hoặc các nhà phát triển có thể chuyển đổi nó thành một tệp APK bình thường, nhưng chúng tôi rất lười làm điều đó. Bạn chỉ cần hòa hợp với những gì chúng tôi có...\n\n Tuy nhiên, đừng lo lắng, Vanced Manager sẽ thực hiện tất cả công việc khó khăn cho bạn vì vậy chỉ cần nhấn vào nút `Cài đặt`."
    },
    {
      "title": "Tại sao màu của màn hình khởi chạy lại khác với chủ đề giao diện?",
      "description": "Màu nền màn hình khởi động được lấy từ màu khung Android để đảm bảo nó thay đổi theo chủ đề hệ thống. Bạn có thể sử dụng [Substratum] (https://play.google.com/store/apps/details?id=projekt.substratum) hoặc [Swift Installer] (https://play.google.com/store/apps/details? id = com.brit.swiftinstaller) hoặc một ứng dụng tương tự để thay đổi màu sắc."
    },
    {
      "title": "Tôi có nên tải lại các tệp cài đặt?",
      "description": "Các tập tin có thể bị hỏng vì nhiều lý do khác nhau và có thể gây ra sự cố sau đó. Để tránh điều này, bạn có thể chọn tải lại nó để đảm bảo quá trình cài đặt diễn ra suôn sẻ."
    },
    {
      "title": "Tại sao phiên bản root có quyền Microphone?",
      "description": "Nó có nếu Vanced đã là bản mới nhất."
    },
    {
      "title": "Exoplayer v1 là gì?",
      "description": "Nó là một trình phát phiên bản cũ từng được sử dụng bởi Youtube. Bạn có thể sẽ có hiệu suất và độ ổn định tốt hơn khi sử dụng nó."
    },
    {
      "title": "Cách để kích hoạt các cài đặt ẩn?",
      "description": "Trong cài đặt Vanced, hãy nhấn vào phần `Giới thiệu` 6-7 lần để bật nó. Điều này chỉ bật cài đặt codec video bổ sung."
    },
    {
      "title": "Làm sao để đặt Youtube Vanced làm ứng dụng mặc định?",
      "description": "As the title says, a lot of users have been asking many times how they can make YouTube Vanced as default for opening YouTube links from other apps(like browsers, messaging apps and any other app).\n\nFor root, you don't need to worry about because it is already set by default since YouTube Vanced gets replaced with Stock YouTube.\n\nFor non-root, solutions has been divided between as OneUI, MIUI and the rest.  We can't provide solutions for every OS out there, and you may need to Google it by yourself.",
      "fields": [
        {
          "title": "Người dùng OneUI:",
          "content": "1. Tap and hold down on YouTube or YouTube Vanced app icon\n2. Tap on **App info**.\n3. Find \"**Set as default**\" and tap it\n4. Tap \"**Open supported links**\" and choose \"**Open in this app**\"\n\nIn older versions of OneUI, the name of the options in the 4th step might be slightly difference. You may need to tap \"**Go to supported URLs**\" and choose \"**In this app**\" option.\nIn the very older version of OneUI 💩, you may need to go to **Settings** > **Apps** > *[tap three dots at the right corner]* > **Default apps** > **Set as default**. After apps loaded Find YouTube Vanced or YouTube and follow the 4th step..."
        },
        {
          "title": "Người dùng MIUI:",
          "content": "1. Open Settings\n2. Go to **Apps**,\n3. **Manage apps**,\n4. Then, tap the three dots at the right corner,\n5. **Default apps**,\n6. **Opening links**.\n7. Wait until all your apps gets listed…\n8. Find YouTube or YouTube Vanced and tap it.\n9. Tap \"**Open supported links**\" and choose \"**Open**\""
        },
        {
          "title": "AOSP & other custom UIs (OOS, ColorOS, EMUI, etc.):",
          "content": "1. Open **Settings**\n2. Go to **Apps**\n3. Tap **Default apps**\n4. Find **YouTube** or **YouTube Vanced**\n5. Tap \"**Go to Supported URLs**\" and choose \"**Open in this app**\" option\n\nIf you're still troubling with this, you may need to search some \"how to\" articles/videos on [Google](https://www.google.com/search?q=%22android%22+how+to+open+youtube+links+with+youtube) or you can install a 3rd party app from [Play Store](https://play.google.com/store/search?q=open%20with) to save you from this hassle…"
        }
      ]
    },
    {
      "title": "Tại sao bản root lại không hoạt động với MicroG Core?",
      "description": "1. You need to have at least the [pico](https://github.com/opengapps/opengapps/wiki/Pico-Package) variant of GApps to run Vanced.\n\n2. You can’t run Vanced with microG Core without Google Play Services Framework which is available in all GApps packages and it's a required library.\n\n3. If you are worried about your privacy & don’t want to use GApps but still want to use watch YouTube without ads, then the [web version](https://youtube.com) is always available."
    },
    {
      "title": "Why casting doesn't work?",
      "description": "For users with latest v16.16.38 non-root variant, there's a bug in upstream microG. Until that resolves, please wait for updates or roll back to v15 versions. Root users will no issues with casting if they are using Google Play Services."
    },
    {
      "title": "What is APK Signing?",
      "description": "You are reading this because you are not using Vanced Manager or you may have installed Vanced from an unofficial source.\nJust use Vanced Manager!\n\nYou can safely download Vanced Manager from:\n- [Official site](https://vancedapp.com)\n- [GitHub repository](https://github.com/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Is YouTube Vanced on Play Store?",
      "description": "NO!\nAgain, DO NOT install or even try to search for any fake apps named \"YouTube Vanced\" or similar on the Play Store or any app stores to install Vanced.\n\nWe only have [Vanced Guide](https://play.google.com/store/apps/details?id=com.vanced.faq), and it's the only official app published on Play Store.\n\nIf you find any other app with our icon and name, report it as impersonation and give it a bad review.\n\nOur apps can only be found at [official site](https://vancedapp.com)."
    },
    {
      "title": "Why is Vanced not showing up in home screen or app drawer?",
      "description": "You are reading this because you are not using Vanced Manager or you may have installed Vanced from an unofficial source.\nJust use Vanced Manager!\n\nYou can safely download Vanced Manager from:\n- Official site <https://vancedapp.com>\n- [GitHub repository](https://github.com/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Why aren't videos playing?",
      "description": "Try restarting the app. It might also because of your internet connection or your device."
    },
    {
      "title": "Why am I having the 480p limit?",
      "description": "Due to the COVID-19, Google is restricting data usage of several countries. This happens on the server and affects both Vanced and stock YouTube users.",
      "fields": [
        {
          "title": "Workarounds:",
          "content": "1. Connect to a VPN of a different region.\n2. Use the [web version](https://youtube.com)\n3. Since the 480p restriction is only for phones and not tablets, you can change the device model in YouTube Vanced to overcome the restriction.\n\n#### How to change the device model?\n1. Open YouTube Vanced.\n2. Go to Settings\n3. Tap the `Vanced Settings`\n4. Enable hidden settings:\n  - Scroll down and tap on the `About` section till you get a message saying `Hidden settings enabled`.\n5. Go to `Codec override`\n6. Set manufacturer to `Samsung` and model to `SM-T865`.\n7. Restart the app.\n\nAfter restarting, the 480p limit should be gone."
        }
      ]
    },
    {
      "title": "Làm sao để ẩn thông báo của microG?",
      "description": "To hide microG the notification,\n\n1. You can disable battery optimization for Vanced microG and reboot your device.\n\n2. If the above method doesn't work, disable microG notifications by holding on to the notification, toggle it off and tap Save.\n\n>Disabling app notifications can be done in different ways depending on the Android user interface. If you don't know how to disable it, try using Google for learning how to disable it."
    },
    {
      "title": "Does 1440p look better on my 1080p screen?",
      "description": "Yes, but only if the video ratio is something like 18:9, 21:9, ... You can enable `Stats for nerds` in Settings > General to confirm it.\n\nTo enable higher resolutions, go to Vanced settings > Video settings and turn on `Max resolution` then restart the app."
    }
  ]
}
