{
  "features": [
    {
      "title": "Vanced",
      "description": "Youtube Vanced hướng tới trở thành một phiên bản tốt hơn của Youtube. Nó bao gồm chặn quảng cáo, chủ đề tối và nhiều hơn nữa. Sử dụng Vanced Manager để cài đặt Youtube Vanced với cái thành phần liên quan."
    },
    {
      "title": "Vanced Music",
      "description": "Vanced Music có cùng mục tiêu với Youtube Vanced tuy nhiên ứng dụng này tập trung /vào Youtube Music. Nó có ít tính năng hơn Vanced nhưng vẫn có các tính năng mà bạn mong muốn như chặn quảng cáo và phát lại trong nền, tất cả đều có trong Youtube Music!"
    },
    {
      "title": "Các tính năng chính của Youtube Vanced",
      "description": "- OLED friendly black theme and dark theme _(aka dark gray)_ besides white theme.\n- Blocks all ads\n- Allows you to play videos in the background or in the Picture in Picture (PiP) mode (only on Android 8+)\n- Swipe controls allow you to control brightness and volume with up-and-down gestures (with configurable padding).\n- Auto-repeat feature allowing you to loop videos on repeat.\n- New comment/tablet mini-player layout can be toggled to the tablet versions which are very similar to the old version (however, it's a bit buggy)."
    },
    {
      "title": "Tùy chỉnh",
      "description": "- Allows you to override Codec options such as forcing H264 for old devices or VP9, this also allows you to force HDR playback or turn off 60fps if you prefer a cinematic experience. (Custom device configs for these features can be found on our [Discord server](https://discord.gg/Vanced) or XDA)\n- Force the default video resolution as high or low as you want and even override your screen resolution for that sharp 4k playback on any device. It also allows you to change default playback speed to anywhere between 0.25x to 2x (assuming your device is powerful enough)\n- Allows you to toggle home ads, most UI ads, Merchandise ads, Community posts, Movie upselling, compact banner info (such as the COVID-19 info), remove comments entirely, compact movie, movie shelf removal and many more!"
    },
    {
      "title": "Sponsor Block",
      "description": "- Các tính năng để có thể bỏ qua phân đoạn được tài trợ (lúc mà youtuber quảng cáo một dịch vụ hoặc sản phẩm trong một video)\n- Nó cũng hỗ trợ bỏ qua các mục khác như intros, outros và tự giới thiệu.\n- API được sự dụng có thể được tìm thấy tại đây. Bạn có thể tìm thêm thông tin về cách nó hoạt động\n- Nó cũng cho phép tự thêm phân đoạn của bạn vào API và đóng góp để giúp phát triển cộng đồng\n- Hoàn toàn kiểm soát được xem có tự động bỏ qua danh mục của phân đoạn hay không hay hiện nút để bỏ qua hoặc đơn giản chỉ là không bỏ qua.\n- Làm nổi bật phân đoạn với màu cụ thể dựa trên danh mục của nó trên dòng thời gian phát lại."
    },
    {
      "title": "Các nền tảng",
      "description": "Ứng dụng này hiện chỉ có trên android và không có kế hoạch để hỗ trợ các nên tảng khác vào lúc này"
    },
    {
      "title": "Sự khác biệt giữa Root và không Root",
      "description": "#### Root:\nThe root variant of Vanced seamlessly replaces the official YouTube app. As a result, you can directly open YouTube links or call them using Google Assistant through the modded Vanced app.\n\n#### Non-Root:\n- If you have a device that is difficult to root, or you don’t want to root your daily device on first hand, you should opt for the non-root variant.\n- Since the package name of the non-root variant is different from the stock YouTube app, they can co-exist. Note that you need to install an additional companion app (Vanced microG) to be able to log in with your YouTube/Google account.\n- Moreover, you have to manually set Vanced as the default app for opening YouTube links.\n- However, the non-root variant is much simpler to install and use, so we recommend you stick with the non-root variant unless you really need to replace the stock YouTube app on your phone."
    }
  ]
}
