{
  "data": [
    {
      "title": "Што такое Youtube Vanced?",
      "description": "YouTube Vanced – мадыфіцыраваная версія YouTube з дадатковымі функцыямі і паляпшэннямі, каб зрабіць выкарыстоўванне YouTube крыху лепш!\n\nТакя функцыі ўключаюць:\n- Прайграванне ў фоне,\n- Карцінка ў карцінке (PiP),\n- Чорная тэма (OLED сумяшчальная),\n- Блакіроўка рэкламы (патрабуе ўключэння),\n- Змяненне максімальнай якасці відэа,\n- ...і многа іншага!\n\nКаб даведацца больш, перайдзіце на <https://vancedapp.com>"
    },
    {
      "title": "Дзе кнопка для спампоўвання?",
      "description": "Канешне, Google не размяшчае мадыфіцыраванныя версіі сваей праграмы у сваёй краме, таму не шукайце яго ў Google Play Store, гэта падробныя праграмы.\n\nПраграмы Vanced спампуюцца праз Vanced Manager, які можна знайсці на нашам афіцыйнам сайце: <https://vancedapp.com>, але вы таксама можаце спампаваць іх праз [рэпазіторый GitHub](https://github.com/YTVanced/VancedManager/releases/latest)."
    },
    {
      "title": "Абнаўляецца лі YouTube Vanced аўтаматычна?",
      "description": "Не, гэта не так.\n\nVanced Manager адправе вам апавяшчэнне, калі абнаўленне выйдзе.\n\nТаксама вы можаце далучыцца да [серверу Discord](https://discord.gg/Vanced) ці к [Telegram каналу](https://t.me/Vanced)каб атрымліваць апошнія навіны і паведамленні аб абнаўленнях."
    },
    {
      "title": "Ці можа Vanced спампоўуваць відэа?",
      "description": "Vanced не ўключае ў сябе функцыі загрузкі відэа і ніколі не будзе.\n\nШмат відэа можна спампаваць бясплатна ў [выбраных краінах](https://support.google.com/youtube/answer/6141269). Для астатняга свету атрымайце YouTube Premium.\n\nЗноў жа, Vanced НІКОЛІ не будзе дадаваць праграму для запампоўкі відэа ў дадатак або нешта падобнае.\n\nГэта было прычынай адключэння многіх модов YouTube у мінулым, бо Google не любіць людзей, якія спампоўваюць абаронены аўтарскім правам кантэнт са сваёй платформы, таму не пытайце пра гэта!!!"
    },
    {
      "title": "Чаму не працуюць жэсты свайпа?",
      "description": "Калі ў вас ёсць каментарыі, паказаныя ўнізе (старое месца) у наладах Vanced > Налады макета, адключыце іх і перазапусціце праграму. Калі гэта не спрацуе, прымусова спыніце праграму і ачысціце яе даныя."
    },
    {
      "title": "Чаму субцітры недаступныя?",
      "description": "Гэта не праблема Vance або YouTube. Не ўсе відэа маюць субцітры."
    },
    {
      "title": "Ці прымаеце вы ахвяраванні?",
      "description": "Мы НЕ прымаем ахвяраванні!\n\nЛюбыя ахвяраванні пры любых абставінах і любыя сайты, спасылкі або паведамленні, якія просяць ахвяраванні, проста падробка.\n\nАле калі вы хочаце падтрымаць распрацоўшчыкаў Vanced, вы можаце спампаваць Brave з дапамогай [гэтай спасылкі](https://brave.com/kev231) і AdGuard па [гэтай спасылцы](https://adguard.com/en/welcome.html?aid=31141)."
    },
    {
      "title": "Як зрабіць так, каб інтэрфейс плэера аўтаматычна хаваўся?",
      "description": "Вы можаце наладзіць яго ў YouTube Vanced > Налады > Спецыяльныя магчымасці. Калі налады не адкрываюцца або не працуюць, перайдзіце ў налады спецыяльных магчымасцей прылады і адключыце ўзмацняльнік гуку, пераключальны доступ і субцітры ў прамым эфіры."
    },
    {
      "title": "Чаму праграма разбіта на некалькі частак?",
      "description": "Таму што:\n\n1. Асноўная праграма выкарыстоўвае яго, так што Vanced таксама выкарыстоўвае яго.\n2. Ён усталёўвае толькі мовы, якія вы ўказалі, каб скараціць спажыванне памяці.\n3. Ён мае адзіную версію асноўнага APK, якая патрабуецца вашай прыладзе.\n\nВядома, Vanced Manager або распрацоўшчыкі могуць пераўтварыць яго ў звычайны адзін файл APK, але нам так лянота гэта рабіць. Вам проста трэба ладзіць з тым, што ў нас ёсць...\n\nАле не хвалюйцеся, Vanced Manager робіць усю цяжкую працу за вас, таму проста націсніце кнопку «Усталяваць»."
    },
    {
      "title": "Чаму колер на экране запуску не адпавядае тэме? ",
      "description": "Колер фону экрана запуску бярэцца з колеру платформы Android, каб пераканацца, што ён змяняецца ў адпаведнасці з тэмай сістэмы. Вы можаце выкарыстоўваць [Substratum](https://play.google.com/store/apps/details?id=projekt.substratum) або [Swift Installer](https://play.google.com/store/apps/details?id=com.brit.swiftinstaller) або падобнае прыкладанне для змены колеру."
    },
    {
      "title": "Ці павінен я спампоўваць файлы для усталявання зноў?",
      "description": "Файлы могуць быць пашкоджаны з-за розных прычын і могуць выклікаць праблемы ў далейшым. Каб пазбегнуць гэтага, вы можаце спамппаваць яго яшчэ раз, каб гарантаваць, што ўсталёўка праходзіць гладка."
    },
    {
      "title": "Чаму root версія не мае дазволаў на мікрафон? ",
      "description": "Усё ёсць, калі ваш Vanced актуальны."
    },
    {
      "title": "Што такое ExoPlayer v1?",
      "description": "Гэта больш старая версія бягучага медыяплэера, які выкарыстоўваецца YouTube. Вы можаце атрымаць лепшую прадукцыйнасць і стабільнасць пры яго выкарыстанні."
    },
    {
      "title": "Як уключыць налады для распрачоўшчыкаў?",
      "description": "У наладах Vanced націсніце на раздзел «Аб» 6-7 разоў, каб уключыць яго. Гэта ўключае толькі дадатковыя налады відэакодэка."
    },
    {
      "title": "Як зрабіць YouTube Vanced праграмай па змаўчанні?",
      "description": "Як сказана ў назве, многія карыстальнікі шмат разоў пыталіся, як зрабіць YouTube Vanced па змаўчанні для адкрыцця спасылак на YouTube з іншых прыкладанняў (напрыклад, браўзераў, праграм абмену паведамленнямі і любога іншага прыкладання).\n\nДля root вам не трэба турбавацца, таму што ён ужо ўсталяваны па змаўчанні, бо афіцыйны YouTube замяняецца на YouTube vanced.\n\nДля non-root рашэнні былі падзеленыя на OneUI, MIUI і астатнія. Мы не можам прапанаваць рашэнні для кожнай АС, і вам, магчыма, спатрэбіцца ў шукаць самастойна.",
      "fields": [
        {
          "title": "Карыстальнікі OneUI:",
          "content": "1. Націсніце і ўтрымлівайце значок YouTube або YouTube Vanced з скрыні праграмы.\n2. Націсніце **Інфармацыя аб праграме**.\n3. Знайдзіце «**Усталяваць па змаўчанні**» і націсніце на яго\n4. Націсніце «**Адкрыць спасылкі, якія падтрымліваюцца**» і абярыце «**Адкрыць у гэтай праграме**»\n\nУ старых версіях OneUI назвы параметраў на 4-м этапе могуць крыху адрознівацца. Магчыма, вам спатрэбіцца націснуць «**Перайсці да падтрымоўваных URL**» і выбраць варыянт «**У гэтай праграме**».\nУ вельмі старой версіі OneUI 💩 вам, магчыма, спатрэбіцца перайсці ў **Настройкі** > **Прыкладанні** > *[націсніце тры кропкі ў правым куце]* > **Праграмы па змаўчанні** > **Усталяваць як па змаўчанні**. Пасля загрузкі праграм знайдзіце YouTube Vanced або YouTube і выканайце 4-ы крок..."
        },
        {
          "title": "Карыстальнікі MIUI:",
          "content": "1. Адкрыйце Налады\n2. Перайдзіце ў **Праграмы**,\n3. **Кіраванне праграмамі**,\n4. Затым націсніце на тры кропкі ў правым куце,\n5. **Праграмы па змаўчанні**,\n6. **Адкрыццё спасылак**.\n7. Пачакайце, пакуль усе вашы праграмы не з'явяцца ў спісе…\n8. Знайдзіце YouTube або YouTube Vanced і націсніце на іх.\n9. Націсніце «**Адкрыць спасылкі, якія падтрымліваюцца**» і абярыце «**Адкрыць**»"
        },
        {
          "title": "AOSP і іншыя карыстальніцкія інтэрфэйсы (OOS, ColorOS, EMUI, і г.д.):",
          "content": "1. Адкрыйце **Налады**\n2. Перайдзіце ў **Праграмы**\n3. Націсніце **Праграмы па змаўчанні**\n4. Знайдзіце **YouTube** або **YouTube Vanced**\n5. Націсніце «**Перайсці да падтрымоўваных URL**» і абярыце опцыю «**Адкрыць у гэтай праграме**».\n\nКалі вас усё яшчэ турбуе гэта, вам можа спатрэбіцца пашукаць некаторыя артыкулы/відэа \"як зрабіць\" на [Google] (https://www.google.com/search?q=%22android%22+how+to+ open+youtube+links+with+youtube), або вы можаце ўсталяваць праграму трэцяй распрацоўшчыка з [Play Store](https://play.google.com/store/search?q=open%20with), каб пазбавіць вас ад гэтых клопатаў…"
        }
      ]
    },
    {
      "title": "Чаму root варыянт не працуе з ядром microG? ",
      "description": "1. Каб запусціць Vanced, вам трэба мець прынамсі варыянт [pico](https://github.com/opengapps/opengapps/wiki/Pico-Package) GApps.\n\n2. Вы не можаце запусціць Vance з microG Core без Google Play Services Framework, які даступны ва ўсіх пакетах GApps і з'яўляецца абавязковай бібліятэкай.\n\n3. Калі вы турбуецеся аб сваёй канфідэнцыяльнасці і не хочаце выкарыстоўваць GApps, але ўсё яшчэ хочаце глядзець YouTube без рэкламы, то [вэб-версія](https://youtube.com) заўсёды даступная."
    },
    {
      "title": "Чаму не працуе трансляцыя?",
      "description": "Для карыстальнікаў з версіяй 16.16.38 і ўсімі вышэйпералічанымі non-root варыянтамі і root варыянтамі, якія выкарыстоўваюць ПЗУ на аснове microG, існуе памылка ў вышэйстаячым microG. Пакуль гэта не вырашыцца, пачакайце абнаўленняў або адкаціцеся да версій v15. Калі вы карыстаецеся сэрвісамі Google Play з каранёвым варыянтам, у вас не ўзнікне праблем з трансляцыяй."
    },
    {
      "title": "Што такое подпіс apk?",
      "description": "Вы чытаеце гэта, таму што вы не выкарыстоўваеце Vanced Manager або вы маглі ўсталяваць Vance з неафіцыйнай крыніцы.\nПроста выкарыстоўвайце Vanced Manager!\n\nВы можаце бяспечна спампаваць Vanced Manager з:\n- [Афіцыйны сайт](https://vancedapp.com)\n- [Рэпазіторый GitHub](https://github.com/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Ёсць лі YouTube Vanced у Play Store?",
      "description": "НЕ!\nЗноў, НЕ ЎСТАЛЁЎВАЙ і нават не шукайце любыя падробныя праграмы з назвай \"YouTube Vanced\" ці падобным у Play Store ці ў іншых крамах праграм для ўсталёўкі Vanced.\n\nУ Play Store ёсць толькі [Vanced Guide](https://play.google.com/store/apps/details?id=com.vanced.faq) ігэта адзіная афіцыйная праграма.\n\nКалі вы сустрэнеце любую праграму с нашай іконкай і назвай, паведаміце пра гэта як выданне іншага і дадайце дрэнны водгук.\n\nНашы прграмы могут быць знойдзены толькі на [афіцыйнам сайце](https://vancedapp.com)."
    },
    {
      "title": "Чаму Vanced не відаць на галоўным экране ці ў меню прыкладанняў?",
      "description": "Вы чытаеце гэта, таму што вы не выкарыстоўваеце Vanced Manager або вы маглі ўсталяваць Vance з неафіцыйнай крыніцы.\nПроста выкарыстоўвайце Vanced Manager!\n\nВы можаце бяспечна спампаваць Vanced Manager з:\n- Афіцыйны сайт <https://vancedapp.com>\n- [Рэпазіторый GitHub](https://github.com/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Чаму не прайграваюцца відэа?",
      "description": "Паспрабуйце перазапусціць праграму. Гэта таксама можа быць з-за вашага падключэння да Інтэрнэту або прылады."
    },
    {
      "title": "Чаму я маю абмежаванне ў 480p?",
      "description": "З-за COVID-19 Google абмяжоўвае выкарыстанне даных у некалькіх краінах. Гэта адбываецца на серверы і закранае як карыстальнікаў Vanced, так і карыстальнікаў YouTube.",
      "fields": [
        {
          "title": "Абходныя шляхі:",
          "content": "1. Падключыцеся да VPN іншага рэгіёну.\n2. Выкарыстоўвайце [веб-версію](https://youtube.com)\n3. Паколькі абмежаванне 480p дзейнічае толькі для тэлефонаў, а не планшэтаў, вы можаце змяніць мадэль прылады ў YouTube Vanced, каб пераадолець гэта абмежаванне.\n\n#### Як змяніць мадэль прылады?\n1. Адкрыйце YouTube Vanced.\n2. Перайдзіце ў Налады\n3. Націсніце `Vanced Settings`\n4. Уключыце схаваныя налады:\n   - Пракруціце ўніз і націсніце на раздзел «Падрабязней», пакуль не з'явіцца паведамленне «Схаваныя налады ўключаны».\n5. Перайдзіце ў раздзел «Перавызначэнне кодэка».\n6. Усталюйце вытворцу на `Samsung`, а мадэль на `SM-T865`.\n7. Перазапусціце прыкладанне.\n\nПасля перазапуску абмежаванне 480p павінна знікнуць."
        }
      ]
    },
    {
      "title": "Як схаваць апавяшчэнне ад microG?",
      "description": "Каб схаваць апавяшчэнне microG,\n\n1. Вы можаце адключыць аптымізацыю батарэі для Vanced microG і перазагрузіць прыладу.\n\n2. Калі вышэйзгаданы метад не працуе, адключыце апавяшчэнні microG, утрымліваючы апавяшчэнне, выключыце яго і націсніце Захаваць.\n\n> Адключэнне апавяшчэнняў прыкладанняў можна зрабіць рознымі спосабамі ў залежнасці ад карыстальніцкага інтэрфейсу Android. Калі вы не ведаеце, як яго адключыць, паспрабуйце выкарыстоўваць Google, каб даведацца, як адключыць яго."
    },
    {
      "title": "Ці выглядае 1440p лепш на маім экране 1080p?",
      "description": "Так, але толькі ў тым выпадку, калі прапорцыя відэа складае прыкладна 18:9, 21:9, ... Вы можаце ўключыць «Статыстыку для батанікаў» у Наладах > Агульныя, каб пацвердзіць гэта.\n\nКаб уключыць больш высокія дазволы, перайдзіце ў налады Vanced > Налады відэа і ўключыце «Макс. дазвол», а затым перазапусціце праграму."
    }
  ]
}
