{
  "data": [
    {
      "title": "Vanced",
      "description": "YouTube Vanced імкнецца стаць лепшай версіяй YouTube. Яна ўключае ў сябе блакіроўку рэкламы, чорную тэму і многае іншае. Выкарыстоўвайце Vance Manager, каб усталяваць YouTube Vanced з адноснай лёгкасцю."
    },
    {
      "title": "YouTube Music Vanced",
      "description": "YouTube Music Vanced мае тую ж мэту, што і YouTube Vanced, але гэта дадатак сканцэнтравана на YouTube Music. Гэта адносна менш шматфункцыянальнае ў параўнанні з Vanced, але ўсё яшчэ змяшчае шмат рэчаў, якія вы чакаеце, напрыклад блакіроўку рэкламы і фонавае прайграванне, усё гэта ўнутры YouTube Music Vanced!"
    },
    {
      "title": "Асноўныя функцыі YouTube Vanced",
      "description": "- Чорная тэма для OLED і цёмная тэма _ (ён жа цёмна-шэрая)_ акрамя белай тэмы.\n- Блакіруе ўсю рэкламу\n- Дазваляе прайграваць відэа ў фонавым рэжыме або ў рэжыме карцінка ў карцінке (PiP) (толькі на Android 8+)\n- Элементы кіравання свайпам дазваляюць кантраляваць яркасць і гучнасць з дапамогай жэстаў уверх і ўніз (з наладжвальным запаўненнем).\n- Функцыя аўтаматычнага паўтарэння, якая дазваляе зацыкліваць відэа пры паўторы.\n- Новы макет міні-плэера для каментарыяў/планшэта можна пераключыць на версіі планшэта, якія вельмі падобныя на старую версію (аднак яна крыху памылковая)."
    },
    {
      "title": "Кастамізацыя",
      "description": "- Дазваляе перавызначаць параметры кодэка, такія як прымусовы рэжым H264 для старых прылад або VP9, гэта таксама дазваляе прымусова прайграваць HDR або адключыць 60 кадраў у секунду, калі вы аддаеце перавагу кінематограф. (Карыстальніцкія канфігурацыі прылады для гэтых функцый можна знайсці на нашым [серверы Discord] (https://discord.gg/Vanced) або XDA)\n- Зрабіце дазвол відэа па змаўчанні настолькі высокім або нізкім, як вы хочаце, і нават перавызначайце дазвол экрана для гэтага рэзкага прайгравання 4K на любой прыладзе. Гэта таксама дазваляе змяніць хуткасць прайгравання па змаўчанні ў межах ад 0,25x да 2x (пры ўмове, што ваша прылада дастаткова магутная)\n- Дазваляе пераключаць хатнюю рэкламу, большасць рэкламы з карыстальніцкім інтэрфейсам, рэкламу тавараў, паведамленні ў супольнасці, продаж фільмаў, інфармацыю аб кампактных банэрах (напрыклад, інфармацыю пра COVID-19), выдаляць каментарыі цалкам, кампактны фільм, выдаленне паліцы з фільмамі і многае іншае!"
    },
    {
      "title": "SponsorBlock",
      "description": "- Мае магчымасць прапускаць сегменты спонсараў (як [YouTuber](https://en.wikipedia.org/wiki/YouTuber) рэкламуе паслугу або прадукт у сярэдзіне відэа)\n- Ён таксама падтрымлівае пропуск іншых катэгорый, такіх як інтра, аўто і самарэклама.\n- Выкарыстоўвае API [знаходзіцца тут] (https://sponsor.ajay.app). Вы можаце знайсці больш інфармацыі аб тым, як гэта працуе\n- Гэта таксама дазваляе адпраўляць свае ўласныя сегменты ў API і спрыяць больш шырокай супольнасці\n- Поўны кантроль над тым, ці трэба аўтаматычна прапускаць катэгорыю сегмента або паказваць кнопку для прапуску, ці проста не прапускаць яе наогул.\n- Вылучае сегмент пэўным колерам у залежнасці ад яго катэгорыі на часовай шкале прайгравання."
    },
    {
      "title": "Платформы",
      "description": "Праграмы даступныя толькі для прылад Android, і на дадзены момант не плануецца падтрымліваць якія-небудзь іншыя платформы"
    },
    {
      "title": "Розніца паміж Root і Non-Root",
      "description": "#### Root:\nRoot варыянт Vanced лёгка замяняе афіцыйную праграму YouTube. У выніку вы можаце непасрэдна адкрываць спасылкі на YouTube або выклікаць іх з дапамогай Google Assistant праз мадыфіцыраваную праграму Vanced.\n\n####:\n- Калі ў вас ёсць прылада, з якой цяжка атрымаць root-права, або вы не жадаеце каціраваць сваю штодзённую прыладу з першых рук, вам варта выбраць варыянт non-root.\n- Паколькі назва пакета non-root варыянту адрозніваецца ад стандартнага прыкладання YouTube, яны могуць суіснаваць. Звярніце ўвагу, што вам трэба ўсталяваць дадатковую спадарожную праграму (Vanced microG), каб мець магчымасць увайсці ў свой уліковы запіс YouTube/Google.\n- Больш за тое, вам трэба ўручную ўсталяваць Vanced як прыкладанне па змаўчанні для адкрыцця спасылак на YouTube.\n- Аднак non-root варыянт значна прасцей усталёўваць і выкарыстоўваць, таму мы рэкамендуем вам прытрымлівацца некаранёвага варыянту, калі вам сапраўды не трэба замяніць стандартнае прыкладанне YouTube на вашым тэлефоне."
    }
  ]
}
