{
  "features": [
    {
      "title": "Vanced",
      "description": "A YouTube Vanced célja, hogy jobb legyen, mint a YouTube. Tartalmaz reklám blokkolást, fekete témát és még sok minden mást. Használja a Vanced Manager-t a Vanced egyszerű telepítéséhez."
    },
    {
      "title": "YouTube Music Vanced",
      "description": "A YouTube Music Vanced-nek ugyanaz a célja, mint a YouTube Vanced-nek, de az alkalmazás a YouTube Music-ra fókuszál.\nKevésbé funkciógazdag a Vanced-hez viszonyítva, de sok funkciót megtapasztalhat, mint a reklám blokkolás vagy a háttérben történő lejátszás, mind a YouTube Music Vanced-ben!"
    },
    {
      "title": "YouTube Vanced fő funkciók",
      "description": "- OLED barát fekete és sötét téma _(mint sötétszürke)_ a fehér témán kívül.\n- Blokkol minden reklámot\n- Engedélyezheti a videók háttérben történő lejátszását vagy a Kép a képben (PiP) módot (Android 8 vagy felette)\n- A csúsztatás vezérlők lehetővé teszik a fényerő és a hangerő állítását fel és le gesztussal (konfigurálható terület beállításokkal).\n- az Automatikus ismétlés funkcióval folyamatos lejátszásra állíthat egy videót.\n- Új komment/táblagép mini lejátszó mód bekapcsolható a táblagépekre készült verziókban, ami nagyon hasonló a régi verzióhoz (bár még hibák lehetnek benne)."
    },
    {
      "title": "Testreszabás",
      "description": "- Lehetővé teszi a Kodek opciók felülírását, mint a H264 kényszerítése régebbi eszközökre vagy VP9, illetve kényszerítheti a HDR lejátszást vagy kikapcsolhatja a 60fps-t, ha mozihoz hasonló élményre vágyik. (Egyedi eszköz konfigurációk találhatóak ezekhez a funkciókhoz a [Discord szerverünkön](https://discord.gg/Vanced) vagy XDA-n)\n- Kényszeríti a videó felbontását a beállított értéktől függően és képes felülírni a kijelző felbontását az éles 4K lejátszáshoz bármilyen eszközön. Szintén lehetővé teszi a lejátszási sebesség megváltoztatását bármilyen 0,25x és 2x közötti értékre (feltéve, hogy az eszköze elég erős hozzá)\n- Lehetővé teszi a kezdőoldal reklámjainak, a Felhasználói Felület reklámjainak, a Kereskedelmi reklámok, a Közösségi posztok, Moziajánlók, kompakt banner infó (mint például a COVID-19 infó) állítását, a kommentek teljes eltávolítását, a kompakt film módot, a film polc eltávolítását és még sok mindent!"
    },
    {
      "title": "SponsorBlock",
      "description": "- Lehetségessé teszi a szponzor blokkok átugrását (ahol egy [YouTuber](https://en.wikipedia.org/wiki/YouTuber) egy szolgáltatást vagy terméket reklámoz a videó közben)\n- Továbbá támogatja egyéb kategóriák, például intro, outro és ön-promóció átugrását.\n-  A használt API [megtalálható itt](https://sponsor.ajay.app). Többet is megtudhat róla, hogyan működik\n- Lehetővé teszi saját szponzor blokkok jelentését az API-ba és egy szélesebb közösséggel történő együttműködést\n- Teljes vezérlés, hogy automatikusan átléptessen egy részt vagy  csak jelenítsen meg egy gombot az átugráshoz, vagy egyszerűen ne ugorja át azokat.\n- Kiemeli a részt a speciális, szín alapú kategóriák alapján a lejátszási idősávban."
    },
    {
      "title": "Platformok",
      "description": "Alkalmazásaink csak Android rendszerű eszközökre érhetőek el és jelenleg nem tervezzük más egyéb platformok támogatását"
    },
    {
      "title": "Különbség a Root és a Non-root verziók között",
      "description": "#### Root:\nA Vanced root verziója egyszerűen felváltja a gyári YouTube alkalmazást. Ennek eredményeként közvetlenül megnyithatod a YouTube linkeket, vagy meghívhatod őket a Google Asszisztenssel a módosított Vanced alkalmazáson keresztül.\n\n#### Non-Root:\n- Ha az eszközödet nehéz rootolni, vagy nem szeretnéd a mindennapos használatban lévő eszközödet rootolni, akkor a non-root verziót kell használnod.\n- Mivel a non-root verzió csomagneve eltér a hivatalos YouTube alkalmazásétól, ezért a két alkalmazás lehet egyidejűleg telepítve. Ne felejtsd el, hogy telepíteni kell egy kiegészítő alkalmazást (Vanced microG), hogy be tudj jelentkezni a YouTube/Google fiókoddal.\n- Sőt, kézzel kell beállítanod a Vanced-et alapértelmezett alkalmazásként a YouTube linkek megnyitásához.\n- A non-root verziót sokkal egyszerűbb telepíteni és használni, tehát mi azt ajánljuk, hogy használja a non-root verziót, hacsak nem akarja ténylegesen lecserélni a telefonján lévő gyári YouTube alkalmazást."
    }
  ]
}
