{
	"troubleshooting": [
		{
			"title": "Grundläggande felsökning",
			"description": "A) Rensa data och cache för \n\n(I) Vanced/Vanced Music och microG för icke-rot-variant\n(II) Vanced/Vanced Music och Google Play-tjänster för rotvariant\n\nB) Installera om YouTube Vanced\n\nVIKTIGT: Starta om mellan processer"
		},
		{
			"title": "Problem med inloggning",
			"description": "Nedan är några av de vanligaste felen med sina skärmdumpar så att du kan få veta vilken lösning du måste följa.",
			"fields": [
				{
					"title": "Om du får ett fel som säger \"kontrollera din internetanslutning\"",
					"content": "Följ den här videoguiden: https://youtu.be/S5sTXRTrD5Y. Prova att rensa microG:s appdata också."
				},
				{
					"title": "Om du står inför frågor som rör inloggningsordning, \"Du är offline, utforska nedladdningar\"",
					"content": "1. Tydlig DATA av både Vanced microG och Google Play-tjänster\n2. UNINSTALL både \"Vanced microG\" och Vanced.\n\n3. Starta om om om du vill.\n\n4. Installera om båda APK:erna [microG och Vanced) men se till att du installerar microG innan du installerar Vanced. Installera via Vanced Manager eller sai med filer som tillhandahålls i #installationsanteckning i grupp\n\n5. Nu loggar in.\n\nOBS: Om du fortfarande har problem med att Vanced ger anslutningsfel (även efter installation av microG först), ta emot aviseringar, etc, se till att du inaktiverar batterioptimering för Vanced och microG-appen. \n\nInstruktioner för att göra det varierar på din enhets tillverkare. Du kan följa guider som https://dontkillmyapp.com eller söka upp."
				},
				{
					"title": "Om du loggar ut från ditt Google-konto",
					"content": "Det händer eftersom din enhet OS tunga batterioptimering döda microg tjänster / aktiviteter som är ansvariga för inloggningar.\n\nFör att åtgärda detta, inaktivera batterioptimering för microG med https://dontkillmyapp.com ELLER söka upp det"
				},
				{
					"title": "För användare som använder Gsuite konto på Non-Root version av vanced och inför anslutningsproblem ofta (fel som \"You are offline\", \"Kontrollera ditt internet\", etc)",
					"content": "•Log into your Gsuite account [admin console](https://admin.google.com/)\n\n• Search for device management\n\n• Go to setup and disable \"Mobile Management\"\n\n• That's it and it will get fixed."
				},
				{
					"title": "Huawei workaround 1",
					"content": "For those who updated microG to most recent version but now are facing login issues\n\n1. Uninstall current installed Vanced microG.\n\n2. Download \"Vanced microG 0.2.12.203315 version\" from Mediafire v15 link and install it. [Link for Mediafire v15 here](https://del.dog/Mediafireonlyv15)\n\n3. You should be able to login now."
				},
				{
					"title": "Huawei workaround 2",
					"content": "1. Avinstallera både vanced och microg om du redan installerat. Installera sedan endast microg(senast tillgänglig)\n\n2. Öppna sedan microg app inställningar\n\n3. Stäng av både \"Google Cloud Messaging\" och \"Google device registration\".\n\n4. Lägg till ditt konto via microg själv.\n\n5. Installera sedan Vanced."
				},
				{
					"title": "Huawei workaround 3",
					"content": "1. First, install the old Vanced microG version{particularly microg_YouTube_Vanced_0.2.4-105_16052019_2.apk using [this link](https://www.mediafire.com/file/4mw2q6ajq85g2io/microg_YouTube_Vanced_0.2.4-105_16052019_2.apk/file)}. Make sure to uninstall the current version to install the above version and save the latest APK file as you will be needing it later.\n\n2. Then open YouTube Vanced and try logging in again until it shows the error message. Try to reload it by tapping the error message. \n\n3. Now install the newer microG version again and restart vanced. It should be logged in again and everything should work again.\n\nNOTE: Now make sure u disable battery optimization for both microG and vanced using https://dontkillmyapp.com otherwise your device software might kill microG and you might have to repeat all above steps again to fix login."
				}
			]
		},
		{
			"title": "Vanced Manager",
			"fields": [
				{
					"title": "För Vanced Manager fastnat på logo/krasch problem",
					"content": "Rensa appdata från manager > Stäng av internet > Öppna hanterarappen > Slå på internet."
				},
				{
					"title": "INSTALL_FAILED_INVALID_APK: Inga paket iscensatta",
					"content": "Installera lager yt från play store sedan uppdatera vanced över det med hjälp av vanced manager."
				},
				{
					"title": "Om senaste vanced manager fastnar på \"Var tålmodig\" skärm, gör detta",
					"content": "Installera lager yt från play store sedan uppdatera vanced över det med hjälp av vanced manager."
				},
				{
					"title": "Om du stöter på \"Fel vid nedladdning av Microg/Vanced\" eller om installationen fastnade vid installation av mikrog/vanserad app",
					"content": "Rensa data för hanteraren och fortsätt sedan installera och SVAR INTE TILL ANDRA APPAR UNTIL DET KOMPLETAR DEN PROCESS."
				}
			]
		},
		{
			"title": "Aviseringar",
			"description": "För aviseringsrättelse, en vit bakgrund eller Vanced som inte visas under \"Google Cloud Messaging\", se nedan",
			"fields": [
				{
					"title": "För icke-rot",
					"content": "1. Installera Vanced microG först och sedan YouTube Vanced.\n\n2. Logga in med ditt Google-konto\n\n3. \na) Inaktivera batterioptimering för microg(guiden dontkillmyapp. Om föreslås).\n\nb)**Öppna \"Vanced microG\" ytterligare inställningar och fortsätt sedan med denna guide:\n\ni) https://youtu.be/Q-5YFmFWVok"
				},
				{
					"title": "Om Vanced inte dyker upp under GCM eller det dyker upp som oregistrerad",
					"content": "Prova EITHER av följande:\n\n1. Ta bort ditt Google-konto från kontoinställningar. Det konto som används av vanced har gamla blå bakgrundsfärg med liten g logotyp.\n\n2. Rensa data från microG och logga in. \n\nELLER\n\nOm ovanstående workaround inte fungerar, installera om vanced."
				},
				{
					"title": "Ftp Root:<span class=\"help\">The directory your opencart installation is stored in normally 'public_html/'.</span>",
					"content": "Se till att \"Schemalagd Digest\" är avstängd i youtube-inställningarna och dina aviseringsljud är korrekta och inställda.\n\nDu kan prova att använda appen \"notifieringshanterare\" som håller reda på all din avisering på ett ställe så om du avfärdar dina aviseringar, du kan komma åt samma igen från den appen."
				},
				{
					"title": "If you face errors like \"Operation failed because apk files are invalid/corrupt\"",
					"content": "• Head to manager settings and clear downloaded files\\n\\n• Then clear manager app data then continue installing vanced."
				}
			]
		},
		{
			"title": "Tvinga avslutande ärenden",
			"description": "Om Vanced app kraschar/tvingar stängning vid uppstart",
			"fields": [
				{
					"title": "Nonroot",
					"content": "1) Om icke-root-appen är tvingande stängning innan du installerar MicroG, avinstallera både Vanced app och MicroG. Installera sedan MicroG först, sedan Vanced. Problemet bör åtgärdas.\n\n2) Om den icke-rotade appen är tvingande stängning utan att installera mikrog, installera mikrog. [Om du inte vill logga in, logga inte in och bara installera microg apk som vansett har ett beroende av microg för att ansluta till Googles tjänster]"
				},
				{
					"title": "Root",
					"content": "1) Om din rotversion av Vanced är tvingande att stänga när appen öppnas, avinstallera lageruppdateringar på YouTube appen. Om detta inte hjälper, inaktivera/avinstallera dina substratum/swift teman överlagrade.\nÄntligen, om ingenting hjälper, ge community/personal en logcat.\n\n2) Om din rotversion av Vanced är tvingande stängning i mitten av appen när den är i förgrunden/aktiv eller spelar en video, Ta dina logcats och hitta:\n\n(a)- Otillfredsställedlinkerror: \nSol:- Öppna filhanteraren och gå till rotlagring.\nÖppna sedan \"system/app/youtube/lib\" ELLER \"Data/app/com.google.android.youtube/lib\" och byt namn \n\narm64-v8a till arm64\n\narmeabi-v7a till arm\n\nså fixas det.\n\nDessutom, om både \"arm och arm64\" inte finns i den katalogen ovan, prova att få både från officiella YT apk eller fråga dina vänner och extrahera den där i den katalogen\n\n(b)- Notehitelisted \"com. oogle.android.youtube\":\nSol:- Kontrollera vitlistning härifrån(todo)\n\nOm du inte vet hur man hämtar loggar, kontrollera bugreport-anteckning"
				},
				{
					"title": "Om Vanced kraschar mitt i uppspelningen (när du spelar i bakgrundsläge)",
					"content": "Eftersom detta problem endast orsakas av aggressiv batterioptimering som finns i olika OEM-skinn såsom MIUI, Emui, ColorOS, etc.., Det rekommenderas att inaktivera batterioptimering för både Vanced och MicroG app. \n\nInstruktioner för att göra det varierar på din enhets tillverkare, så vi kan inte verkligen hjälpa dig att inaktivera den. Du kan prova att använda en webbplats som \"dontkillmyapp. om\", ELLER med hjälp av Google och söka “[telefontillverkare] [telefonmodell] [Android-version] inaktivera batterioptimering”\n\nMen om du fortfarande har detta problem, ge #bugreport på telegram eller i discord med de uppgifter som krävs och loggar måste vara där så att Mods kan ta en titt vad som faktiskt orsakar. Se också till att ta tag i loggar som är specifika för vansinne, INTE hela ditt SYSTEM."
				}
			]
		},
		{
			"title": "Avinstallera och starta om",
			"description": "Om rotversionen av YouTube Vanced/ YouTube Music Vanced försvinner/avinstallerar/återställer till lager vid omstart,\n\nVi har 2 lösningar tillgängliga för dig",
			"fields": [
				{
					"title": "Lösning 1",
					"content": "Håll dig till icke-rotversionen tills devs åtgärda detta."
				},
				{
					"title": "Lösning 2",
					"content": "KRAVET: \n\nVanced Manager 2.1.0 eller nyare\nEn roothanterare som Es File Explorer eller Root Browser\nSteg 1: Gå in i /data/adb/service. / och redigera skriptet Music.sh och eller Vanced. h\n\nDe båda bör se ut som något liknande till detta:\n\nmedan [ \"`getprop sys. oot_completed <unk> tr -d\n''\"! \"1\" ] ; gör sömn 1; klar \n\nSteg 2: Ändra värdet på \"gör sömn 1; klart\" för att \"sova 2; klart\"\n\nSteg 3: Starta om eller starta om enheten\n\nOm det inte fungerar försök att lägga till mer vilotid mellan gör & gjort\n\n———————————————— —\n\nom det inte fungerar, kanske din enhet behöver mer tid innan den monterar roten vanced youtube/music apk.\nändrar bara vanced.sh och eller musik. h, \nsätt in en ny vilolinje mellan 'while' och 'mount' linje som:\n\n#!/system/bin/sh\nmedan [ \"`getprop sys. oot_completed <unk> tr -d '\n' `\" != \"1\" ]; gör sömn 1; klar\nsömn 10\nmount -o bind /data/adb/Vanced/base.apk /data/app/com.google.android.youtube-...."
				},
				{
					"title": "If Vanced crashes in the middle of playback (when playing in background mode)",
					"content": "Since this issue is only caused by aggressive battery optimization present in various OEM skins such as MIUI, EMUI, ColorOS, etc..., it is recommended to disable battery optimization for both Vanced and MicroG app. \n\nInstructions to do so vary on your device manufacturer, so we can’t really assist with helping you disable it. You can try using a site like \"dontkillmyapp.com\", OR using Google and searching “[phone manufacturer] [phone model] [Android version] disable battery optimization”\n\nHowever, if you still have this issue, provide #bugreport on telegram or in discord with the details it requires and logs must be there so that Mods can take a look what's actually causing. Also, make sure to grab logs specific to vanced, NOT your whole SYSTEM."
				}
			]
		},
		{
			"title": "Annonser aktiverad",
			"description": "Om du ser annonser på YouTube Vanced eller Vanced Music, läsa detta av xfileFIN:\n\n> Jag måste få det själv att spåra det. Eftersom enkel layoutdöljning inte fungerar för det.\nInte säker på hur de bestämmer vem som får dem, det är alla serversidor.\nVad jag vet är att jag inte kan bara dölja layouten eftersom samma layout används för faktiska videor också. Koden avgör bara om den visar reklammärket eller inte.\nJo jag kunde enkelt dölja annonsmärket men det skulle fortfarande visa den faktiska ad video, bara utan att märka det som annons.\nJag måste få annonsen själv att spåra den i koden eftersom fördunkling gör det svårt.\n\nHemskärmen och sökannonser (som lagts till av Google) är regionbaserade och kommer inte att visas om du inte är i den region som den är aktiv i. Dessa annonser läggs inte till av vansinniga team på något sätt så om du pekar finger åt oss skulle vi skratta åt dig. \n\nDevs vet redan att du får annonser i din region. Vänligen vänta tålmodigt på uppdateringar tills alla annonser blockeras. Tills dess, njut av vansinniga och inte skräppost med samma.\n\nDen tillfälliga lösningen för att åtgärda det skulle vara att rensa data och cache för appen eller vänta på framtida uppdateringar.",
			"fields": [
				{
					"title": "Solution 1",
					"content": "Stick to the non-root version until the developers fix this."
				},
				{
					"title": "Solution 2",
					"content": "REQUIREMENTS: \n\nVanced Manager 2.2.0 or newer\nStep 1: Go to manager settings > Root Script Sleep Time (you should be on root mode for this option to appear) and set the value to 2 > hit save, reboot and see if Vanced/Music still disappear. If they still disappear try adjusting the value until they stick after reboot"
				}
			]
		},
		{
			"title": "Historik",
			"description": "Om du står inför problem där videor tittade/sökresultat inte spelas in av Vanced dvs historien fungerar inte, så här får du historiken att fungera:\n\n• För användare som är rotade oavsett vilken variant (icke-rot eller rot) du använder,\n\n> Se till att du vitlistar *s. outube.com i din annons-blockerare.\n\n⚠️OBS för Adaway användare: Om vitlistning av URL:en inte fungerade för dig, tryck på \"värdkällor\" och avmarkera \"stevenblack\" och tillämpa, starta sedan om så kommer din historik att fungera.\n\n• För användare utan rot:\n\n> Kontrollera att du är på v14.10.53 eller högre för att appen ska spara din klockhistorik. Om historiken fortfarande inte uppdateras måste du slå ihop ditt varumärkeskonto i (YouTube Settings-https://www.youtube.com/account_advanced) för att få historiken att fungera. (Sammanslagningsprocessen kommer att rena den nuvarande historien.\n\n⚠️NOTE för Adaway användare som använder VPN Ad-Blocking istället för rootbaserad Ad-Blocking: Om du inte använder varumärkeskonto, se till att vitlista * s. outube.com url i tillåten lista och tillämpa ändringarna.⚠️"
		},
		{
			"title": "Problem med APP-inläsning",
			"description": "If you are facing issues where videos watched/search results are not getting recorded by Vanced i.e., history being not working, this is how you get the history working:\n\n• For users who are rooted regardless of which variant (Non-Root or Root) you are using,\n\n> Make sure you whitelist *s.youtube.com in your Ad-Blocker.\n\n⚠️NOTE for Adaway users: If whitelisting the URL didn't work for you, tap on \"host sources\" and untick \"stevenblack\" and apply, then reboot and your history will work.⚠️\n\n• For Non-Root users:\n\n> Make sure you're on v14.10.53 or higher for the app to save your watch history. If history still doesn't update, then you need to merge your brand account in [YouTube Settings](https://www.youtube.com/account_advanced) to get history working. (Merging process will clean the current history.)\n\n⚠️NOTE for Adaway users using VPN Ad-Blocking instead of root based Ad-Blocking: If you are not using brand account, make sure to whitelist *s.youtube.com url in allowed list then apply the changes.⚠️"
		},
		{
			"title": "Bild-i-bildläge",
			"fields": [
				{
					"title": "If Vanced got stuck on splash screen",
					"content": "1. Switch Airplane mode on.\n2. Open Youtube Vanced.\n\n3. Tap on close in changelog popup.\n4. Turn off Airplane mode.\n5. Reopen vanced.\n\nThanks to rocco6victorFrom XDA"
				},
				{
					"title": "If Vanced keeps on loading infinitely",
					"content": "1. Disable battery optimization for both YouTube Vanced and microG app using dontkillmyapp.com then reboot your device.\n2. It should get fixed now."
				}
			]
		},
		{
			"title": "Problem med nedladdning av app",
			"description": "⚠️Please don't report PIP related issues.⚠️\n• Pip is controlled by system as Vanced uses android native pip. Blame ROM for any issues with your PIP.\nOther apps like MX Player, VLC, etc uses its own PIP instead of android native hence they will never face such issues which persist in apps using native.\n\n• PIP is available for android 8 and above only.\n\n• To enable PIP, Open YT app settings > general > enable pip\n\n> To enable pip in MIUI, you have to make sure this setting is on:\nPrivacy protection->manage->special app accesss->picture-in-picture\n\nOn latest V15.43.32, pip is stock yt bug so please wait for Google to fix it fully first."
		},
		{
			"title": "Ta bort",
			"fields": [
				{
					"title": "Specialfunktioner",
					"content": "Om de avskilda metoderna som anges ovan inte fungerar för dig, du kan prova nedan:\n\nAnvända Titan backup-app(behöver pro version)\n\n• Öppna Titan backup \n\n• Sök efter youtube och klicka på den \n\n• Svep åt vänster för att få tillgång till specialfunktioner \n\n• Klicka på Fäst på marknaden \n\n• Gå sedan igen till specialfunktioner \n\n• Klicka på \"ta bort från marknaden\" \n\n• Klart"
				},
				{
					"title": "Specialfunktioner",
					"content": "OBS: Auto-uppdateringar måste inaktiveras i play store innan du gör detta.\n\n1. Skapa \"Detach. xt\" på följande plats /sdcard/ (motsvarande /storage/emulerad/0/) skriv \"YouTube\" i den textfilen utan offerter. Du kan också ladda ner Detach.txt från Magisk modul namn Lösgör och ta bort # framför YouTube.\n\n2. Flash Detach-modul i Magisk manager.\n\n3. Flash Daily Job Scheduler (djs) i Magisk manager.\n\n4. Starta om\n\n5. Öppna Terminal och skriv \"su -c detach -t\" och ställ in den att köras en gång i timmen.\n\n6. Klart!\n\nPlay Store uppdaterar sin databasfil på en slumpmässig rytm, ibland flera gånger om dagen. En gång i taget (som en gång varannan vecka), kommer Play Store att visa en uppdatering för Youtube, men det kommer att gå bort när skriptet har kört igen av djs."
				}
			]
		},
		{
			"title": "Fixa för SAI/Vanced Manager fel",
			"description": "You can use any of the workarounds listed below to remove the YouTube app from the market.",
			"fields": [
				{
					"title": "Workaround 1(Recommended)",
					"content": "\n\nUsing [TeMiFi app](https://forum.xda-developers.com/t/app-tool-temefi-comprehensive-system-administration.3806260), Make sure the YouTube Vanced is a user app as this method won't work if Vanced is installed as a system app.\n\nIn TeMeFi select > Give root permissions > Tap on Application info > Detach package from play store > DETACH: Select package then protection level v5 > Select YouTube with package name \"com.google.android.youtube\" > Tap on 3. Invalidate the data, block any attempt.... > Yes, I accept full responsibility"
				},
				{
					"title": "INSTALL_FAILED_UPDATE_INKOMPATIBE",
					"content": "\n\nUsing Titanium backup app(needs pro version)\n\n• Open titanium backup \n\n• Search for youtube and Click on it \n\n• Swipe left to access special features \n\n• Click on Attach to market \n\n• Then again go to special features \n\n• Click on \"detach from market\" \n\n• Done"
				},
				{
					"title": "Workaround 3",
					"content": "NOTE: Auto-Updates must be disabled in play store before doing this.\n\n1. Create \"Detach.txt\" in the following location /sdcard/ (equivalent to /storage/emulated/0/) write \"YouTube\" in that text file without quotes. You can also download the Detach.txt from Magisk module name Detach and remove the # in front of YouTube.\n\n2. Flash Detach module in Magisk manager.\n\n3. Flash Daily Job Scheduler (djs) in Magisk manager.\n\n4. Reboot\n\n5. Open Terminal and type \"su -c detach -t\" and set it to run once every hour.\n\n6. Done!\n\nPlay Store updates its database file on a random rhythm, sometimes several times a day. Once in a while (like once every two weeks), Play Store will show an update for Youtube, but it will go away when the script has run again by djs."
				},
				{
					"title": "Workaround 4",
					"content": "Switch to Non-Root variant of Vanced. This workaround should only be used as a last resort if all of the other options fail!"
				}
			]
		},
		{
			"title": "Live-Stream problem",
			"description": "Lösning: Följ denna guide > https://youtu.be/R9asMVCQkAU. Inaktivera även dina externa ad-blockers/vpn/proxy/anpassade inställningar i vanced. Behåll lagerinställningarna om du inte vill se några problem.",
			"fields": [
				{
					"title": "INSTALL_FAILED_VERSION_DOWNGRADE",
					"content": "Uninstall stock yt updates. Make sure Stock YouTube version is lower than vanced version you are installing now."
				},
				{
					"title": "INSTALL_FAILED_UPDATE_INCOMPATIBE",
					"content": "Just uninstall any vanced app that you have installed from any other source then install vanced.  Otherwise uninstall \"vanced microG\" > reboot device > then install vanced microG first then Vanced. If error still comes, use SAI to install the vanced split apks manually. These apk files are located in \n\"android / data / com.vanced.manager / files / vanced / nonroot / \""
				},
				{
					"title": "INSTALL_PARSE_FAILED_NOT_APK",
					"content": "Change the language of your phone from Indonesian to English then install vanced. After installing, you can change language back to Indonesian. If your device isn't using Indonesian language, make sure language is properly selected in Vanced manager which you wanna install with YouTube Vanced."
				},
				{
					"title": "INSTALL_FAILED_NO_MATCHING_ABIS",
					"content": "Download legacy version instead of default"
				},
				{
					"title": "INSTALL_FAILED_INVALID_APK: Split config.en was defined multiple times",
					"content": "Try removing one split_config.en apk from apks file then install\n(Apks file is just a zip file so you can easily remove the apk from it)"
				},
				{
					"title": "INSTALL_FAILED_DUPLICATE_PERMISSION",
					"content": "Uninstall microG > reboot > install vanced via sai > install microG\n\nIf microG doesn't install, install microG too via SAI."
				},
				{
					"title": "Unable to install the app because it conflicts with an already installed app with same package name",
					"content": "Uninstall microG > reboot > install vanced via sai > install microG via apk package installer\nIf microG doesn't install, install microG too via SAI."
				},
				{
					"title": "APP IS INCOMPATIBLE WITH THIS DEVICE",
					"content": "Download the legacy architecture files when downloading vanced files from official vanced mirrors instead of default architecture."
				},
				{
					"title": "INSTALL_PARSE_FAILED_NO_CERTIFICATES",
					"content": "It seems like you didn't read instructions properly and installed vanced without disabling signature verification. or you tried some method which didn't give any positive result, so the solution to both is to disable signature verification using the best method/alternative to what you used before or just use our [vanced manager](https://vancedapp.com which doesn't require you to disable signature verification."
				},
				{
					"title": "INSTALL_FAILED_INVALID_INSTALL_LOCATION",
					"content": " Please head to your device settings > developer options and turn off \"force allow apps on external\" then install the Vanced app in SAI."
				},
				{
					"title": "INSTALL_FAILED_USER_RESTRICTED: Install canceled by user",
					"content": "Unknown sources install is protected per service in your MIUI devices Please go to your device settings and enable unknown sources for SAI and issue will get solved and you will be able go install Vanced."
				},
				{
					"title": "INSTALL_FAILED_INTERNAL_ERROR: Permission Denied",
					"content": "Disable MIUI optimization from your device developer options."
				}
			]
		},
		{
			"title": "Vitlista",
			"description": "Om du stöter på kraschar på YouTube Vanced root varianter för vitlistning orsaker, kan du prova denna guide från denna länk (https://www.xda-developers. om/hur man fix-device-inte-certifierad-by-google-error) och se om det löser för dig.\n\n Alternativt, om länken inte hjälper, rensa din ROM för att åtgärda detta problem eller kontrollera med en annan ROM."
		},
		{
			"title": "Black screen video fix",
			"description": "Solution: clearing data of Youtube Vanced and subsequently reinstalling it should fix the issue. If it doesn't, try a Reboot &\nCheck if black screen issue solves. \n\nIf problem persist, factory reset your device or change the ROM."
		},
		{
			"title": "Content Restrictions",
			"description": "In English it is callled \"restricted mode\"\nIn arabic it is called \"وضع تقييد المحتوى\"\n\nTo solve issue of lesser search results, do this\n\n1. Go to settings > General\n\n2. Find \"restricted mode\" and turn it off.\n\nIf you're in a country that Google hates, use a vpn."
		},
		{
			"title": "View count change",
			"description": "To change the view count from crores/lakhs to millions, do this:\n\n\nSolution:\n\n1. Go to settings (of your phone)\n\n2. Go to system \n\n3. Go to language preferences\n\n4. Add a language as English (US) \n\n5. Drag this language above your current one.\n\n6. Go to youtube and enjoy ⚡\n\nThanks to @ROG_OK from telegram Vanced group for finding the fix."
		},
		{
			"title": "Captions",
			"description": "If you face caption issues such as random subtitles of different languages on an english video, here's what you have to do;\nSet the caption language to your region language in your caption settings.\n\nTo access caption settings, head to device settings > accessibility > captions\n\nOr\n\nYouTube settings > captions"
		},
		{
			"title": "HDR brightness Workaround",
			"description": "Use the swiping features to turn the brightness to its maximum"
		},
		{
			"title": "Settings crashes",
			"description": "Turn off your fingerprint and go in the settings and do your setting, after it's done, turn it back on. It won't crash again after that, even if you keep going in it unless you restart your device."
		}
	]
}
