{
  "data": [
    {
      "title": "YouTube vanced क्या है?",
      "description": "YouTube Vanced अपने YouTube अनुभव को बेहतर बनाने के लिए अतिरिक्त सुविधाओं के साथ YouTube का संशोधित संस्करण है!\n\nऐसी विशेषताओं में शामिल हैं:\n- पृष्ठभूमि प्लेबैक,\n- पिक्चर इन पिक्चर (PiP),\n- ब्लैक थीम (OLED के अनुकूल),\n- विज्ञापन निकालना (सक्षम करने की आवश्यकता),\n- ओवरराइड अधिकतम रिज़ॉल्यूशन (अपनी स्क्रीन से अधिक रिज़ॉल्यूशन वाले वीडियो के प्लेबैक की अनुमति दें),\n- ...और भी बहुत कुछ!\n\nअधिक जानकारी के लिए जाएं:\n<https://vancedapp.com>"
    },
    {
      "title": "डाउनलोड बटन कहां है?",
      "description": "बेशक, Google अपने स्वयं के ऐप के संशोधित संस्करण को उनके स्टोर पर नहीं होने देगा, इसलिए Google Play Store पर इसे न देखें जो कि नकली ऐप हैं।\n\nVanced Manager का उपयोग करके Vanced एप्स को डाउनलोड और इंस्टॉल किया जा सकता है जो हमारी आधिकारिक वेबसाइट पर पाया जा सकता है: <https://vancedapp.com> लेकिन आप इसे [GitHub repo] (https://github.com/YTVanced/VancedManager/releases/latest) से भी ले सकते हैं।"
    },
    {
      "title": "क्या YouTube Vanced ऑटो अपडेट करता है?",
      "description": "नहीं, यह नहीं करता।\n\nजब कोई एक होता है तो Vanced Manager आपको एक सूचना भेजेगा।\n\nआप हमारे [Discord Server] (https://discord.gg/Vanced) से भी जुड़ सकते हैं या लेटेस्ट खबरों और अपडेट नोटिफिकेशन के लिए [Telegram चैनल] (https://t.me/Vanced) को फॉलो कर सकते हैं।"
    },
    {
      "title": "क्या Vanced वीडियो डाउनलोड कर सकता है?",
      "description": "Vanced में कोई भी वीडियो डाउनलोडिंग फीचर शामिल नहीं है और न ही कभी होगा।\n\n[चयनित देशों] (https://support.google.com/youtube/answer/6141269) में मुफ्त में डाउनलोड करने के लिए कई वीडियो उपलब्ध हैं। शेष दुनिया के लिए, कृपया YouTube प्रीमियम प्राप्त करें।\n\nफिर से, Vanced कभी भी एक वीडियो डाउनलोडर या ऐसा कुछ ऐप में नही जोड़ेगा।\n\nयह अतीत में कई YouTube mods के बंद होने का कारण रहा है क्योंकि Google को लोग अपने प्लेटफ़ॉर्म से कॉपीराइट की गई सामग्री डाउनलोड करना पसंद नहीं करते हैं, इसलिए इसके लिए न कहें!!!"
    },
    {
      "title": "स्वाइप जेस्चर काम क्यों नहीं करता है?",
      "description": "यदि आपके पास Vanced सेटिंग्स> लेआउट सेटिंग्स में सबसे नीचे (पुरानी जगह) पर दिखाई गई टिप्पणियां हैं, तो उसे अक्षम करें और एप्लिकेशन को पुनरारंभ करें। यदि वह काम नहीं करता है, तो एप्लिकेशन को बंद करें और उसका डेटा साफ़ करें।"
    },
    {
      "title": "कैप्शन उपलब्ध नहीं हैं?",
      "description": "यह एक Vanced या YouTube से संबंधित समस्या नहीं है। सभी वीडियो में कैप्शन नहीं है।"
    },
    {
      "title": "क्या आप दान लेते हैं?",
      "description": "हम दान स्वीकार नहीं करते हैं!\n\nकिसी भी परिस्थिति में किसी भी प्रकार के दान और किसी भी साइट या लिंक या पोस्ट जो दान के लिए पूछते हैं, बस नकली हैं।\n\nलेकिन अगर आप Vanced Developers का समर्थन करना चाहते हैं, तो आप [इस लिंक] (https://brave.com/kev231) और AdGuard का उपयोग करके [इस लिंक] (https://adguard.com/en/welcome.html?aid=31141) का उपयोग करके Brave डाउनलोड कर सकते हैं।"
    },
    {
      "title": "प्लेयर लेआउट को ऑटो-हाइड कैसे करें?",
      "description": "आप इसे YouTube Vanced> Settings> Accessibility में कॉन्फ़िगर कर सकते हैं। यदि सेटिंग्स खोलने या काम करने में विफल रहती हैं, तो अपनी डिवाइस एक्सेसिबिलिटी सेटिंग्स पर जाएं और ध्वनि एम्पलीफायर को अक्षम करें, एक्सेस बदले करें, लाइव कैप्शन बंद करें।"
    },
    {
      "title": "स्प्लिट एपीके का इस्तेमाल क्यों कर रहे हैं?",
      "description": "चूंकि:\n\n1. स्टॉक ऐप इसका उपयोग करता है इसलिए Vanced इसका भी उपयोग करता है।\n2. यह केवल उन भाषाओं को स्थापित करता है जिन्हें आप भंडारण की खपत को कम करने के लिए निर्दिष्ट करते हैं।\n3. इसमें कोर APK का एकमात्र संस्करण है जिसे आपके डिवाइस की आवश्यकता है।\n\nबेशक, Vanced Manager या Developers इसे एक सामान्य, एकल APK फ़ाइल में बदल सकते हैं, लेकिन हम इसे करने के लिए बहुत आलसी हैं। आपको बस हमारे साथ होने की जरूरत है...\n\nहालांकि चिंता मत करिए, Vanced Manager आपके लिए पूरी मेहनत करता है इसलिए केवल `Install` बटन पर टैप करें।"
    },
    {
      "title": "स्टार्टअप स्क्रीन में रंग थीम से अलग क्यों है?",
      "description": "स्टार्टअप स्क्रीन की पृष्ठभूमि का रंग एंड्रॉइड फ्रेमवर्क रंग से लिया गया है ताकि यह सुनिश्चित हो सके कि यह सिस्टम थीम के अनुसार बदलता है। आप [Substratum] (https://play.google.com/store/apps/details?id=projekt.substratum) या [Swift Installer] (https://play.google.com/store/apps/details?id=com.brit.swiftinstaller) का उपयोग कर सकते हैं।"
    },
    {
      "title": "क्या मुझे स्थापना फ़ाइलों को फिर से डाउनलोड करना चाहिए?",
      "description": "विभिन्न कारणों से फाइलें दूषित हो सकती हैं और बाद में समस्याएं पैदा कर सकती हैं। इससे बचने के लिए, आप अपनी स्थापना को सुचारू रूप से चलाने के लिए इसे फिर से डाउनलोड करना चुन सकते हैं।"
    },
    {
      "title": "रूट संस्करण में माइक्रोफ़ोन की अनुमति क्यों नहीं है?",
      "description": "अगर आपका Vanced अप-टू-डेट है तो यह करता है।"
    },
    {
      "title": "एक्सोप्लेयर v१ क्या है?",
      "description": "यह YouTube द्वारा उपयोग किए जाने वाले वर्तमान मीडिया प्लेयर का एक पुराना संस्करण है। इसका उपयोग करते समय आपको बेहतर प्रदर्शन और स्थिरता मिल सकती है।"
    },
    {
      "title": "छिपी हुई सेटिंग्स को कैसे सक्षम करें?",
      "description": "Vanced सेटिंग्स में, इसे सक्षम करने के लिए `About` सेक्शन पर 6-7 बार टैप करें। यह केवल अतिरिक्त वीडियो कोडेक सेटिंग्स को सक्षम करता है।"
    },
    {
      "title": "How to make YouTube Vanced as default app?",
      "description": "As the title says, a lot of users have been asking many times how they can make YouTube Vanced as default for opening YouTube links from other apps(like browsers, messaging apps and any other app).\n\nFor root, you don't need to worry about because it is already set by default since YouTube Vanced gets replaced with Stock YouTube.\n\nFor non-root, solutions has been divided between as OneUI, MIUI and the rest.  We can't provide solutions for every OS out there, and you may need to Google it by yourself.",
      "fields": [
        {
          "title": "OneUI users:",
          "content": "1. Tap and hold down on YouTube or YouTube Vanced app icon\n2. Tap on **App info**.\n3. Find \"**Set as default**\" and tap it\n4. Tap \"**Open supported links**\" and choose \"**Open in this app**\"\n\nIn older versions of OneUI, the name of the options in the 4th step might be slightly difference. You may need to tap \"**Go to supported URLs**\" and choose \"**In this app**\" option.\nIn the very older version of OneUI 💩, you may need to go to **Settings** > **Apps** > *[tap three dots at the right corner]* > **Default apps** > **Set as default**. After apps loaded Find YouTube Vanced or YouTube and follow the 4th step..."
        },
        {
          "title": "MIUI users:",
          "content": "1. Open Settings\n2. Go to **Apps**,\n3. **Manage apps**,\n4. Then, tap the three dots at the right corner,\n5. **Default apps**,\n6. **Opening links**.\n7. Wait until all your apps gets listed…\n8. Find YouTube or YouTube Vanced and tap it.\n9. Tap \"**Open supported links**\" and choose \"**Open**\""
        },
        {
          "title": "AOSP & other custom UIs (OOS, ColorOS, EMUI, etc.):",
          "content": "1. Open **Settings**\n2. Go to **Apps**\n3. Tap **Default apps**\n4. Find **YouTube** or **YouTube Vanced**\n5. Tap \"**Go to Supported URLs**\" and choose \"**Open in this app**\" option\n\nIf you're still troubling with this, you may need to search some \"how to\" articles/videos on [Google](https://www.google.com/search?q=%22android%22+how+to+open+youtube+links+with+youtube) or you can install a 3rd party app from [Play Store](https://play.google.com/store/search?q=open%20with) to save you from this hassle…"
        }
      ]
    },
    {
      "title": "Why the root variant doesn't work with microG Core?",
      "description": "1. You need to have at least the [pico](https://github.com/opengapps/opengapps/wiki/Pico-Package) variant of GApps to run Vanced.\n\n2. You can’t run Vanced with microG Core without Google Play Services Framework which is available in all GApps packages and it's a required library.\n\n3. If you are worried about your privacy & don’t want to use GApps but still want to use watch YouTube without ads, then the [web version](https://youtube.com) is always available."
    },
    {
      "title": "Why casting doesn't work?",
      "description": "For users with latest v16.16.38 non-root variant, there's a bug in upstream microG. Until that resolves, please wait for updates or roll back to v15 versions. Root users will no issues with casting if they are using Google Play Services."
    },
    {
      "title": "What is APK Signing?",
      "description": "You are reading this because you are not using Vanced Manager or you may have installed Vanced from an unofficial source.\nJust use Vanced Manager!\n\nYou can safely download Vanced Manager from:\n- [Official site](https://vancedapp.com)\n- [GitHub repository](https://github.com/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Is YouTube Vanced on Play Store?",
      "description": "NO!\nAgain, DO NOT install or even try to search for any fake apps named \"YouTube Vanced\" or similar on the Play Store or any app stores to install Vanced.\n\nWe only have [Vanced Guide](https://play.google.com/store/apps/details?id=com.vanced.faq), and it's the only official app published on Play Store.\n\nIf you find any other app with our icon and name, report it as impersonation and give it a bad review.\n\nOur apps can only be found at [official site](https://vancedapp.com)."
    },
    {
      "title": "Why is Vanced not showing up in home screen or app drawer?",
      "description": "You are reading this because you are not using Vanced Manager or you may have installed Vanced from an unofficial source.\nJust use Vanced Manager!\n\nYou can safely download Vanced Manager from:\n- Official site <https://vancedapp.com>\n- [GitHub repository](https://github.com/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Why aren't videos playing?",
      "description": "Try restarting the app. It might also because of your internet connection or your device."
    },
    {
      "title": "Why am I having the 480p limit?",
      "description": "Due to the COVID-19, Google is restricting data usage of several countries. This happens on the server and affects both Vanced and stock YouTube users.",
      "fields": [
        {
          "title": "Workarounds:",
          "content": "1. Connect to a VPN of a different region.\n2. Use the [web version](https://youtube.com)\n3. Since the 480p restriction is only for phones and not tablets, you can change the device model in YouTube Vanced to overcome the restriction.\n\n#### How to change the device model?\n1. Open YouTube Vanced.\n2. Go to Settings\n3. Tap the `Vanced Settings`\n4. Enable hidden settings:\n  - Scroll down and tap on the `About` section till you get a message saying `Hidden settings enabled`.\n5. Go to `Codec override`\n6. Set manufacturer to `Samsung` and model to `SM-T865`.\n7. Restart the app.\n\nAfter restarting, the 480p limit should be gone."
        }
      ]
    },
    {
      "title": "How to hide the microG notification?",
      "description": "To hide microG the notification,\n\n1. You can disable battery optimization for Vanced microG and reboot your device.\n\n2. If the above method doesn't work, disable microG notifications by holding on to the notification, toggle it off and tap Save.\n\n>Disabling app notifications can be done in different ways depending on the Android user interface. If you don't know how to disable it, try using Google for learning how to disable it."
    },
    {
      "title": "Does 1440p look better on my 1080p screen?",
      "description": "Yes, but only if the video ratio is something like 18:9, 21:9, ... You can enable `Stats for nerds` in Settings > General to confirm it.\n\nTo enable higher resolutions, go to Vanced settings > Video settings and turn on `Max resolution` then restart the app."
    }
  ]
}
