{
  "data": [
    {
      "title": "Hvad er YouTube Vanced?",
      "description": "YouTube Vanced er en modificeret version af YouTube med ekstra funktioner der gør din YouTube-oplevelse bedre!\n\nDisse funktioner omfatter:\n- Baggrundsafspilning,\n- Billede i Billede (PiP), \n- Sort tema (OLED venlig),\n- Annonce fjernelse (kræver aktivering),\n- Tilsidesæt maksimal opløsning (tillad afspilning af video med en opløsning højere end din skærm),\n- . .and meget mere!\n\nFor mere information, besøg <https://vancedapp.com>"
    },
    {
      "title": "Hvor er download-knappen?",
      "description": "Selvfølgelig vil google ikke tillade en ændret version af deres egen app til at være i deres butik, så lad være med at lede efter Vanced på Google Play Butik. De apps du finder vil være falske.\n\nVanced apps kan downloades og installeres ved hjælp af Vanced Manager, som kan findes på vores officielle hjemmeside: <https://vancedapp.com> men du kan også få fat i det fra [GitHub](https://github.com/YTVanced/VancedManager/releases/latest)."
    },
    {
      "title": "Opdaterer YouTube Vanced automatisk?",
      "description": "Nej, det den gør ikke.\n\nVanced Manager vil sende dig en notifikation, når der er en.\n\nDu kan også deltage i vores [Discord Server](https://discord. g/wYrRPgv) eller følge vores [Telegram kanal](https://t.me/Vanced) for de seneste nyheder og opdaterings meddelelser."
    },
    {
      "title": "Kan Vanced downloade videoer?",
      "description": "Vanced indeholder ingen video download funktion og vil aldrig komme til det.\n\nMange videoer er tilgængelige til gratis download i [valgte lande](https://support.google.com/youtube/answer/6141269). I resten af verden kan du få YouTube Premium eller bruge en 3.parts downloader.\n\nIgen, Vanced vil ALDRIG tilføje en video downloader til appen eller noget lignende.\n\nDette har været årsagen til lukningen af mange YouTube mods tidligere, da Google ikke kan lide folk, der downloader ophavsretligt beskyttet indhold fra deres platform, så spørg ikke om det!!!"
    },
    {
      "title": "Why don't the swipe gestures work?",
      "description": "Hvis du har kommentarer vist nederst (gammelt layout) i Vanced indstillinger > Layout indstillinger, deaktiver det og genstarte appen. Hvis det ikke virker, tving appen til at stoppe og ryd dens data."
    },
    {
      "title": "Undertekster ikke tilgængelige?",
      "description": "Dette er ikke et problem. Ikke alle videoer har undertekster."
    },
    {
      "title": "Modtager i donationer?",
      "description": "Vi accepterer IKKE donationer!\n\nAller former for websteder, links eller indlæg der beder om donationer er falske.\n\nMen hvis du ønsker at støtte Vanced udviklere, kan du downloade Brave ved hjælp af [dette link](https://brave.com/kev231) og AdGuard ved hjælp af [dette link](https://adguard.com/en/welcome.html?aid=31141)."
    },
    {
      "title": "Hvordan får man afspillerens layout til at skjule sig automatisk?",
      "description": "Du kan konfigurere det i YouTube Vanced Indstillinger > Tilgængelighed. Hvis indstillingerne ikke åbner eller hvis det ikke virker, skal du gå til indstillingerne for adgang til din enhed og deaktivere lydforstærker, skifte adgang, live-undertekst."
    },
    {
      "title": "Hvorfor bruge opdelte APKer?",
      "description": "Fordi:\n\n1. Stadnard appen bruger den, så Vanced bruger den også.\n2. Den installerer kun de sprog, du angiver for at reducere lagerforbruget.\n3. Den har den eneste version af kerne-APK, som din enhed kræver.\n\nSelvfølgelig kan Vanced Manager eller udviklerene konvertere det til én normal APK fil, men vi er for dovne at gøre det. Du er bare nødt til at nøjes med det vi tilbyder...\n\nBare rolig dog, Vanced Manager gør alt det hårde arbejde for dig, så bare tryk på `Install` knappen."
    },
    {
      "title": "Why does the color in the startup screen not match the theme? ",
      "description": "Startskærmens baggrundsfarve er taget fra Android frameworks farve for at sikre, at det ændrer sig efter systemtemaet. Du kan bruge Substratum/Swift temaer for at ændre farven."
    },
    {
      "title": "Skal jeg downloade installationsfilerne igen?",
      "description": "Filer kan blive korrupte af forskellige årsager og kan forårsage problemer bagefter. For at undgå dette, kan du vælge at downloade dem igen for at sikre, at din installation går glat."
    },
    {
      "title": "Why doesn't the root version have Microphone permissions? ",
      "description": "Det har den, hvis din Vanced er opdateret."
    },
    {
      "title": "Hvad er ExoPlayer v1?",
      "description": "Det er en ældre version af den aktuelle medieafspiller, der bruges af YouTube. Du får måske bedre ydeevne og stabilitet, hvis du bruger den."
    },
    {
      "title": "Hvordan aktiveres skjulte indstillinger?",
      "description": "I Vanced indstillinger, tryk på 'Om' sektionene 6-7 gange for at aktivere det. Dette aktiverer kun de yderligere indstillinger for video-codec."
    },
    {
      "title": "Hvordan man laver YouTube Vanced som standard app?",
      "description": "As the title says, a lot of users have been asking many times how they can make YouTube Vanced as default for opening YouTube links from other apps(like browsers, messaging apps and any other app).\n\nFor root, you don't need to worry about because it is already set by default since official YouTube gets replaced with YouTube vanced.\n\nFor non-root, solutions has been divided between as OneUI, MIUI and the rest.  We can't provide solutions for every OS out there, and you may need to Google it by yourself.",
      "fields": [
        {
          "title": "OneUI brugere:",
          "content": "1. Tryk og hold nede på YouTube eller YouTube Vanced app-ikonet fra din app-skuffe.\n2. Tryk på **App info**.\n3. Find \"**Sæt som standard**\" og tryk på den.\n4. Tryk på \"**Åbn understøttede links**\" og vælg \"**Åbn i denne app**\"\n\nI ældre versioner af OneUI navnet på indstillingerne i 4. trin kan være lidt anderledes. Du skal muligvis trykke på \"**Gå til understøttede URLer**\" og vælg \"**I denne app**\".\nI den meget ældre version af OneUI 💩, kan du blive nødt til at gå til **Indstillinger** > **Apps** > *[tryk på de tre punkter i det højre hjørne]* > **Standard-apps** > **Sæt som standard**. Efter apps er blevet indlæst Find YouTube Vanced eller YouTube, og følg 4. trin..."
        },
        {
          "title": "MIUI brugere:",
          "content": "1. Åbn indstillinger\n2. Gå til **Apps**,\n3. **Administrer apps**,\n4. Tryk derefter på de tre prikker i højre hjørne,\n5. **Standard apps**,\n6. **Åbning af links**.\n7. Vent indtil alle dine apps bliver listet…\n8. Find YouTube eller YouTube Vanced og tryk på den.\n9. Tryk på \"**Åbn understøttede links**\" og vælg \"**Åbn **\""
        },
        {
          "title": "AOSP & andre brugerdefinerede brugergrænseflader (OOS, ColorOS, EMUI, etc.):",
          "content": "1. Åbn **Indstillinger**\n2. Gå til **Apps**\n3. Tryk på **Standard-apps**\n4. Find **YouTube** eller **YouTube Vanced**\n5. Tryk på \"**Gå til Understøttede URL'er **\" og vælg \"**Åbn i denne app **\" valgmulighed\n\nHvis du stadig er bekymret over dette, det kan være nødvendigt at søge efter nogle \"hvordan gør man\" artikler/videoer på [Google](https://www.google.com/search?q=hvordan+åbner+man+youtube+links+med+youtube) eller du kan installere en 3. parts app fra [Play Butikken](https://play.google.com/store/search?q=%C3%A5ben%20med&c=apps) for at slippe for besværet…"
        }
      ]
    },
    {
      "title": "Why doesn't the root variant work with the microG core? ",
      "description": "1. Du skal mindst have [pico](https://github.com/opengapps/opengapps/wiki/Pico-Package) udgaven af GApps for at køre Vanced.\n\n2. Du kan ikke køre Vanced med microG Core fordi den har brug for Google Play Services Framework som er tilgængelig i alle GApps-pakker og er et krævet bibliotek.\n\n3. Hvis du er bekymret for dit privatliv og ikke ønsker at bruge GApps, men stadig ønsker at se YouTube uden annoncer, så er [web versionen](https://youtube.com) altid tilgængelig."
    },
    {
      "title": "Why doesn't casting work?",
      "description": "For users with v16.16.38 and all above non-root variants and root variants who are using microG based ROMs, there's a bug in upstream microG. Until that resolves, please wait for updates or roll back to v15 versions. If you use Google Play Services with root variants, you won't have any problems with casting."
    },
    {
      "title": "Hvad er apk signering?",
      "description": "You are reading this because you are not using Vanced Manager or you may have installed Vanced from an unofficial source.\nJust use Vanced Manager!\n\nYou can safely download Vanced Manager from:\n- [Official site](https://vancedapp.com)\n- [GitHub repository](https://github.com/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Is YouTube Vanced on Play Store?",
      "description": "NO!\nAgain, DO NOT install or even try to search for any fake apps named \"YouTube Vanced\" or similar on the Play Store or any app stores to install Vanced.\n\nWe only have [Vanced Guide](https://play.google.com/store/apps/details?id=com.vanced.faq), and it's the only official app published on Play Store.\n\nIf you find any other app with our icon and name, report it as impersonation and give it a bad review.\n\nOur apps can only be found at [official site](https://vancedapp.com)."
    },
    {
      "title": "Why is Vanced not showing up in home screen or app drawer?",
      "description": "You are reading this because you are not using Vanced Manager or you may have installed Vanced from an unofficial source.\nJust use Vanced Manager!\n\nYou can safely download Vanced Manager from:\n- Official site <https://vancedapp.com>\n- [GitHub repository](https://github.com/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Why aren't videos playing?",
      "description": "Try restarting the app. It might also because of your internet connection or your device."
    },
    {
      "title": "Why am I having the 480p limit?",
      "description": "Due to the COVID-19, Google is restricting data usage of several countries. This happens on the server and affects both Vanced and stock YouTube users.",
      "fields": [
        {
          "title": "Workarounds:",
          "content": "1. Connect to a VPN of a different region.\n2. Use the [web version](https://youtube.com)\n3. Since the 480p restriction is only for phones and not tablets, you can change the device model in YouTube Vanced to overcome the restriction.\n\n#### How to change the device model?\n1. Open YouTube Vanced.\n2. Go to Settings\n3. Tap the `Vanced Settings`\n4. Enable hidden settings:\n  - Scroll down and tap on the `About` section till you get a message saying `Hidden settings enabled`.\n5. Go to `Codec override`\n6. Set manufacturer to `Samsung` and model to `SM-T865`.\n7. Restart the app.\n\nAfter restarting, the 480p limit should be gone."
        }
      ]
    },
    {
      "title": "How to hide the microG notification?",
      "description": "To hide microG the notification,\n\n1. You can disable battery optimization for Vanced microG and reboot your device.\n\n2. If the above method doesn't work, disable microG notifications by holding on to the notification, toggle it off and tap Save.\n\n> Disabling app notifications can be done in different ways depending on the Android user interface. If you don't know how to disable it, try using Google for learning how to disable it."
    },
    {
      "title": "Does 1440p look better on my 1080p screen?",
      "description": "Yes, but only if the video ratio is something like 18:9, 21:9, ... You can enable `Stats for nerds` in Settings > General to confirm it.\n\nTo enable higher resolutions, go to Vanced settings > Video settings and turn on `Max resolution` then restart the app."
    }
  ]
}
