{
  "bugreport": [
    {
      "title": "Comment signaler des bugs ?",
      "description": "Vous pouvez signaler des bugs en créant des tickets sur notre [Centre des Problèmes GitHub](https://github.com/YTVanced/Vanced#vanced-issue-center).\n\nLisez les tickets existants pour vérifier que votre problème n'a pas déjà été signalé avant d'ouvrir votre ticket !",
      "fields": [
        {
          "title": "Quand mon ticket sera-t-il examiné ?",
          "content": "Les développeurs économisent leur temps pour créer de nouvelles fonctionnalités et corriger de nombreux problèmes et chacun peut prendre un certain temps pour finir. \nVous devez juste être patient. Votre ticket sera examiné dès que possible."
        },
        {
          "title": "Comment faire un logcat ?",
          "content": "Pour les utilisateurs sans root :\nVous aurez besoin d'un PC pour prendre des sorties `logcat`. Voici un [guide texte](https://github.com/YTVanced/Vanced#creating-a-logcat-using-the-android-debug-bridge-adb-on-your-pc) et un [guide vidéo](https://youtu.be/ICLpwgsJJP0).\n\nPour les utilisateurs de root :\nVous n'avez pas besoin d'un PC pour ça. Vous pouvez suivre les instructions [ici](https://github.com/YTVanced/Vanced#creating-a-logcat-using-termux-on-your-rooted-android)."
        },
        {
          "title": "Votre bug est en rapport avec l'interface utilisateur ?",
          "content": "Pour les bugs par rapport à l'interface utilisateur, vous aurez des étapes supplémentaires.\n\nVeuillez installer et configurer [Developer Assistant](https://play.google.com/store/apps/details?id=com.appsisle.developerassistant).\nAprès ça, allez dans Vanced et reproduisez le bug, puis ouvrez la visionneuse de mise en page en déclenchant Developer Assistant.\n\nMaintenant, suivez ces étapes :\n1. Assurez-vous que le bogue s'affiche à l'écran.\n2. Tapez sur l'élément que vous pensez être affecté par le bogue.\n3. Allez dans les onglets `Élément` et `Hiérarchie` et prenez des captures d'écran de l'affichage.\n4. Ajoutez ces captures d'écran dans votre ticket."
        }
      ]
    }
  ]
}
