{
  "data": [
    {
      "title": "Qu'est-ce que YouTube Vanced&#160;?",
      "description": "YouTube Vanced est une version modifiée de YouTube avec des fonctionnalités supplémentaires pour améliorer votre expérience YouTube&#160;! \n\nCes fonctionnalités incluent&#160;:\n- Lecture en arrière-plan,\n- Image dans l'image (PiP),\n- Thème noir (compatible avec l'OLED),\n- Suppression des publicités (nécessite d'être activé),\n- Forcer la résolution max (autoriser la lecture de la vidéo avec une résolution supérieure à votre écran),\n- . .et bien plus encore&#160;!\n\nPour plus d'informations, visitez <https://vancedapp.com>"
    },
    {
      "title": "Où est le bouton de téléchargement&#160;?",
      "description": "Bien évidemment Google n'autoriserait pas une version modifiée d'une de ses applications sur leur store donc n'allez pas chercher sur le Play Store, toutes les applications présentes sont bidons.\n\nLes applications Vanced peuvent être téléchargées et installées via Vanced Manager trouvable sur le site officiel&#160;: <https://vancedapp.com> mais vous pouvez aussi l'obtenir depuis [GitHub] (<https://github.com/YTVanced/VancedManager/releases/latest>)"
    },
    {
      "title": "Est-ce que YouTube Vanced se met à jour automatiquement&#160;?",
      "description": "Non, ce n'est pas le cas.\n\nVanced Manager vous enverra une notification quand il y en aura une.\n\nVous pouvez également rejoindre notre [serveur Discord] (https://discord.gg/wYrRPgv) ou suivre le [canal Telegram] (https://t.me/Vanced) pour les dernières nouvelles."
    },
    {
      "title": "Vanced peut-il télécharger des vidéos&#160;?",
      "description": "Vanced n'inclut aucune fonctionnalité de téléchargement de vidéos et ne le fera jamais.\n\nDe nombreuses vidéos sont disponibles gratuitement dans [certains pays](https://support. oogle.com/youtube/answer/6141269). Pour le reste du monde, veuillez obtenir YouTube Premium ou utiliser un téléchargeur tiers.\n\nEncore une fois, Vanced N'AJOUTERA JAMAIS de téléchargeur de vidéo ou quelque chose de similaire à l'application.\n\nCela a été la raison de l'arrêt de nombreux mods YouTube par le passé, car Google n'aime pas les gens qui téléchargent du contenu protégé par le droit d'auteur depuis leur plateforme, alors ne le demandez pas&#160;!!!"
    },
    {
      "title": "Pourquoi les gestes de balayage ne fonctionnent pas&#160;?",
      "description": "Si vous avez les commentaires affichés en bas (ancienne place) dans Paramètres Vanced > Paramètres de mise en page, désactivez le et redémarrez l'application. Si cela ne fonctionne pas, forcez l'arrêt de l'application et effacez ces données."
    },
    {
      "title": "Sous-titres non disponibles&#160;?",
      "description": "Ce n'est pas un problème de Vanced ou de YouTube. Toutes les vidéos n'ont pas de sous-titres."
    },
    {
      "title": "Acceptez-vous les dons&#160;?",
      "description": "Nous n'acceptons pas les dons!\n\nTout type de don en toute circonstance et tout site ou lien ou message qui demandent des dons est tout simplement faux.\n\nMais si vous voulez soutenir les développeurs de Vanced, vous pouvez télécharger Brave en utilisant ce lien(https://brave.com/kev231) et AdGuard en utilisant ce lien(https://adguard.com/fr/welcome.html?aid=31141)."
    },
    {
      "title": "Comment masquer automatiquement la disposition du lecteur ?",
      "description": "Vous pouvez le configurer dans Paramètres YouTube Vanced> Accessibilité. Si les paramètres ne s'ouvrent pas ou ne fonctionnent pas, accédez aux paramètres d'accessibilité de votre appareil et désactivez l'amplificateur de son, basculez l'accès, la légende en direct."
    },
    {
      "title": "Pourquoi utiliser des APK séparés ?",
      "description": "Parce que :\n\n1. L'application de base l'utilise donc Vanced l'utilise aussi.\n2. Il n'installe que le langage que vous avez spécifié pour réduire la consommation du stockage.\n3. Il a la seule version d'APK de base dont votre appareil a besoin.\n\nBien sûr, le Manager Vanced ou les développeurs peuvent le convertir en un seul fichier APK, mais on est trop flemmards pour le faire. Vous devrez faire avec ce qu'on vous donne..\n\nNe vous inquiétez pas, le Manager Vanced fais tout le travail pour vous, vous n'avez qu'a appuyer sur le bouton \"Installer\"."
    },
    {
      "title": "Pourquoi la couleur de l'écran de démarrage est différente du thème ?",
      "description": "La couleur du fond de l'écran de démarrage est pris de la couleur de votre framework Android pour être sûr qu'il corresponde au thème du système. Vous pouvez utiliser les thèmes Substratum/Swift pour changer cette couleur."
    },
    {
      "title": "Dois-je télécharger à nouveau les fichiers d'installation ?",
      "description": "Les fichiers peuvent être corrompus à cause de diverses raisons et peuvent causer des problèmes par la suite. Pour éviter cela, vous pouvez choisir de le télécharger à nouveau pour vous assurer que votre installation se déroule sans problème."
    },
    {
      "title": "Pourquoi la version root n'a pas la permission Microphone ?",
      "description": "Elle le fait si votre Vanced est à jour."
    },
    {
      "title": "Qu'est-ce que ExoPlayer v1 ?",
      "description": "Il s'agit d'une ancienne version du lecteur multimédia utilisé par YouTube. Vous pourriez obtenir de meilleures performances et une meilleure stabilité en l'utilisant."
    },
    {
      "title": "Comment activer les paramètres cachés ?",
      "description": "Dans les paramètres de Vanced, appuyez 6-7 fois sur la section `À propros` pour l'activer. Cela n'active que les paramètres supplémentaires de codec vidéo."
    },
    {
      "title": "Pourquoi la version Root ne fonctionne pas lorsque microG Core est installé ?",
      "description": "1. Vous devez avoir au minimum la variante [pico] (https://github.com/opengapps/opengapps/wiki/Pico-Package) des GApps pour faire fonctionner Vanced.\n\n2. Vous ne pouvez pas utiliser Vanced avec le core MicroG sans le framework des services Google Play, inclus dans tous les packages GApps, qui est une librairie requise.\n\n3. Si vous êtes soucieux de votre vie privée, et que vous ne souhaitez pas utiliser GApps, mais que vous souhaitez tout de même consulter youtube sans pubs, la [version web](https://youtube.com) est disponible."
    },
    {
      "title": "Pourquoi la diffusion ne fonctionne-t-elle pas?",
      "description": "Cela fonctionne si votre installation microG est à jour."
    },
    {
      "title": "Qu'est-ce que la signature d'un APK ?",
      "description": "Vous lisez ce message parce que vous n'utilisez pas Vanced Manager ou parce que vous avez installé Vanced à partir d'une source non officielle.\nVeuillez utiliser Vanced Manager !\n\nVous pouvez télécharger Vanced Manager depuis :\n- Le site officiel <https://vancedapp.com>\n- [dépôt GitHub](https://github.com/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Est-ce que YouTube Vanced est disponible sur le PlayStore ?",
      "description": "NON !\nNe cherchez ou n'installez pas d'applications nommées \"Youtube Vanced\" ou similaire sur le Play Store ou n'importe quel magasin d'applications pour installer Vanced.\n\nNous avons seulement [Vanced Guide](https://play.google.com/store/apps/details?id=com.vanced.faq), qui est une application officielle publiée sur le Play Store.\n\nSi vous trouvez une quelconque application utilisant notre nom ou notre logo, signalez-la pour usurpation et laissez un avis négatif.\n\nNos applications sont seulement disponibles sur <https://vancedapp.com>."
    },
    {
      "title": "Pourquoi Vanced n'apparaît-il pas sur l'écran d'accueil ou dans le tiroir des applications ?",
      "description": "Vous lisez ce message parce que vous n'utilisez pas Vanced Manager ou parce que vous avez installé Vanced à partir d'une source non officielle.\nVeuillez utiliser Vanced Manager !\n\nVous pouvez télécharger Vanced Manager depuis :\n- Le site officiel <https://vancedapp.com>\n- [dépôt GitHub](https://github.com/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Pourquoi la lecture de vidéos ne fonctionne pas ?",
      "description": "Essayez de redémarrer l'application. Cela peut aussi être dû à votre connexion internet ou à votre appareil."
    },
    {
      "title": "Pourquoi suis-je limité à 480p ?",
      "description": "En raison du COVID-19, Google restreint l'utilisation des données de plusieurs pays. Cela se produit sur les serveur Youtube et affecte à la fois les utilisateurs de Vanced.",
      "fields": [
        {
          "title": "Solutions :",
          "content": "1. Se connecter à un VPN dans une région différente.\n2. Utiliser la [version web](https://youtube.com)\n3. La restriction en 480p n'étant que pour les téléphones et non les tablettes, vous pouvez changer le modèle d'appareil dans les réglages de YouTube Vanced pour surmonter la restriction.\n\n#### Comment changer le modèle d'appareil ?\n1. Ouvrir YouTube Vanced.\n2. Aller dans les paramètres\n3. Chercher `Vanced Settings`\n4. Activer les réglages cachés / hidden settings:\n  - Défiler vers le bas et taper sur la section `About`, le message `Hidden settings enabled` devrait apparaître.\n5. Aller dans `Codec override`\n6. Définir le fabriquant sur `Samsung` et le modèle sur `SM-T865`.\n7. Redémarrer l'application.\n\nAprès le redémarrage, la restriction devrait être levée."
        }
      ]
    },
    {
      "title": "Comment masquer la notification microG ?",
      "description": "Pour cacher microG la notification, vous pouvez désactiver l'optimisation de la batterie pour microG et redémarrer votre appareil.\n\nSi la notification est toujours présente après le redémarrage, désactivez les notifications microG en maintenant la notification, désactivez la et appuyez sur Enregistrer.\n\nLa désactivation des notifications d'application peut être faite de différentes manières selon l'interface utilisateur Android. Si vous ne savez pas comment la désactiver, essayez d'utiliser Google pour apprendre à la désactiver."
    },
    {
      "title": "Est-ce que la 1440p rend mieux sur mon écran 1080p?",
      "description": "Oui, mais seulement si le rapport vidéo est quelque chose comme 18: 9, 21: 9, ... Vous pouvez activer \"Statistiques pour professionnel\" dans Paramètres> Général. Pour activer des résolutions plus élevées, allez dans Paramètres Vanced> Paramètres vidéo et activez «Résolution maximale» puis redémarrez l'application."
    }
  ]
}