{
  "data": [
    {
      "title": "O que é o YouTube Vanced?",
      "description": "YouTube Vanced é uma versão modificada do YouTube com recursos extras para fazer sua experiência no YouTube melhor!\n\nTais recursos incluem:\n- Reprodução em segundo plano,\n- Picture in Picture (PiP), \n- Tema preto (compatível com OLED),\n- Remoção de anúncios (requer ativação),\n- Substituir resolução máxima (permitir a reprodução de vídeo com uma resolução maior do que a sua tela),\n- .and muito mais!\n\nPara mais informações, visite <https://vancedapp.com>"
    },
    {
      "title": "Onde está o botão de download?",
      "description": "Claro, a Google não vai permitir que uma versão modificada do seu próprio aplicativo esteja na loja, então não procure na Google Play Store, esses são aplicativos falsos.\n\nAplicativos Vanced podem ser baixados e instalados usando o Vanced Manager, que pode ser encontrado em nosso site oficial: <https://vancedapp.com>, mas você também pode obtê-lo através do [repositório GitHub](https://github.com/YTVanced/VancedManager/releases/latest)."
    },
    {
      "title": "O aplicativo será atualizado automaticamente?",
      "description": "Não, não tem.\n\nVanced Manager lhe enviará uma notificação quando houver uma.\n\nVocê também pode entrar em nosso [Servidor Discord](https://discord.gg/wYrRPgv) ou siga [canal do Telegram](https://t.me/Vanced) para as últimas notícias e avisos de atualização também."
    },
    {
      "title": "O Vanced pode baixar vídeos?",
      "description": "Vanced não inclui qualquer recurso de download de vídeo e nunca irá.\n\nMuitos vídeos estão disponíveis para download gratuito em [países selecionados](https://support.google.com/youtube/answer/6141269). Para o resto do mundo, adquira o YouTube Premium ou use um downloader de terceiros.\n\nNovamente, Vanced NUNCA adicionará um downloader de vídeo ao app ou qualquer coisa parecida.\n\nEste tem sido o motivo para o encerramento de muitos mods do YouTube no passado, já que o Google não gosta de pessoas baixando conteúdo com direitos autorais da plataforma, então não peça!!!"
    },
    {
      "title": "Por que os gestos de deslize não funcionam?",
      "description": "Se os seus comentários estiverem sendo mostrados na parte inferior (local antigo), em Configurações do Vanced > Configurações de Layout, desligue-o e reinicie o aplicativo. Se isso não resolver, force a parada do aplicativo e limpe seus dados."
    },
    {
      "title": "Legendas não disponíveis?",
      "description": "Isso não é um problema. Nem todos os vídeos têm legendas."
    },
    {
      "title": "Vocês aceitam doações?",
      "description": "Nós NÃO aceitamos doações!\n\nQualquer tipo de doação em qualquer circunstância, bem como quaisquer sites ou links ou postagens que solicitem doações são simplesmente falsos.\n\nMas se você deseja apoiar desenvolvedores do Vanced, você pode baixar o Brave usando [este link](https://brave.com/kev231) e o AdGuard usando [este link](https://adguard.com/en/welcome.html?aid=31141)."
    },
    {
      "title": "Como auto-ocultar o layout do reprodutor?",
      "description": "Você pode configurá-lo em Configurações Vanced > Acessibilidade. Se as configurações não abrirem ou não funcionarem, vá para as configurações de acessibilidade do dispositivo e desative o amplificador de som, acesso com interruptor e legenda ao vivo."
    },
    {
      "title": "Porque usar APKs divididos?",
      "description": "Porque:\n\n1. O aplicativo padrão usa, portanto o Vanced também usa.\n2. Ele só instala os idiomas que você especificar para reduzir o consumo do armazenamento.\n3. Ele tem a única versão do core APK que o seu dispositivo precisa.\n\nClaro, o Vanced Manager ou desenvolvedores podem convertê-lo em um arquivo APK normal, mas nós somos muito preguiçosos para fazer isso. Você só precisa aceitar o que temos...\n\nNão se preocupe, o Vanced Manager faz todo o trabalho duro para você, você só precisa tocar em `Instalar`."
    },
    {
      "title": "Por que a cor na tela de início é diferente do tema?",
      "description": "O plano de fundo da tela inicial é obtido através do framework de cores do Android para se certificar que o mesmo mude conforme o tema do sistema. Você pode usar temas Substratum/Swift para alterar a cor."
    },
    {
      "title": "Eu deveria baixar os arquivos de instalação novamente?",
      "description": "Os arquivos podem estar corrompidos por várias razões e podem causar problemas posteriores. Para evitar isso você pode optar por baixa-los novamente para garantir que tudo corra bem na instalação."
    },
    {
      "title": "Por que a versão root não tem a permissão de Microfone?",
      "description": "Ele tem se seu Vanced estiver atualizado."
    },
    {
      "title": "O que é ExoPlayer v1?",
      "description": "É uma versão mais antiga do player de mídia atual usado pelo YouTube. Pode ser que você tenha melhor desempenho e estabilidade ao usá-lo."
    },
    {
      "title": "Como ativar as opções ocultas?",
      "description": "Em Configurações do Vanced, toque em na seção `Sobre` umas 6-7 vezes para ativa-lo. Isso habilita somente as configurações de codec de vídeo adicionais."
    },
    {
      "title": "Como fazer o YouTube Vanced como o app padrão?",
      "description": "As the title says, a lot of users have been asking many times how they can make YouTube Vanced as default for opening YouTube links from other apps(like browsers, messaging apps and any other app).\n\nFor root, you don't need to worry about because it is already set by default since YouTube Vanced gets replaced with Stock YouTube.\n\nFor non-root, solutions has been divided between as OneUI, MIUI and the rest.  We can't provide solutions for every OS out there, and you may need to Google it by yourself.",
      "fields": [
        {
          "title": "OneUI users:",
          "content": "1. Toque e segure no ícone do YouTube ou do YouTube Vanced na sua lista de apps.\n2. Toque em **Informações do aplicativo**.\n3. Encontre \"**Definir como padrão**\" e toque nele\n4. Toque em \"**Abrir links suportados**\" e escolha \"**Abrir neste aplicativo**\"\n\nEm versões mais antigas do OneUI, o nome das opções no quarto passo pode ser um pouco diferente. Você pode precisar tocar em \"**Ir para URLs suportadas** e escolher \"**Neste aplicativo**\".\nNa versão mais antiga da OneUI 💩, você pode precisar ir para **Configurações** > **Aplicativos** > *[toque em três pontos no canto direito]* > **Aplicativos padrão** > **Definir como padrão**. Após os aplicativos carregarem, encontre o YouTube Vanced ou YouTube e siga o quarto passo..."
        },
        {
          "title": "MIUI users:",
          "content": "1. Open Settings\n2. Go to **Apps**,\n3. **Manage apps**,\n4. Then, tap the three dots at the right corner,\n5. **Default apps**,\n6. **Opening links**.\n7. Wait until all your apps gets listed…\n8. Find YouTube or YouTube Vanced and tap it.\n9. Tap \"**Open supported links**\" and choose \"**Open**\""
        },
        {
          "title": "AOSP & other custom UIs (OOS, ColorOS, EMUI, etc.):",
          "content": "1. Open **Settings**\n2. Go to **Apps**\n3. Tap **Default apps**\n4. Find **YouTube** or **YouTube Vanced**\n5. Tap \"**Go to Supported URLs**\" and choose \"**Open in this app**\" option\n\nIf you're still troubling with this, you may need to search some \"how to\" articles/videos on [Google](https://www.google.com/search?q=%22android%22+how+to+open+youtube+links+with+youtube) or you can install a 3rd party app from [Play Store](https://play.google.com/store/search?q=open%20with) to save you from this hassle…"
        }
      ]
    },
    {
      "title": "Why the root variant doesn't work with microG Core?",
      "description": "1. You need to have at least the [pico](https://github.com/opengapps/opengapps/wiki/Pico-Package) variant of GApps to run Vanced.\n\n2. You can’t run Vanced with microG Core without Google Play Services Framework which is available in all GApps packages and it's a required library.\n\n3. If you are worried about your privacy & don’t want to use GApps but still want to use watch YouTube without ads, then the [web version](https://youtube.com) is always available."
    },
    {
      "title": "Why casting doesn't work?",
      "description": "For users with latest v16.16.38 non-root variant, there's a bug in upstream microG. Until that resolves, please wait for updates or roll back to v15 versions. Root users will no issues with casting if they are using Google Play Services."
    },
    {
      "title": "What is APK Signing?",
      "description": "You are reading this because you are not using Vanced Manager or you may have installed Vanced from an unofficial source.\nJust use Vanced Manager!\n\nYou can safely download Vanced Manager from:\n- [Official site](https://vancedapp.com)\n- [GitHub repository](https://github.com/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Is YouTube Vanced on Play Store?",
      "description": "NO!\nAgain, DO NOT install or even try to search for any fake apps named \"YouTube Vanced\" or similar on the Play Store or any app stores to install Vanced.\n\nWe only have [Vanced Guide](https://play.google.com/store/apps/details?id=com.vanced.faq), and it's the only official app published on Play Store.\n\nIf you find any other app with our icon and name, report it as impersonation and give it a bad review.\n\nOur apps can only be found at [official site](https://vancedapp.com)."
    },
    {
      "title": "Why is Vanced not showing up in home screen or app drawer?",
      "description": "You are reading this because you are not using Vanced Manager or you may have installed Vanced from an unofficial source.\nJust use Vanced Manager!\n\nYou can safely download Vanced Manager from:\n- Official site <https://vancedapp.com>\n- [GitHub repository](https://github.com/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Por que os vídeos não estão sendo reproduzidos?",
      "description": "Try restarting the app. It might also because of your internet connection or your device."
    },
    {
      "title": "Por que tenho um limite de 480p?",
      "description": "Devido à COVID-19, Google está restringindo o uso de dados de diversos países. Isso acontece no servidor e afeta tanto os usuários Vanced quanto os usuários do YouTube padrão.",
      "fields": [
        {
          "title": "Workarounds:",
          "content": "1. Connect to a VPN of a different region.\n2. Use the [web version](https://youtube.com)\n3. Since the 480p restriction is only for phones and not tablets, you can change the device model in YouTube Vanced to overcome the restriction.\n\n#### How to change the device model?\n1. Open YouTube Vanced.\n2. Go to Settings\n3. Tap the `Vanced Settings`\n4. Enable hidden settings:\n  - Scroll down and tap on the `About` section till you get a message saying `Hidden settings enabled`.\n5. Go to `Codec override`\n6. Set manufacturer to `Samsung` and model to `SM-T865`.\n7. Restart the app.\n\nAfter restarting, the 480p limit should be gone."
        }
      ]
    },
    {
      "title": "How to hide the microG notification?",
      "description": "Para ocultar a notificação do microG,\n\n1. Você pode desativar a otimização de bateria para o Vanced microG e reiniciar seu dispositivo.\n\n2. Se o método acima não funcionar, desative as notificações do microG segurando a notificação, desligue-a e toque em Salvar.\n\n> Desabilitar notificações de aplicativos pode ser feito de diferentes formas, dependendo da interface de usuário do Android. Se você não sabe como desativá-lo, tente usar o Google para aprender como desativá-lo."
    },
    {
      "title": "Does 1440p look better on my 1080p screen?",
      "description": "Sim, mas apenas se a taxa de vídeo for algo como 18:9, 21:9,... Você pode habilitar ' Estatísticas para nerds\" em Configurações > Geral para confirmar.\n\nPara habilitar resoluções mais altas, vá para Configurações do Vanced > Configurações de vídeo e ative a \"Resolução Máxima\", então reinicie o aplicativo."
    }
  ]
}
