{
  "data": [
    {
      "title": "Vanced",
      "description": "YouTube Vanced tem como objetivo ser uma versão melhorada do YouTube. Ele inclui bloqueador de anúncio, tema preto, e muito mais. Use o Vanced Manager para instalar o YouTube Vanced com relativa facilidade."
    },
    {
      "title": "Vanced Music",
      "description": "Vanced Music tem o mesmo objetivo que o YouTube Vanced, porém o foco dele é no YouTube Music. O aplicativo é menos rico em recursos comparado ao Vanced, mas mesmo assim agrega muitas coisas que você espera, como bloqueador de anúncios e reprodução em segundo plano, tudo isso dentro do YouTube Music!"
    },
    {
      "title": "Principais recursos do YouTube Vanced",
      "description": "- Tema preto compatível com OLED.\n- Bloqueia todos os anúncios.\n- Permite que você reproduza vídeos em segundo plano ou no modo Picture in Picture (PiP) (somente no Android 8+).\n- Controles por deslize permitem que você controle o brilho e volume com gestos para cima e para baixo (com abrangência configurável).\n- Repetição automática que permite você repita vídeos continuamente.\n- Novo layout de mini-player de comentário/tablet pode ser alternado para as versões de tablet que são muito semelhantes à versão antiga (embora com problemas)."
    },
    {
      "title": "Opções de customização",
      "description": "- Permite que você substitua opções de Codec como forçar H264 para dispositivos antigos ou VP9, isso também permite que você force a reprodução em HDR ou desative 60 fps se você preferir uma experiência cinemática. (Configurações personalizadas do dispositivo para esses recursos podem ser encontradas em nosso discord ou XDA)\n- Força a resolução de vídeo padrão tão alta ou baixa quanto quiser e até mesmo sobrescreve a resolução de sua tela para essa reprodução nítida de 4k em qualquer dispositivo. Também permite que você altere a velocidade de reprodução padrão entre 0. 5x a 2x (assumindo que seu dispositivo seja poderoso o suficiente)\n- Permite que você desligue os anúncios na tela inicial, a maioria dos anúncios de UI, anúncios de Merchandise, posts da Comunidade, venda de filmes, compacte informações de banners (como informações de COVID-19), remova completamente os comentários, filmes compactos, remoção de prateleira de filmes e muito mais!"
    },
    {
      "title": "SponsorBlock",
      "description": "- Permite pular segmentos de patrocinadores (onde um youtuber anuncia um serviço ou produto no meio de um vídeo)\n- Também suporta pular outras categorias, como introduções, outros e autopromoção.\n- Usa a API encontrada aqui. Você pode encontrar mais informações sobre como ela funciona\n- Ele também permite que você envie seus próprios segmentos para a API e contribua com a comunidade\n- Completo o controle de escolher se vai pular automaticamente uma categoria de segmento, mostrar um botão para pular, ou não pular nada.\n- Destaca o segmento em uma cor específica conforme sua categoria na linha do tempo de reprodução."
    },
    {
      "title": "Plataformas",
      "description": "Atualmente o aplicativo só existe no android, não há planos de suportar quaisquer outras plataformas no momento"
    },
    {
      "title": "Diferença entre Root e Sem-Root",
      "description": "- Root: \nA variante root do Vanced substitui perfeitamente o aplicativo oficial do YouTube. Como resultado, você pode abrir diretamente os links do YouTube ou chamá-los usando o Google Assistente através do aplicativo modificado Vanced.\n- Sem-Root:\n- Se você tem um dispositivo que é difícil de fazer root ou não quer fazer root no seu dispositivo primário para começo de história, você deve optar pela variante sem root. \n- Ela também pode ser instalada em um dispositivo com root. Uma vez que o nome do pacote da variante sem-root é diferente do aplicativo padrão do YouTube, eles podem coexistir. Observe que você precisa instalar um app adicional (microG) para conseguir se conectar com sua conta do YouTube/Google. \n- Além disso, você deve definir manualmente o Vanced como aplicativo padrão para abrir links do YouTube. \n- No entanto, a variante sem-root é simplesmente mais fácil de manter, então recomendamos que você fique com a variante sem-root a menos que você realmente precise substituir o aplicativo padrão do YouTube no seu telefone."
    }
  ]
}
