{
  "data": [
    {
      "title": "Was ist YouTube Vanced?",
      "description": "YouTube Vanced ist eine modifizierte Version von YouTube mit mehr Funktionen, um Ihr YouTube-Erlebnis zu verbessern!\n\nSolche Funktionen sind:\n- Hintergrundwiedergabe\n- Bild-in-Bild (PiP)\n- Schwarzes Thema (geeignet für OLED)\n- Werbeblocker (Aktivieren erforderlich)\n- Überschreiben der maximalen Auflösung (Auflösungen aktivieren, die höher sind als Ihr Bildschirm)\n- ...und sehr viel mehr!\n\nMehr Informationen gibt es auf <https://vancedapp.com>"
    },
    {
      "title": "Wo ist der Download-Knopf?",
      "description": "Natürlich lässt Google keine modifizierte Version seiner eigenen App in ihrem Shop zu, also suche nicht im Google Play Store nach diesen gefälschten Apps.\n\nVanced kann mit dem Vanced Manager heruntergeladen und installiert werden, der auf unserer offiziellen Website gefunden werden kann: <https://vancedapp.com> Sie können ihn aber auch von GitHub abrufen: <https://github.com/YTVanced/VancedManager/releases/latest>"
    },
    {
      "title": "Wird sich YouTube Vanced automatisch aktualisieren?",
      "description": "Nein, wird es nicht.\n\nVanced Manager wird Sie benachrichtigen, wenn es ein Update gibt.\n\nSie können auch unserem [Discord-Server](https://discord.gg/wYrRPgv) oder unserem [Telegram-Kanal](https://t.me/Vanced) für die neuesten News und Updates folgen."
    },
    {
      "title": "Kann Vanced Videos herunterladen?",
      "description": "Vanced beinhaltet keine Video-Download-Funktion und wird es auch nie.\n\nViele Videos stehen in [ausgewählten Ländern](https://support.google.com/youtube/answer/6141269) kostenlos zum Download zur Verfügung. Für den Rest der Welt benötigen Sie YouTube Premium oder einen Drittanbieter-Downloader.\n\nNochmals, Vanced WIRD NIE einen Video-Downloader oder ähnliches hinzufügen.\n\nDies war der Grund für das Herunternehmen vieler YouTube-Mods in der Vergangenheit, da Google es nicht mag, dass Leute urheberrechtlich geschützte Inhalte von ihrer Plattform herunterladen, also bitten Sie nicht darum!!!"
    },
    {
      "title": "Warum funktionieren die Wischgesten nicht?",
      "description": "Wenn Sie in den Vanced-Einstellungen > Layout-Einstellungen \"alte Kommentare\" (Kommentare werden am Boden angezeigt) aktiviert haben, deaktivieren Sie es und starten Sie die App neu. Sollte dies nicht funktionieren, erzwingen sie ein Beenden der App und löschen ihre Daten."
    },
    {
      "title": "Untertitel sind nicht verfügbar?",
      "description": "Dies ist kein Problem. Nicht alle Videos haben Untertitel."
    },
    {
      "title": "Akzeptieren Sie Spenden?",
      "description": "Wir akzeptieren KEINE Spenden!\n\nJede Art von Spenden sind unter allen Umständen und auf jeglichen Seiten, unter jeglichen Links und unter allen Beiträgen, welche für Spenden fragen, einfach gefälscht.\n\nAber wenn du die Vanced Entwickler unterstützen möchtest, kannst du Brave über [diesen Link](https://brave.com/kev231) und AdGuard über [diesen Link](https://adguard.com/en/welcome.html?aid=31141) herunterladen."
    },
    {
      "title": "Wie lässt sich das Layout des Players automatisch verbergen?",
      "description": "Sie können es unter YouTube Vanced Einstellungen > Bedienungshilfe konfigurieren. Wenn die Einstellungen nicht geöffnet werden oder nicht funktionieren, gehen Sie zu den Einstellungen für die Bedienungshilfen Ihres Gerätes und deaktivieren Sie Klangverstärker, Zugangswechsel, Live-Untertitel."
    },
    {
      "title": "Wozu die geteilten apks?",
      "description": "Weil:\n\n1. Die normale App verwendet sie, also benutzt sie Vanced auch.\n2. Es installiert nur die Sprachen, die Sie angeben, um den Speicherverbrauch zu senken.\n3. Es verfügt über die einzige Version der Kern-APK, die Ihr Gerät benötigt.\n\nNatürlich könnten der Vanced Manager oder die Entwickler diese in eine normale, einzelne APK-Datei konvertieren, aber wir sind zu faul, das zu tun. Sie müssen nur mit dem fertig werden, was wir haben...\n\nKeine Sorge, Vanced Manager erledigt die harte Arbeit für Sie, also tippen Sie einfach auf den `Installieren`-Knopf."
    },
    {
      "title": "Warum ist die Farbe des Startbildschirms anders als die des visuellen Themas?",
      "description": "Die Hintergrundfarbe des Startbildschirms wird aus der Android-Framework-Farbe entnommen, um sicherzustellen, dass sie sich entsprechend dem System-Theme ändert. Sie können Substratum/Swift Themes verwenden, um die Farbe zu ändern."
    },
    {
      "title": "Sollte ich die Installationsdateien noch einmal herunterladen?",
      "description": "Dateien können aus verschiedenen Gründen beschädigt werden und können danach zu Problemen führen. Um dies zu vermeiden, können Sie sie erneut herunterladen, um sicherzustellen, dass Ihre Installation reibungslos läuft."
    },
    {
      "title": "Warum hat die Root-Version keine Berechtigung für das Mikrofon?",
      "description": "Hat sie schon, wenn Ihr Vanced auf dem neuesten Stand ist."
    },
    {
      "title": "Was ist ExoPlayer v1?",
      "description": "Er ist eine ältere Version des aktuellen Media Players, der von YouTube verwendet wird. Sie erhalten möglicherweise bessere Leistung und Stabilität, wenn Sie ihn verwenden."
    },
    {
      "title": "Wie aktiviert man die versteckten Einstellungen?",
      "description": "Tippen Sie in den Vanced Einstellungen im \"Über\"-Abschnitt 6-7 Mal, um ein geheimes Menü zu entsperren. Dieses Menü aktiviert nur die zusätzlichen Video-Codec-Einstellungen."
    },
    {
      "title": "Was stimmt mit microG Core nicht?",
      "description": "1. Sie brauchen zumindest [pico](https://github.com/opengapps/opengapps/wiki/Pico-Package) Gapps, um Vanced verwenden zu können.\n\n2. Sie können Vanced nicht mit dem microG-Core ausführen, da es Google Play Services Framework benötigt, das in allen Gapps-Paketen verfügbar ist.\n\n3. Wenn Sie sich Sorgen um Ihre Privatsphäre machen und Gapps nicht verwenden möchten, aber trotzdem Vanced verwenden möchten, dann gibt es immer noch die [Web-Version](https://youtube.com)."
    },
    {
      "title": "Warum funktioniert Chromecast nicht?",
      "description": "Es funktioniert, wenn Ihr MicroG auf dem neuesten Stand ist."
    },
    {
      "title": "Was bedeutet Apk-Signierung?",
      "description": "Sie lesen dies, weil Sie den Vanced Manager nicht verwenden oder Vanced aus einer inoffiziellen Quelle installiert haben. \nBenutzen Sie doch einfach den verbesserten Manager!\n\nSie können den Vanced Manager sicher herunterladen von:\n- der offiziellen Seite <https://vanc<https://vancedapp.com>edapp.com> \n- [GitHub](https://github. om/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Gibt es YouTube Vanced im Play Store?",
      "description": "NEIN!\nNoch einmal, installieren sie KEINE Fake-Apps namens \"YouTube Vanced\" o.ä. aus dem Play Store oder anderen Stores.\n\nWir haben nur den [Vanced Guide](https://play.google.com/store/apps/details?id=com.vanced.faq), und es ist die einzige offizielle App im Play Store.\n\nWenn Sie eine andere App mit unserem Icon and Namen finden, Melden Sie sie wegen Nachahmung und geben Sie ihr eine schlechte Bewertung.\n\nUnsere Apps können nur auf <https://vancedapp.com> gefunden werden."
    },
    {
      "title": "Warum wird Vanced nicht auf dem Home-Bildschirm oder in der App-Übersicht angezeigt?",
      "description": "Sie lesen dies, weil Sie Vanced Manager nicht verwenden oder Sie Vanced aus einer inoffiziellen Quelle installiert haben. \nBenutzen Sie einfach den verbesserten Manager!\n\nSie können den Vanced Manager sicher herunterladen von:\n- Offizielle Seite <https://vancedapp.com> \n- [GitHub repository](https://github. om/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Warum spielen Videos nicht ab?",
      "description": "Versuchen Sie die App neu zu starten. Es könnte auch aufgrund Ihrer Internetverbindung oder Ihres Geräts sein."
    },
    {
      "title": "Warum habe ich das 480p-Limit?",
      "description": "Aufgrund von COVID-19 beschränkt Google die Datennutzung in mehreren Ländern. Dies geschieht auf dem Server und betrifft sowohl Vanced als auch Stock-YouTube-Benutzer.",
      "fields": [
        {
          "title": "Übergangslösungen:",
          "content": "1. Verbinden Sie sich mit einem VPN einer anderen Region.\n2. Nutzen Sie die [Web-Version](https://youtube.com)\n3. Da die 480p Einschränkung nur für mobile Geräte und nicht Tablets gilt, können Sie das Gerätemodell in YouTube Vanced ändern, um die Einschränkung zu überwinden.\n\n#### Wie ändere ich das Gerätemodell?\n1. Öffnen Sie YouTube Vanced.\n2. Aktivieren Sie zusätzliche Optionen \n  1. Gehen Sie zu Einstellungen\n  2. Tippen Sie auf die erweiterten Einstellungen\n  3. Tippen Sie auf die Über-Sektion, bis Sie die Nachricht \"versteckte Einstellungen aktiviert\" bekommen.\n3. Gehen Sie zu Codec überschreiben und setzen Sie Modell auf \"SM-T865\" und Gerät auf \"Samsung\".\n4. Starten Sie die App neu und das 480p-Limit sollte weg sein."
        }
      ]
    },
    {
      "title": "Wie blendet man die Vancad microG-Benachrichtigung aus?",
      "description": "Um die Benachrichtigung von microG auszublenden, können Sie die Batterieoptimierung für microG deaktivieren und Ihr Gerät neu starten.\n\nWenn die Benachrichtigung nach dem Neustart noch vorhanden ist, deaktivieren Sie die microG Benachrichtigungen durch Halten der Benachrichtigung. Schalten Sie sie aus und tippen Sie auf Speichern.\n\nDie Deaktivierung von App-Benachrichtigungen kann je nach Android-Benutzeroberfläche auf unterschiedliche Weise erfolgen. Wenn Sie nicht wissen, wie Sie sie deaktivieren, verwenden Sie Google um herauszufinden, wie Sie sie deaktivieren."
    },
    {
      "title": "Sieht 1440p auf meinem 1080p-Bildschirm besser aus?",
      "description": "Ja, aber nur, wenn das Video-Verhältnis 18:9, 21:9, ... ist. Sie können `Statistiken für Interessierte` in Einstellungen > Allgemein aktivieren, um es zu bestätigen.\n\nUm höhere Auflösungen zu aktivieren, gehen Sie zu den Vanced Einstellungen > Videoeinstellungen und aktivieren Sie \"Maximale Auflösung\" und starten Sie die App neu."
    }
  ]
}