{
  "data": [
    {
      "title": "Πώς μπορώ να αναφέρω σφάλματα;",
      "description": "Μπορείτε να αναφέρετε σφάλματα δημιουργώντας ένα issue στο [Vanced Issue Center](https://github.com/YTVanced/Vanced) του GitHub\n\nΣιγουρευτείτε ότι έχετε κοιτάξει τα ήδη υπάρχοντα σφάλματα για να ελέγξετε ότι το σφάλμα δεν έχει ξαναναφερθεί προτού δημιουργήσετε νέο issue!",
      "fields": [
        {
          "title": "Πότε θα εξεταστεί το σφάλμα μου;",
          "content": "Στους προγραμματιστές τους παίρνει αρκετό χρόνο να δημιουργήσουν καινούργιες δυνατότητες και να διορθώσουν πολλαπλά σφάλματα, για καθένα από αυτά μπορεί να χρειαστεί αρκετός χρόνος για να ολοκληρωθεί. \nΑπλώς χρειάζεται να είστε υπομονετικοί. Τα σφάλματα ελέγχονται όσο το δυνατόν πιο γρήγορα."
        },
        {
          "title": "Πως μπορώ να δημιουργήσω ένα αρχείο logcat;",
          "content": "For non-root users:\nYou will need a PC to take `logcat` outputs. Here is a [text guide](https://github.com/YTVanced/Vanced#creating-a-logcat-using-the-android-debug-bridge-adb-on-your-pc) and a [video guide](https://youtu.be/ICLpwgsJJP0).\n\nFor root users:\nYou don't need a PC for this, please follow [the instructions](https://github.com/YTVanced/Vanced#creating-a-logcat-using-termux-on-your-rooted-android)."
        },
        {
          "title": "Το σφάλμα σας έχει να κάνει με την διεπαφή χρήστη;",
          "content": "Για σφάλματα που σχετίζονται με την διεπαφή χρήστη, πρέπει να ακολουθήσετε περισσότερα βήματα.\n\nΠαρακαλώ εγκαταστήστε και ρυθμίστε το [Developer Assistant](https://play.google.com/store/apps/details?id=com. ppsisle.developerassistant).\nΜετά από αυτό, πηγαίνετε στο Vanced και αναπαράγετε το σφάλμα, στη συνέχεια, ανοίξτε το Layout viewer ενεργοποιώντας το Developer Assistant.\n\nΤώρα ακολουθήστε αυτά τα βήματα:\n1. Βεβαιωθείτε ότι το σφάλμα εμφανίζεται στην οθόνη.\n2. Πατήστε στο στοιχείο που νομίζετε ότι επηρεάζεται από το σφάλμα.\n3. Μεταβείτε στις καρτέλες `Element` και `Hierarchy` και πάρτε στιγμιότυπο οθόνης τις εξόδους.\n4. Συμπεριλάβετε αυτά τα στιγμιότυπα στην αναφορά σας."
        }
      ]
    }
  ]
}
