{
  "data": [
    {
      "title": "Τι είναι το YouTube Vanced;",
      "description": "Το YouTube Vanced είναι μια πειραγμένη έκδοση του YouTube με παραπάνω δυνατότητες για να βελτιώσει την συνολική εμπειρία σας στο YouTube!\n\nΠεριλαμβάνονται δυνατότητες όπως:\n- Αναπαραγωγή παρασκηνίου,\n- Picture in Picture (PiP),\n- Απόλυτο Μαύρο θέμα (φιλικό ως προς τις οθόνες OLED)\n- Αφαίρεση διαφημίσεων (πρέπει να το ενεργοποιήσετε)\n- Παράκαμψη μέγιστης ανάλυσης (επιτρέπει την αναπαραγωγή βίντεο μεγαλύτερης ανάλυσης από αυτήν της οθόνης σας)\n-... και πολλά άλλα!\nΓια περισσότερες πληροφορίες, επισκεφτείτε το <https://vancedapp.com>"
    },
    {
      "title": "Που είναι το κουμπί Λήψης;",
      "description": "Φυσικά, η Google δεν θα επέτρεπε ποτέ μια πειραγμένη έκδοση της δικής της εφαρμογής ή κάτι άλλο παρόμοιο να είναι στο κατάστημά της, οπότε μην την ψάχνετε στο Google Play Store, οι υπόλοιπες εφαρμογές είναι ψεύτικες.\n\nΟι Vanced εφαρμογές μπορούν να ληφθούν και να εγκατασταθούν χρησιμοποιόντας τον Διαχειριστή Vanced που μπορεί να βρεθεί στην επίσημη ιστοσελίδα μας: <https://vancedapp.com> αλλά μπορείτε επίσης να το λάβετε από το [GitHub repo](https://github. om/YTVanced/VancedManager/releases/latest)."
    },
    {
      "title": "Ενημερώνεται αυτόματα το YouTube Vanced;",
      "description": "Όχι, δεν ενημερώνεται αυτόματα. \n\nΟ Διαχειριστής Vanced θα σας ειδοποιεί όταν θα υπάρχει διαθέσιμη ενημέρωση.\n\nΜπορείτε επίσης να πείτε στον [Διακομιστή μας στο Discord](https://discord.gg/Vanced) ή να ακολουθείσετε το [Κανάλι μας στο Telegram](https://t.me/Vanced) για τα τελευταία νέα και ειδοποιήσεις για ενημερώσεις."
    },
    {
      "title": "Μπορεί το Vanced να κατεβάσει βίντεο;",
      "description": "Το Vanced δεν παρέχει δυνατότητα λήψης βίντεο, δεν πρόκειται να γίνει ποτέ.\n\nΠολλά βίντεο είναι διαθέσιμα για λήψη δωρεάν σε [επιλεγμένες χώρες](https://support.google.com/youtube/answer/6141269). Για όλο τον υπόλοιπο κόσμο, χρειάζεται το YouTube Premium.\n\nΤονίζουμε ξανά, το Vanced ΠΟΤΕ ΔΕΝ ΘΑ προσθέσει εργαλείο λήψης βίντεο στην εφαρμογή η οτιδήποτε παρόμοιο.\n\nΑυτός είναι ο λόγος που πολλές εφαρμογές στο παρελθόν, που πειράζουν το YouTube, έχουν κλείσει. Καθώς της Google δεν της αρέσει οι χρήστες να κατεβάζουν περιεχόμενο πνευματικών δικαιωμάτων, μέσω της πλατφόρμας τους, οπότε μην ζητάτε κάτι τέτοιο!!!"
    },
    {
      "title": "Γιατί δεν λειτουργούν οι χειρονομίες σάρωσης οθόνης;",
      "description": "Αν ρυθμίσατε να εμφανίζονται τα σχόλια στο κάτω μέρος (παλιά θέση) στις ρυθμίσεις του Vanced > Ρυθμίσεις διάταξης, απενεργοποιήστε το και επανεκκινήστε την εφαρμογή. Αν δεν δουλέψει αυτό, εξαναγκάσετε διακοπή της εφαρμογής και εκκαθαρίσετε τα δεδομένα της."
    },
    {
      "title": "Δεν υπάρχουν διαθέσιμοι υπότιτλοι;",
      "description": "Αυτό το ζήτημα δεν σχετίζεται με το Vanced ή το YouTube. Δεν έχουν όλα τα βίντεο υπότιτλους."
    },
    {
      "title": "Δέχεστε δωρεές;",
      "description": "ΔΕΝ δεχόμαστε δωρεές!\n\nΟποιοδήποτε είδος δωρεών υπό οποιεσδήποτε συνθήκες και τυχόν ιστοσελίδες, συνδέσμους ή δημοσιεύσεις που ζητούν δωρεές είναι απλώς ψεύτικες.\n\nΑλλά αν θέλετε να υποστηρίξετε τους δημιουργούς του Vanced, μπορείτε να κατεβάσετε το πρόγραμμα περιήγησης Brave χρησιμοποιώντας [αυτόν τον σύνδεσμο](https://brave.com/kev231) και το AdGuard χρησιμοποιώντας [αυτόν τον σύνδεσμο](https://adguard.com/en/welcome.html?aid=31141)."
    },
    {
      "title": "Πώς μπορώ να κάνω το πρόγραμμα αναπαραγωγής να αποκρύπτεται αυτόματα;",
      "description": "Μπορείτε να το ρυθμίσετε στο YouTube Vanced > Ρυθμίσεις> Προσβασιμότητα. Εάν οι ρυθμίσεις αποτύχουν να ανοίξουν ή δεν λειτουργούν, μεταβείτε στις ρυθμίσεις προσβασιμότητας της συσκευής σας και απενεργοποιήστε τον ενισχυτή ήχου, την πρόσβαση μέσω καθολικών διακοπτών και τους ζωντανούς υποτίτλους."
    },
    {
      "title": "Γιατί χρησιμοποιούνται τεμαχισμένα (split) APK;",
      "description": "Επειδή:\n\n1. Η αρχική εφαρμογή χρησιμοποιεί αυτήν τη μέθοδο, οπότε αντίστοιχα και το Vanced την χρησιμοποιεί.\n2. Εγκαθιστά μόνο τις γλώσσες που ορίζετε για τη μείωση της κατανάλωσης αποθηκευτικού χώρου.\n3. Έχει μόνο την έκδοση πυρήνα του APK που απαιτεί η συσκευή σας.\n\nΦυσικά, ο Διαχειριστής Vanced ή οι προγραμματιστές μπορούν να το μετατρέψουν σε ένα κανονικό, ενιαίο αρχείο APK, αλλά είμαστε πολύ τεμπέληδες το για να το κάνουμε. Απλά βολευτείτε με αυτό που διαθέτουμε...\n\nΜην ανησυχείτε όμως, ο Διαχειριστής Vanced κάνει όλη τη σκληρή δουλειά για σας, οπότε απλώς πατήστε το κουμπί `Εγκατάσταση`."
    },
    {
      "title": "Γιατί το χρώμα της οθόνης εκκίνησης είναι διαφορετικό από το θέμα;",
      "description": "Το χρώμα φόντου οθόνης εκκίνησης προέρχεται από το χρώμα πλαισίου Android έτσι ώστε να αλλάζει σύμφωνα με το θέμα του συστήματος. Μπορείτε να χρησιμοποιήσετε το [Substratum](https://play.google. om/store/apps/details?id=projekt.substratum), το [Swift Installer](https://play.google.com/store/apps/details?id=com.brit.swiftinstaller) ή μια παρόμοια εφαρμογή για να αλλάξετε το χρώμα."
    },
    {
      "title": "Πρέπει να ξανακάνω λήψη των αρχείων εγκατάστασης;",
      "description": "Τα αρχεία ενδέχεται να καταστραφούν εξαιτίας διαφόρων λόγων που στη συνέχεια μπορούν να προκαλέσουν προβλήματα. Για να το αποφύγετε αυτό, μπορείτε να επιλέξετε να ξανακάνετε λήψη για να βεβαιωθείτε ότι η εγκατάστασή σας έχει ολοκληρωθεί ομαλά."
    },
    {
      "title": "Γιατί η έκδοση root δεν διαθέτει δικαίωμα για το μικρόφωνο;",
      "description": "Διαθέτει, εφόσον το Vanced σας είναι ενημερωμένο."
    },
    {
      "title": "Τι είναι το ExoPlayer v1;",
      "description": "Είναι μια παλαιότερη έκδοση του τρέχοντος προγράμματος αναπαραγωγής πολυμέσων που χρησιμοποιείται από το YouTube. Ενδέχεται να έχετε καλύτερες επιδόσεις και σταθερότητα όταν τη χρησιμοποιείτε."
    },
    {
      "title": "Πώς ενεργοποιώ τις κρυφές ρυθμίσεις;",
      "description": "Στις ρυθμίσεις του Vanced, πατήστε την ενότητα `Ομάδα προγραμματιστών` 6-7 φορές για ενεργοποίηση. Θα ενεργοποιηθούν μόνο οι επιπλέον ρυθμίσεις κωδικοποιητή βίντεο."
    },
    {
      "title": "Πως επιλέγω το YouTube Vanced ως προεπιλεγμένη εφαρμογή;",
      "description": "Όπως το λέει ο τίτλος, πολλοί χρήστες ρωτάνε πως μπορούν να ορίσουν το YouTube Vanced ως την προεπιλεγμένη εφαρμογή που θα ανοίγει συνδέσμους του YouTube από άλλες εφαρμογές (όπως εφαρμογές μηνυμάτων, προγράμματα περιήγησης ιστού και οποιαδήποτε άλλη εφαρμογή).\n\nΓια χρήστες με πρόσβαση root, δεν χρειάζεται να ανησυχείτε γι'αυτό διότι ήδη ορίζεται ως προεπιλεγμένη εφαρμογή εφόσον η αρχική εφαρμογή αντικαθιστάται με το YouTube Vanced.\n\nΓια τους απλούς χρήστες χωρίς πρόσβαση root, υπάρχουν διάφορες λύσεις αναλόγως αν έχετε OneUI, MIUI ή κάποια άλλη εκδοχή του Android. Δεν μπορούμε να καλύψουμε όλες τις περιπτώσεις ούτε να παρέχουμε λύσεις για όσες παραλλαγές του Android κυκλοφορούν, μπορεί να χρειαστεί να το ψάξετε μόνοι σας.",
      "fields": [
        {
          "title": "Χρήστες OneUI:",
          "content": "1. Κρατείστε πατημένο το εικονίδιο της εφαρμογής YouTube ή YouTube Vanced (στο κέντρο του εικονιδίου μην τυχόν το μετακινήσετε)\n2. Πατήστε την επιλογή **Πληροφορίες Εφαρμογής**.\n3. Βρείτε την επιλογή \"**Ορισμός ως προεπιλογής**\" και πατήστε την\n4. Πατήστε την επιλογή \"**Άνοιγμα υποστηριζόμενων συνδέσμων**\" και επιλέξτε \"**Άνοιγμα σε αυτήν την εφαρμογή**\"\n\nΣε παλιότερες εκδόσεις του OneUI, αλλάζουν μόνο λίγο τα ονόματα των επιλογών του 4ου βήματος. Θα χρειαστεί να πατήσετε την επιλογή \"**Μετάβαση σε υποστηρ. URL**\" και να επιλέξετε \"**Σε αυτήν την εφαρμογή**\".\nΣτις αρχικές (παλιές) εκδόσεις του OneUI 💩, θα χρειαστεί να πάτε στις **Ρυθμίσεις** > **Εφαρμογές** > *[πατήστε τις 3 τελίτσες στην πάνω δεξιά γωνία]* > **Προεπιλεγμένες εφαρμογές** > **Ορισμός ως προεπιλογή**. Μετά από λίγο, μόλις φορτώσουν οι εφαρμογές, βρείτε το YouTube ή το YouTube Vanced και ακολουθείστε το 4ο βήμα..."
        },
        {
          "title": "Χρήστες MIUI:",
          "content": "1. Ανοίξτε τις Ρυθμίσεις\n2. Πηγαίντε στην επιλογή **Εφαρμογές**,\n3. **Διαχείριση εφαρμογών**,\n4. Μετά, πατήστε στις 3 τελίτσες στην πάνω δεξιά γωνία,\n5. **Προεπιλεγμένες εφαρμογές**,\n6. **Σύνδεσμοι ανοίγματος**.\n7. Περιμένετε μέχρι να φορτώσουν όλες οι εφαρμογές…\n8. Βρείτε το YouTube ή το YouTube Vanced και πατήστε πάνω του.\n9. Πατήστε \"**Άνοιγμα υποστηριζομένων συνδέσμων**\" και επιλέξτε \"**Άνοιγμα**\""
        },
        {
          "title": "AOSP & άλλες προσαρμοσμένες διεπαφές χρήστη (OOS, ColorOS, EMUI, κτλπ.):",
          "content": "1. Ανοίξτε τις **Ρυθμίσεις**\n2. Μεταβείτε στην επιλογή **Εφαρμογές**\n3. Πατήστε **Προεπιλεγμένες εφαρμογές**\n4. Βρείτε το **YouTube** ή το **YouTube Vanced**\n5. Πατήστε \"**Μετάβαση στα υποστηριζόμενα URLs**\" και επιλέξτε \"**Άνοιγμα με αυτήν την εφαρμογή**\"\n\nΑν εξακολουθείτε να αντιμετωπίζετε τέτοια προβλήματα, μπορεί να χρειαστεί να αναζητήσετε στο [Google](https://www.google.com/search?q=%22android%22+how+to+open+youtube+links+with+youtube) μερικά άρθρα (δυστυχώς υπάρχουν λύσεις μόνο στα αγγλικά) για το πως να το κάνετε να δουλέψει ή μπορείτε να εγκαταστήσετε κάποια εφαρμογή τρίτων από το [Play Store](https://play. oogle.com/store/search?q=open%20with) για να σας σώσει από αυτήν την ταλαιπωρία…"
        }
      ]
    },
    {
      "title": "Γιατί η έκδοση root δεν λειτουργεί με το microG Core;",
      "description": "1. Πρέπει να έχετε τουλάχιστον την έκδοση [pico](https://github.com/opengapps/opengapps/wiki/Pico-Package) των GApps για την εκτέλεση του Vanced.\n\n2. Δεν μπορείτε να εκτελέσετε το Vanced με το microG Core, χωρίς το πλαίσιο υπηρεσιών Google Play, το οποίο διατίθεται σε όλα τα πακέτα GApps και είναι μια απαιτούμενη βιβλιοθήκη.\n\n3. Αν ανησυχείτε για το απόρρητό σας και δεν θέλετε να χρησιμοποιείτε GApps, αλλά θέλετε να παρακολουθείτε YouTube χωρίς διαφημίσεις, η [έκδοση ιστότοπου](https://youtube.com) είναι πάντα διαθέσιμη."
    },
    {
      "title": "Γιατί δεν λειτουργεί η μετάδοση;",
      "description": "Για τους απλούς χρήστες non-root στην τελευταία έκδοση v16.16.38, υπάρχει ένα σφάλμα με το microG. Μέχρι να επιδιορθωθεί, παρακαλώ περιμένετε για κάποια ενημέρωση ή γυρίστε στις εκδόσεις v15. Οι χρήστες με πρόσβαση root δεν θα έχουν προβλήματα με την μετάδοση αν χρησιμοποιούν τις υπηρεσίες Google Play."
    },
    {
      "title": "Τι είναι η Υπογραφή των APK;",
      "description": "You are reading this because you are not using Vanced Manager or you may have installed Vanced from an unofficial source.\nJust use Vanced Manager!\n\nYou can safely download Vanced Manager from:\n- [Official site](https://vancedapp.com)\n- [GitHub repository](https://github.com/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Is YouTube Vanced on Play Store?",
      "description": "NO!\nAgain, DO NOT install or even try to search for any fake apps named \"YouTube Vanced\" or similar on the Play Store or any app stores to install Vanced.\n\nWe only have [Vanced Guide](https://play.google.com/store/apps/details?id=com.vanced.faq), and it's the only official app published on Play Store.\n\nIf you find any other app with our icon and name, report it as impersonation and give it a bad review.\n\nOur apps can only be found at [official site](https://vancedapp.com)."
    },
    {
      "title": "Why is Vanced not showing up in home screen or app drawer?",
      "description": "You are reading this because you are not using Vanced Manager or you may have installed Vanced from an unofficial source.\nJust use Vanced Manager!\n\nYou can safely download Vanced Manager from:\n- Official site <https://vancedapp.com>\n- [GitHub repository](https://github.com/YTVanced/VancedManager/releases/latest)"
    },
    {
      "title": "Why aren't videos playing?",
      "description": "Try restarting the app. It might also because of your internet connection or your device."
    },
    {
      "title": "Why am I having the 480p limit?",
      "description": "Due to the COVID-19, Google is restricting data usage of several countries. This happens on the server and affects both Vanced and stock YouTube users.",
      "fields": [
        {
          "title": "Workarounds:",
          "content": "1. Connect to a VPN of a different region.\n2. Use the [web version](https://youtube.com)\n3. Since the 480p restriction is only for phones and not tablets, you can change the device model in YouTube Vanced to overcome the restriction.\n\n#### How to change the device model?\n1. Open YouTube Vanced.\n2. Go to Settings\n3. Tap the `Vanced Settings`\n4. Enable hidden settings:\n  - Scroll down and tap on the `About` section till you get a message saying `Hidden settings enabled`.\n5. Go to `Codec override`\n6. Set manufacturer to `Samsung` and model to `SM-T865`.\n7. Restart the app.\n\nAfter restarting, the 480p limit should be gone."
        }
      ]
    },
    {
      "title": "How to hide the microG notification?",
      "description": "To hide microG the notification,\n\n1. You can disable battery optimization for Vanced microG and reboot your device.\n\n2. If the above method doesn't work, disable microG notifications by holding on to the notification, toggle it off and tap Save.\n\n> Disabling app notifications can be done in different ways depending on the Android user interface. If you don't know how to disable it, try using Google for learning how to disable it."
    },
    {
      "title": "Does 1440p look better on my 1080p screen?",
      "description": "Yes, but only if the video ratio is something like 18:9, 21:9, ... You can enable `Stats for nerds` in Settings > General to confirm it.\n\nTo enable higher resolutions, go to Vanced settings > Video settings and turn on `Max resolution` then restart the app."
    }
  ]
}
