{
  "features": [
    {
      "title": "Vanced",
      "description": "Το YouTube Vanced στοχεύει να είναι μια καλύτερη έκδοση του Youtube. Περιλαμβάνει αφαίρεση διαφημίσεων, λειτουργία απόλυτου μαύρου και πολλά άλλα. Χρησιμοποιήστε τον διαχειριστή Vanced για να εγκαταστήσετε το YouTube Vanced με σχετική ευκολία."
    },
    {
      "title": "YouTube Vanced Music",
      "description": "Το YouTube Vanced Music έχει τον ίδιο στόχο με το YouTube Vanced, αλλά αυτή η εφαρμογή εστιάζει στο YouTube Music. Είναι λιγότερο πλούσια σε χαρακτηριστικά σε σχέση με το YouTube Vanced, αλλά ακόμα προσφέρει πολλά πράγματα, όπως αφαίρεση διαφημίσεων και αναπαραγωγή παρασκηνίου, όλα αυτά μέσα στο YouTube Music!"
    },
    {
      "title": "Κυρία χαρακτηριστικά του YouTube Vanced",
      "description": "Ένα απόλυτα μαύρο θέμα για OLED οθόνες.\n- Αφαιρεί όλες τις διαφημίσεις των βίντεο.\n-Σας επιτρέπει να αναπαράγετε βίντεο στο παρασκήνιο ή σε λειτουργία (PiP) εικόνας μέσα σε εικόνα (μόνο στο Android 8. και άνω)\n- Σάρωση οθόνης σας επιτρέπει να ελέγχετε τη φωτεινότητα και ένταση του βίντεο σαρώνοντας, πάνω/κάτω με το δάκτυλο, αριστερά/δεξιά της οθόνης (με όριο σάρωσης).\n- Λειτουργία αυτόματης επανάληψης που σας επιτρέπει να ξαναβλέπετε βίντεο όσες φορές θέλετε.\n- Η νέα διάταξη σχολίων και του ελαχιστοποιημένου αναπαραγωγού μπορεί να προσαρμοστεί όπως στην έκδοση για tablet που είναι πολύ παρόμοια με την παλιότερη έκδοση (αν και είναι λίγο προβληματική)."
    },
    {
      "title": "Προσαρμογή",
      "description": "- Σας επιτρέπει να παρακάμψετε τις επιλογές κωδικοποιητή όπως ο εξαναγκασμός του H264 για παλιότερες συσκευές ή του VP9, αυτό σας επιτρέπει επίσης να εξαναγκάσετε την αναπαραγωγή HDR ή να απενεργοποιήσετε τα 60fps αν προτιμάτε μια κινηματογραφική εμπειρία. (Μπορούν να βρεθούν προσαρμοσμένες παράμετροι συσκευών για αυτές τις λειτουργίες στον [Discord Διακομιστή](https://discord.gg/Vanced) ή στο XDA μας.)\n- Εξαναγκασμός της προεπιλεγμένης ανάλυσης βίντεο όσο υψηλή ή όσο χαμηλή θέλετε, ακόμα και παράκαμψη της ανάλυσης οθόνης σας για μια πιο ευκρινές 4k αναπαραγωγή σε οποιαδήποτε συσκευή. Σας επιτρέπει επίσης να αλλάξετε την προεπιλεγμένη ταχύτητα αναπαραγωγής σε οτιδήποτε μεταξύ 0.25x έως 2x (υποθέτοντας ότι η συσκευή σας είναι αρκετά ισχυρή για να το κάνει αυτό)\n- Σας επιτρέπει να αφαιρέσετε: τις διαφημίσεις από την αρχική οθόνη, τις περισσότερες διαφημίσεις διεπαφής χρήστη, τις διαφημίσεις εμπορευμάτων, τις δημοσιεύσεις της Κοινότητας, διαφημίσεις Ταινιών, προωθήσεις της εφαρμογής (όπως οι πληροφορίες για covid), τα σχόλια εντελώς, συνεπτιγμένες προωθήσεις ταινιών, συλλογής ταινιών και πολλά άλλα!"
    },
    {
      "title": "SponsorBlock (Αποκλεισμός Χορηγών)",
      "description": "- Παρέχει τη δυνατότητα παράλειψης τμημάτων χορηγών (όπου οι youtuber διαφημίζουν κάποια υπηρεσία ή προϊόν στη μέση του βίντεο)\n- Υποστηρίζει επίσης την παράλειψη άλλων κατηγοριών, όπως εισαγωγές, επιλόγους και αυτοπροωθήσεις.\n- Χρησιμοποιείται το API που βρίσκεται εδώ. Μπορείτε να βρείτε περισσότερες πληροφορίες για το πώς λειτουργεί.\n- Σας επιτρέπει επίσης να υποβάλλετε τα δικά σας τμήματα στο API και να συνεισφέρετε στην ευρύτερη κοινότητα\n- Πλήρης έλεγχος για το αν θα παραλείπεται αυτόματα μια κατηγορία τμημάτων ή αν θα εμφανίζεται ένα κουμπί για παράλειψη, ή απλά να μην παραλείπεται.\n- Τονίζει με συγκεκριμένο χρώμα με βάση την κατηγορία του τμήματος στην μπάρα χρόνου του βίντεο."
    },
    {
      "title": "Υποστηριζόμενες Πλατφόρμες",
      "description": "Αυτή η εφαρμογή μέχρι στιγμής υπάρχει μόνο για android, δεν υπάρχουν σχέδια για υποστήριξη οποιασδήποτε άλλης πλατφόρμας αυτή τη στιγμή"
    },
    {
      "title": "Διαφορά μεταξύ έκδοσης Root και Non-Root",
      "description": "- Root: \nΗ έκδοση Root του Vanced αντικαθιστά την επίσημη εφαρμογή του YouTube. Με αποτέλεσμα να μπορείτε να ανοίγετε συνδέσμους του YouTube ή να καλέσετε τον βοηθό Google να το κάνει απευθείας στην πλέον πειραγμένη εφαρμογή YouTube Vanced.\n- Non-Root: \n- Εάν έχετε μια συσκευή που είναι δύσκολο να την κάνετε root ή εάν το δεν θέλετε να κάνετε root στην συσκευή που χρησιμοποιείτε καθημερινά, επιλέξτε την έκδοση Non-Root. \n- Γίνεται να εγκατασταθεί και σε μια συσκευή με πρόσβαση root. Διότι ότι το όνομα πακέτου της Non-Root έκδοσης της εφαρμογής είναι διαφορετικό από την επίσημη εφαρμογή YouTube, οπότε μπορούν να συνυπάρξουν και οι δύο εφαρμογές. Να σημειωθεί ότι πρέπει να εγκατασταθεί μια επιπλέον συνοδευτική εφαρμογή (Vanced microG) για να μπορέσετε να συνδεθείτε με τον Google λογαριασμό σας στο YouTube. \n- Επιπλέον, θα πρέπει να ρυθμίσετε χειροκίνητα το Vanced ως προεπιλεγμένη εφαρμογή για το άνοιγμα συνδέσμων του YouTube. \n- Ωστόσο, η έκδοση Non-Root είναι πιο απλούστερη και εύκολη για χρήση, οπότε σας προτείνουμε να χρησιμοποιείσετε αυτήν την έκδοση, εκτός αν θέλετε να αντικαταστήσετε τελείως την επίσημη εφαρμογή YouTube."
    }
  ]
}
